{"arxiv": {"text": "\\section{Introduction}\n\\label{sec:intro}\n\n\\emph{Gender diversity}, or more often its lack thereof, among participants to\nsoftware development activities has been thoroughly studied in recent years. In\nparticular, the presence of, effects of, and countermeasures for \\emph{gender\n  bias} in Free/Open Source Software (FOSS) have received a lot of attention\nover the past decade~\\cite{david2008fossdevs, qiu2010kdewomen,\n  nafus2012patches, kuechler2012genderfoss, vasilescu2014gender,\n  oneil2016debiansurvey, robles2016womeninfoss, terrell2017gender,\n  zacchiroli2021gender}.  \\emph{Geographic diversity} is on the other hand the\nkind of diversity that stems from participants in some global activity coming\nfrom different world regions and cultures.\n\nGeographic diversity in FOSS has received relatively little attention in scholarly\nworks. In particular, while seminal survey-based and\npoint-in-time medium-scale studies of the geographic origins of FOSS\ncontributors exist~\\cite{ghosh2005understanding, david2008fossdevs,\n  barahona2008geodiversity, takhteyev2010ossgeography, robles2014surveydataset,\n  wachs2021ossgeography}, large-scale longitudinal studies of the geographic\norigin of FOSS contributors are still lacking. Such a quantitative\ncharacterization would be useful to inform decisions related to global\ndevelopment teams~\\cite{herbsleb2007globalsweng} and hiring strategies in the\ninformation technology (IT) market, as well as contribute factual information\nto the debates on the economic impact and sociology of FOSS around the world.\n\n\n\\paragraph{Contributions}\n\nWith this work we contribute to close this gap by conducting \\textbf{the first\n  longitudinal study of the geographic origin of contributors to public code\n  over 50 years.} Specifically, we provide a preliminary answer to the\nfollowing research question:\n\\begin{researchquestion}\n  From which world regions do authors of publicly available commits come from\n  and how has it changed over the past 50 years?\n  \\label{rq:geodiversity}\n\\end{researchquestion}\nWe use as dataset the \\SWH/ archive~\\cite{swhipres2017} and analyze from it\n2.2 billion\\xspace commits archived from 160 million\\xspace projects and authored by\n43 million\\xspace authors during the 1971--2021 time period. \nWe geolocate developers to\n\\DATAWorldRegions/ world regions, using as signals email country code top-level domains (ccTLDs) and \nauthor (first/last) names compared with name distributions around the world, and UTC offsets \nmined from commit metadata.\n\nWe find evidence of the early dominance of North America in open source\nsoftware, later joined by Europe. After that period, the geographic diversity \nin public code has been constantly increasing.\nWe also identify relevant historical shifts\nrelated to the end of the UNIX wars and the increase of coding literacy in\nCentral and South Asia, as well as of broader phenomena like colonialism and\npeople movement across countries (immigration/emigration).\n\n\n\n\n\\paragraph{Data availability.}\n\nA replication package for this paper is available from Zenodo at\n\\url{https://doi.org/10.5281/zenodo.6390355}~\\cite{replication-package}.\n\n\n \\section{Related Work}\n\\label{sec:related}\n\nBoth early and recent works~\\cite{ghosh2005understanding, david2008fossdevs,\n  robles2014surveydataset, oneil2016debiansurvey} have characterized the\ngeography of Free/Open Source Software (FOSS) using \\emph{developer surveys},\nwhich provide high-quality answers but are limited in size (2-5\\,K developers)\nand can be biased by participant sampling.\n\nIn 2008 Barahona et al.~\\cite{barahona2008geodiversity} conducted a seminal\nlarge-scale (for the time) study on FOSS \\emph{geography using mining software\n  repositories (MSR) techniques}. They analyzed the origin of 1\\,M contributors\nusing the SourceForge user database and mailing list archives over the\n1999--2005 period, using as signals information similar to ours: email domains\nand UTC offsets. \nThe studied period (7 years) in~\\cite{barahona2008geodiversity} is shorter than \nwhat is studied in the present paper (50 years) and the data sources are \nlargely different; with that in mind, our results show a slightly larger quote of \nEuropean v.~North American contributions.\n\nAnother empirical work from 2010 by Takhteyev and\nHilts~\\cite{takhteyev2010ossgeography} harvested self-declared geographic\nlocations of GitHub accounts recursively following their connections,\ncollecting information for $\\approx$\\,70\\,K GitHub users.  A very recent\nwork~\\cite{wachs2021ossgeography} by Wachs et al.~has geolocated half a million\nGitHub users, having contributed at least 100 commits each, and who\nself-declare locations on their GitHub profiles. While the study is\npoint-in-time as of 2021, the authors compare their findings\nagainst~\\cite{barahona2008geodiversity, takhteyev2010ossgeography} to\ncharacterize the evolution of FOSS geography over the time snapshots taken by\nthe three studies.\n\nCompared with previous empirical works, our study is much larger scale---having\nanalyzed 43 million\\xspace authors of 2.2 billion\\xspace commits from 160 million\\xspace\nprojects---longitudinal over 50 years of public code contributions rather than\npoint in time, and also more fine-grained (with year-by-year granularity over\nthe observed period). Methodologically, our study relies on Version Control\nSystem (VCS) commit data rather than platform-declared location information.\n\n\nOther works---in particular the work by Daniel~\\cite{daniel2013ossdiversity}\nand, more recently, Rastogi et al.~\\cite{rastogi2016geobias,\n  rastogi2018geobias, prana2021geogenderdiversity}---have studied geographic\n\\emph{diversity and bias}, i.e., the extent to which the origin of FOSS\ndevelopers affect their collaborative coding activities.\nIn this work we characterized geographic diversity in public code for the first\ntime at this scale, both in terms of contributors and observation period. We do\nnot tackle the bias angle, but provide empirical data and findings that can be\nleveraged to that end as future work.\n\n\\emph{Global software engineering}~\\cite{herbsleb2007globalsweng} is the\nsub-field of software engineering that has analyzed the challenges of scaling\ndeveloper collaboration globally, including the specific concern of how to deal\nwith geographic diversity~\\cite{holmstrom2006globaldev, fraser2014eastwest}.\nDecades later the present study provides evidence that can be used, in the\nspecific case of public code and at a very large scale, to verify which\npromises of global software engineering have borne fruit.\n\n\n\n\n\n\n \\section{Methodology}\n\\label{sec:method}\n\n\n\\newif\\ifgrowthfig  \\growthfigtrue\n\\ifgrowthfig\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{yearly-commits}\n  \\caption{Yearly public commits over time (log scale).\n}\n  \\label{fig:growth}\n\\end{figure}\n\\fi\n\n\\paragraph{Dataset}\n\nWe retrieved from \\SWH/~\\cite{swh-msr2019-dataset} all commits archived until \\DATALastCommitDate/.\nThey amount to \\DATACommitsRaw/ commits, unique by SHA1 identifier, harvested from \\DATATotalCommitsInSH/ public projects coming from major development forges (GitHub, GitLab, etc.) and package repositories (Debian, PyPI, NPM, etc.).\nCommits in the dataset are by \\DATAAuthorsRaw/ authors, unique by $\\langle$name, email$\\rangle$ pairs.\nThe dataset came as two relational tables, one for commits and one for authors, with the former referencing the latter via a foreign key.\n\\iflong\nEach row in the commit table contains the following fields: commit SHA1 identifier, author and committer timestamps, author and committer identifiers (referencing the author table).\nThe distinction between commit authors and committers come from Git, which allows to commit a change authored by someone else.\nFor this study we focused on authors and ignored committers, as the difference between the two is not relevant for our research questions and the amount of commits with a committer other than its author is negligible.\n\\fi\nFor each entry in the author table we have author full name and email as two separate strings of raw bytes.\n\nWe removed implausible or unusable names that: are not decodable as UTF-8 (\\DATAAuthorsRmNondecodable/ author names removed), are email addresses instead of names (\\DATAAuthorsRmEmail/ ``names''), consist of only blank characters (\\DATAAuthorsRmBlank/), contain more than 10\\% non-letters (\\DATAAuthorsRmNonletter/), are longer than 100 characters (\\DATAAuthorsRmToolong/).\nAfter filtering, about \\DATAAuthorsPlausibleApprox/ authors (\\DATAAuthorsPlausiblePct/ of the initial dataset) remained for further analysis.\n\nNote that the amount of public code commits (and authors) contained in the\ninitial dataset grows exponentially over\ntime~\\cite{swh-provenance-emse}\\ifgrowthfig, as shown for commits in\n\\Cref{fig:growth}\\else: from $10^4$ commits in 1971, to $10^6$ in 1998, to\nalmost $10^9$ in 2020\\fi. As a consequence the observed trends tend to be more\nstable in recent decades than in 40+ year-old ones, due to statistics taken on\nexponentially larger populations.\n\n\n\\paragraph{Geolocation}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[clip,trim=6cm 6cm 0 0,width=\\linewidth]{subregions-ours}\n  \\caption{The \\DATAWorldRegions/ world regions used as geolocation targets.}\n  \\label{fig:worldmap}\n\\end{figure}\n\nAs geolocation targets we use macro world regions derived from the United Nations geoscheme~\\cite{un1999geoscheme}.\nTo avoid domination by large countries (e.g., China or Russia) within macro regions, we merged and split some regions based on geographic proximity and the sharing of preeminent cultural identification features, such as spoken language.\n\\Cref{fig:worldmap} shows the final list of \\DATAWorldRegions/ world regions used as geolocation targets in this study.\n\nGeolocation of commit authors to world regions uses the two complementary techniques introduced in~\\cite{icse-seis-2022-gender}, briefly recalled below.\nThe first one relies on the country code top-level domain (ccTLD) of email addresses extracted from commit metadata, e.g., \\texttt{.fr}, \\texttt{.ru}, \\texttt{.cn}, etc.\nWe started from the IANA list of Latin character ccTLDs~\\cite{wikipedia-cctld} and manually mapped each corresponding territory to a target world region.\n\nThe second geolocation technique uses the UTC offset of commit timestamps (e.g., UTC-05:00) and author names to determine the most likely world region of the commit author.\nFor each UTC offset we determine a list of compatible places (country, state, or dependent territory) in the world that, at the time of that commit, had that UTC offset; commit time is key here, as country UTC offsets vary over time due to timezone changes.\nTo make this determination we use the IANA time zone database~\\cite{tzdata}.\n\nThen we assign to each place a score that captures the likelihood that a given author name is characteristic of it.\nTo this end we use the Forebears dataset of the frequencies of the most common first and family names which, quoting from~\\cite{forebear-names}: {\\itshape ``provides the approximate incidence of forenames and surnames produced from a database of \\num{4 044 546 938} people (55.5\\% of living people in 2014). As of September 2019 it covers \\num{27 662 801} forenames and \\num{27 206 821} surnames in 236 jurisdictions.''}\nAs in our dataset authors are full name strings (rather than split by first/family name), we first tokenize names (by blanks and case changes) and then lookup individual tokens in both first and family names frequency lists.\nFor each element found in name lists we multiply the place population\\footnotemark{} by the name frequency to obtain a measure that is proportional to the number of persons bearing that name (token) in the specific place.\n\\footnotetext{To obtain population totals---as the notion of ``place'' is heterogeneous: full countries v.~slices of large countries spanning multiple timezones---we use a mixture of primary sources (e.g., government websites), and non-primary ones (e.g., Wikipedia articles).}\nWe sum this figure for all elements to obtain a place score, ending up with a list of $\\langle$place, score$\\rangle$ pairs.\nWe then partition this list by the world region that a place belongs to and sum the score for all the places in each region to obtain an overall score, corresponding to the likelihood that the commit belongs to a given world region.\nWe assign the starting commit as coming from the world region with the highest score.\n\nThe email-based technique suffers from the limited and unbalanced use of ccTLDs: most developers use generic TLDs such as \\texttt{.com}, \\texttt{.org}, or \\texttt{.net}.\nMoreover this does not happen uniformly across zones: US-based developers, for example, use the \\texttt{.us} ccTLD much more seldomly than their European counterparts.\nOn the other hand the offset/name-based technique relies on the UTC offset of the commit timestamps.\nDue to tool configurations on developer setups, a large number of commits in the dataset has an UTC offset equal to zero.\nThis affects less recent commits (\\DATACommitsTZZTwoThousandTwenty/ of 2020s commits have a zero offset) than older ones (\\DATACommitsTZZTwoThousand/ in 2000).\nAs a result the offset/name-based technique could end up detecting a large share of older commits as authored by African developers, and to a lesser extent Europeans.\n\nTo counter these issues we combine the two geolocation techniques together by applying the offset/name-based techniques to all commits with a non-zero UTC offset, and the email-based on to all other commits.\n\n\n \\section{Results and Discussion}\n\\label{sec:results}\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=\\linewidth]{stacked.pdf}\n  \\caption{Ratio of commits (above) and active authors (below) by world zone over the 1971--2020 period.}\n  \\Description[Chart]{Stacked bar chart showing the world zone ratios for commits and authors over the 1971--2020 period.}\n  \\label{fig:results}\n\\end{figure*}\n\n\n \nTo answer \\cref{rq:geodiversity} we gathered the number of commits and distinct authors per year and per world zone.\nWe present the obtained results in \\Cref{fig:results} as two stacked bar charts, showing yearly breakdowns for commits and authors respectively.\nEvery bar represents a year and is partitioned in slices showing the commit/author ratio for each of the world regions of \\Cref{fig:worldmap} in that year.\nTo avoid outliers due to sporadic contributors, in the author chart we only consider authors having contributed at least 5 commits in a given year.\n\nWhile observing trends in the charts remember that the total numbers of commits and authors grow exponentially over time.\nHence for the first years in the charts, the number of data points in some world regions can be extremely small, with negative consequences on the stability of trends.\n\n\n\n\n\\paragraph{Geographic diversity over time}\n\nOverall, the general trend appears to be that the \\textbf{geographic diversity in public code is increasing}: North America and Europe alternated their ``dominance'' until the middle of the 90s; from that moment on most other world regions show a slow but steady increment.\nThis trend of increased participation into public code development includes Central and South Asia (comprising India), Russia, Africa, Central and South America,\nNotice that also zones that do not seem to follow this trend, such as Australia and New Zealand, are also increasing their participation, but at a lower speed with respect to other zones.\nFor example, Australia and New Zealand incremented the absolute number of their commits by about 3 orders of magnitude from 2000 to present days.\n\nAnother interesting phenomenon that can be appreciated in both charts is the sudden contraction of contributions from North America in 1995; since the charts depict ratios, this corresponds to other zones, and Europe in particular, increasing their share.\nAn analysis of the main contributions in the years right before the contraction shows that nine out of ten have \\texttt{ucbvax.Berkeley.EDU} as author email domain, and the tenth is Keith Bostic, one of the leading Unix BSD developers, appearing with email \\texttt{bostic}.\nNo developer with the same email domain appears anymore within the first hundred contributors in 1996.\nThis shows the relevance that BSD Unix and the Computer Systems Research Group at the University of California at Berkeley had in the history of open source software.\nThe group was disbanded in 1995, partially as a consequence of the so-called UNIX wars~\\cite{kernighan2019unixhistory}, and this contributes significantly---also because of the relatively low amount of public code circulating at the time---to the sudden drop of contributions from North America in subsequent years.\nDescendant UNIX operating systems based on BSD, such as OpenBSD, FreeBSD, and NetBSD had smaller relevance to world trends due to (i) the increasing amount of open source code coming from elsewhere and (ii) their more geographically diverse developer community.\n\nAnother time frame in which the ratios for Europe and North America are subject to large, sudden changes is 1975--79.\nA preliminary analysis shows that these ratios are erratic due to the very limited number of commits in those time period, but we were unable to detect a specific root cause.\nTrends for those years should be subject to further studies, in collaboration with software historians.\n\n\n\\paragraph{Colonialism}\n\nAnother trend that stands out from the charts is that Africa appears to be well represented.\nTo assess if this results from a methodological bias, we double-checked the commits detected as originating from Africa for timezones included in the $[0, 3]$ range using both the email- the offset/name-based methods.\nThe results show that the offset/name-based approach assigns 22.7\\% of the commits to Africa whereas the email-based one only assigns 2.7\\% of them.\nWhile a deeper investigation is in order, it is our opinion that the phenomenon we are witnessing here is a consequence of colonialism, specifically the adoption of Europeans names in African countries.\nFor example the name Eric, derived from Old Norse, is more popular in Ghana than it is in France or in the UK.\nThis challenges the ability of the offset/name-based method to correctly differentiate between candidate places.\nTogether with the fact that several African countries are largely populated, the offset/name-based method could detect European names as originating from Africa.\nWhile this cuts both way, the likelihood of a random person contributing to public code is very different between European countries, all having a well-developed software industry, and African countries that do not all share this trait.\n\n\n\\paragraph{Immigration/emigration}\n\nAnother area where a similar phenomenon could be at play is the evolution of Central and South America.\nContribution from this macro region appears to be growing steadily.\nTo assess if this is the result of a bias introduced by the name-based detection we analyzed the evolution of offset/name-based assignment over time for authors whose email domain is among the top-ten US-based entities in terms of overall contributions (estimated in turn by analyzing the most frequent email domains and manually selecting those belonging to US-based entities).\nIn 1971 no author with an email from top US-based entities is detected as belonging to Central and South America, whereas in 2019 the ratio is 12\\%.\nNowadays more than one tenth of the people email-associated to top US-based entities have popular Central and South American names, which we posit as a likely consequence of immigration into US (emigration from Central and South America).\nSince immigration has a much longer history than what we are studying here, what we are witnessing probably includes long-term consequences of it, such as second and third generation immigrants employed in white-collar jobs, such as software development.\n\n\n\n\n \\section{Limitations and Future Work}\n\\label{sec:conclusion}\n\nWe have performed an exploratory, yet very large scale, empirical study of the geographic diversity in public code commits over time.\nWe have analyzed 2.2 billion\\xspace public commits covering the \\DATAYearRange/ time period.\nWe have geolocated developers to \\DATAWorldRegions/ world regions using as signals email domains, timezone offsets, and author names.\nOur findings show that the geographic diversity in public code is increasing over time, and markedly so over the past 20--25 years.\nObserved trends also co-occur with historical events and macro phenomena like the end of the UNIX wars, increase of coding literacy around the world, colonialism, and immigration.\n\n\n\\medskip\n\\emph{Limitations.}\nThis study relies on a combination of two geolocation methods: one based on email domains, another based on commit UTC offsets and author names.\nWe discussed some of the limitations of either method in \\Cref{sec:method}, motivating our decision of restricting the use of the email-based method to commits with a zero UTC offset.\nAs a consequence, for most commits in the dataset the offset/name-based method is used.\nWith such method, the frequencies of forenames and surnames are used to rank candidate zones that have a compatible UTC offset at commit time.\n\nA practical consequence of this is that for commits with, say, offset UTC+09:00 the candidate places can be Russia, Japan and Australia, depending on the specific date due to daylight saving time.\nPopular forenames and surnames in these regions tend to be quite different so the likelihood of the method to provide a reliable detection is high.\nFor other offsets the set of popular forenames and surnames from candidate zones can exhibit more substantial overlaps, negatively impacting detection accuracy.\nWe have discussed some of these cases in \\Cref{sec:results}, but other might be lingering in the results impacting observed trends.\n\nThe choice of using the email-based method for commits with zero UTC offset, and the offset/name-based method elsewhere, has allowed us to study all developers not having a country-specific email domain (ccTLD), but comes with the risk of under-representing the world zones that have (in part and in some times of the year) an actual UTC offset of zero.\n\nA potential bias in this study could be introduced by the fact that the name database used for offset/name-based geolocation only contains names formed using Latin alphabet characters.\nWe looked for names containing Chinese, Japanese, and Korean characters in the original dataset, finding only a negligible amount of authors who use non-Latin characters in their VCS names, which leads us to believe that the impact of this issue is minimal.\n\nWe did not apply identity merging (e.g., using state-of-the-art tools like SortingHat~\\cite{moreno2019sortinghat}), but we do not expect this to be a significant issue because: (a) to introduce bias in author trends the distribution of identity merges around the world should be uneven, which seems unlikely; and (b) the observed commit trends (which would be unaffected by identity merging) are very similar to observed author trends.\n\nWe did not systematically remove known bot accounts~\\cite{lebeuf2018swbots} from the author dataset, but we did check for the presence of software bots among the top committers of each year. We only found limited traces of continuous integration (CI) bots, used primarily to automate merge commits. After removing CI bots from the dataset the observed global trends were unchanged, therefore this paper presents unfiltered data.\n\n\n\\medskip\n\\emph{Future work.}\nTo some extent the above limitations are the price to pay to study such a large dataset: there exists a trade-off between large-scale analysis and accuracy.\nWe plan nonetheless to further investigate and mitigate them in future work.\nMulti-method approaches, merging data mining with social science methods, could be applied to address some of the questions raised in this exploratory study.\nWhile they do not scale to the whole dataset, multi-methods can be adopted to dig deeper into specific aspects, specifically those related to social phenomena.\nSoftware is a social artifact, it is no wonder that aspects related to sociocultural evolution emerge when analyzing its evolution at this scale.\n\n\n\n\n \n\\clearpage\n\n\n", "meta": {"timestamp": "2022-03-30T02:27:00", "yymm": "2203", "arxiv_id": "2203.15369", "language": "en", "url": "https://arxiv.org/abs/2203.15369"}}, "book": {"meta": {"short_book_title": "Mystery and Confidence Vol. 2 by Elizabeth Pinchard", "publication_date": 1814, "url": "http://www.gutenberg.org/ebooks/34968"}, "text": "\n\n\n\nProduced by Mark C. Orton and the Online Distributed\nProofreading Team at http://www.pgdp.net (This file was\nproduced from images generously made available by The\nInternet Archive)\n\n\n\n\n\n\n\n\n\n                                MYSTERY\n                                  AND\n                              CONFIDENCE:\n\n\n                               _A TALE._\n\n                               BY A LADY.\n\n                           IN THREE VOLUMES.\n\n\n                                VOL. II.\n\n\n\n                                LONDON:\n                       PRINTED FOR HENRY COLBURN,\n            PUBLIC LIBRARY, CONDUIT-STREET, HANOVER-SQUARE,\n                 AND SOLD BY GEORGE GOLDIE, EDINBURGH,\n                       AND JOHN CUMMING, DUBLIN.\n\n                                 1814.\n\n\n\n                B. CLARKE, Printer, Well-Street, London.\n\n\n\n\n                                MYSTERY\n                                  AND\n                              CONFIDENCE.\n\n\n\n\nCHAP. I.\n\n  ----To mourn because a sparrow dies,\n  To rave in artificial ecstasies,\n  Laments how oft her wounded heart has bled,\n  And boasts of many a tear she never shed.\n\n                                MISS MORE'S POEM ON SENSIBILITY.\n\n\nThe next day being Sunday, Lady St. Aubyn, attired in the most elegant\nundress, and attended by the Earl, made her appearance at the church:\nthe expensive lace veil which shaded her fair face, and hung loosely\nbelow her waist, prevented the gazing of those around her from being\ntoo oppressive. The neighbouring families certainly had heard that Lord\nSt. Aubyn had married a young person of a rank in life much inferior to\nhis own, for secretly as every thing had been conducted, as no one could\ntell the name or family of his bride, such, at least, were the\nconjectures of those who knew him; yet, in spite of the prejudices which\nhad been excited against her, the elegance of her form, and the modest\ncomposure of her demeanour, in a great measure overcame it, and all who\nwere entitled, by their situation in life, to visit at the Castle,\ndetermined to do so; some prompted by mere curiosity, and some by less\nunworthy motives. The three or four following days, therefore, brought\nEllen many visitors, and her own intuitive sense of propriety, added to\nthe few general directions St. Aubyn had given her, and with the\nadvantageous support his respectful attention gave her, prevented her\nappearing at all awkward; and these visits, which she had so greatly\ndreaded, passed over with less pain than she had expected.\n\nAmongst their first visitors were Sir William and Miss Cecil; the former\nof whom was a mere common-place character, whom, if you did not happen\nto see for sometime, you would be apt to forget you had ever seen at\nall; but the fine countenance of Laura, her expressive features, and the\nbright black eyes which animated them, charmed Ellen, who had never seen\nany woman before so pleasing: yet Laura was not strictly beautiful, and\nat this time the lustre of her fine eyes was dimmed by the melancholy\nwhich pervaded her mind, for she said her little invalid was so much\nindisposed, and so weak, she would not have left her to go any where\nelse; but she wished so very much to be introduced to Lady St. Aubyn she\ncould not resist the temptation.\n\nThe very elegant manner in which she spoke, the clearness of her\narticulation, and sweetness of her voice, were strikingly agreeable; and\nSt. Aubyn afterwards said that a few years before she had a gaiety of\nmanner, enlivened by wit of a superior nature, with so much playfulness\nof expression, that by many people she was considered as merely a lively\ngirl, and a little satirical; but time and misfortune had softened what\nat times might have been too severe in her opinions, had improved and\nmellowed her fine judgment, and given a pensive sweetness to her\nmanners, which was occasionally relieved by flashes of her former gaiety\nand ready repartee. St. Aubyn shewed her a particular and most\nrespectful attention, and told Ellen she would be charmed with Miss\nCecil's drawings, which were the very finest he ever saw, except from\nthe hands of a professed artist. He then, with a smile, addressed a few\nwords to Laura in an undertone, to which she replied: \"Oh, pray, my\nLord, do not expose my juvenile follies: I might have done such things\nwhen we were mere children together, but I hope you think me wiser now!\"\n\n\"The world,\" said he, \"has perhaps made us both graver since the days\nyou speak of; and that, in the eyes of many, will doubtless give us\ncredit for an increase of wisdom; but believe me, my fair friend, I have\nlost so little of the romance of youth (if such you choose to term it),\nthat I must hope you do not neglect the pleasing talent to which I\nalluded, and of which you must allow Lady St. Aubyn to judge: I assure\nyou she has a great taste for poetry, and perhaps one day or other may\nfollow your example, and court the Muses in her turn.\"\n\n\"Ah, my Lord!\" said Laura, smiling and colouring: \"I see you are\ndetermined not to keep my secret.\" \"Tell me, Ellen,\" said St. Aubyn,\n\"can you see any reason why Miss Cecil should wish to make a secret of\nher having succeeded very happily in some elegant little poetical\ncompositions?\" \"No, indeed,\" replied Ellen: \"it surely is a gift to be\nrather proud than ashamed of.\" \"Ah, my dear Lady St. Aubyn, if you could\nconceive the illiberal prejudice of some minds, you would not wonder at\nmy dislike to having these trifling attempts spoken of. A lady I knew,\nwho was eminently gifted in that way, and indeed an excellent\nprose-writer also, was, from circumstances, obliged to be less\nscrupulous than I have been; and if you could have heard the things I\nhave witnessed, when she entered or left a room, you would be amazed:\nwhile she, gentle, unassuming, and even timid, judging candidly of every\none, unwilling to see faults, and detesting personal satire, had not the\nmost remote idea of the severe and uncandid remarks she excited.\"\n\nEllen was really astonished at this account, as much as she was pleased\nwith the spirit and grace with which it was delivered; and St. Aubyn\nsaid to her with an expressive smile, \"You see, Ellen, our friend Ross\nhad more reason than we were willing to allow him for _certain\nprohibitions_. However,\" added he, \"I will not relinquish the hope that\nMiss Cecil will soon see how little she has to fear from any\nobservations of such a nature from _you_.\" \"I see it already,\" said Miss\nCecil with quickness: \"one glance at Lady St. Aubyn would convince the\nmost incredulous that nothing but sweetness and candour can lodge in\nsuch a temple.\"\n\nShe then looked at her watch, and saying she had much exceeded her time,\nand Juliet would expect her, departed with her father, who had been\ndeeply engaged in giving Doctor Montague a long account of a\ncounty-meeting, which had been held for some public purpose a few days\nbefore. They had scarcely driven from the door, when Miss Alton was\nannounced; and as she entered, St. Aubyn whispered to Ellen--\"Now you\nwill see a character quite new to you.\" Then rising hastily, he crossed\nthe room to meet the lady, exclaiming, \"Heavens! my dear Miss Alton, how\nenchanted I am to see you look so well! You really improve every day, at\nleast every year: for I believe it is at least that time since I saw you\nlast.\" \"Oh, my Lord,\" answered the lady in an affected tone, but in a\nvoice the natural sharpness of which all her efforts failed to soften;\n\"you flatter--don't try to make me vain. Lord bless me, you men have no\nmercy on us poor young women: but will you not introduce me to your\nLady?\"\n\nEllen, who at the distance from whence she had first seen this visitor\nimagined that she really was young and handsome, was astonished as she\napproached, to find in the white frock, sash, ringlets, and little\nstraw hat of a girl, a woman apparently between fifty and sixty; and who\nvainly attempted to conceal, by a quantity of _rouge_ and a slight veil\nthrown over her face, the ravages which time had made in her\ncountenance. Her spare figure gave her some resemblance to youthful\nslightness; but when near, the sharp bones, and angular projections of\nher face and person, sufficiently proved, that slender appearance was\nthe result of lean old age, instead of girlish delicacy. In spite of the\nadvanced season, she was clad so lightly, that she still shivered from\nthe impression of the keen breeze which had assailed her as she crossed\nthe Park, and gladly accepted a seat by the comfortable fire, though\naffecting to conceal her sufferings under an air of gaiety and ease.\n\nSt. Aubyn (who had known her many years, and had been from a boy\naccustomed to divert himself with her foibles, though he really felt a\ndegree of regard for her, as, in spite of her oddities, she was not\nwithout a mixture of good qualities), after having introduced her to his\nbride, seated himself by her, and began to talk to her in a strain of\nsuch marked flattery, as really alarmed Ellen, who thought Miss Alton\nwould certainly be offended; but her enormous vanity prevented her from\nperceiving that he was merely laughing at her, and she grew every moment\nmore ridiculous. At last, turning to Ellen, she said in a pathetic tone,\n\"Oh, my dear Madam, you cannot conceive how I have felt for you these\ntwo days! I declare I have not been able to sleep for thinking of you,\nand really have shed tears to imagine what a tax you have been paying:\nhow you must have been fatigued by receiving such a succession of\nvisitors! but every one must have some trouble. There is my dear friend,\nMrs. Dawkins, the best of women--sweet woman, indeed--there she is\nlamenting at home such a vexation!\" \"What is the matter?\" said St.\nAubyn, laughing, for he knew what sort of misfortunes Mrs. Dawkins and\nher friend Miss Alton generally lamented with so much pathos: \"has she\nlost her little French dog, or has the careless coachman scratched the\npannels of her new carriage?\" \"Oh, you sad man! how can you make a jest\nof the dear soul's uncommon sensibility? To be sure she has the\ntenderest feelings. She often says to me, 'my dear Alton, what should I\ndo without you: you are the only person who can really feel for the\nmisfortunes of a friend.' Sweet woman!\"\n\n\"Well, but,\" said St. Aubyn, \"you were going to tell us what has\nhappened to this _amiable friend_ of your's.\"\n\n\"Nay, I will tell Lady St. Aubyn, she looks all softness and\nsensibility: but you are so wicked, you make a jest of every thing. Do\nyou know, my dearest Lady St. Aubyn, just as poor Mrs. Dawkins was\ncoming to make you a visit, this morning, nay, she was actually dressed,\nand had one foot on the step of the carriage, _I_ was in it, for she was\nso kind as to say she would bring me; so I thought, as I was to come\nwith her, I need not put on a pelisse, or shawl, for you know they spoil\none's dress. But I can't say but that it was rather cold walking, as I\nwas at last obliged to do, for _just_ as she put her foot upon the\nstep----\" \"What happened?\" interrupted St. Aubyn, laughing still more at\nthe emphatic manner in which poor Alton told her distressing\nstory.--\"Did she fall down and break her leg, or did the horses run away\nand carry off her kid slipper?\"----\"Now only hear him; did you ever see\nsuch a teasing creature: well, I am glad _I_ have not the task of\nkeeping you in order; I don't know what even the sweet Countess will do\nwith you.\"\n\nThis piece of self-congratulation threw St. Aubyn into a violent fit of\nlaughing, in which even the grave Doctor Montague joined, and Ellen\ncould hardly resist, though the fear of quite affronting her guest put a\ncheck upon her risibility.\n\n\"Well,\" said St. Aubyn, at last recovering himself a little, \"but what\nreally did happen to poor Mrs. Dawkins?\"\n\n\"Nay, I protest I won't tell you, you wicked creature; I will tell Lady\nSt. Aubyn some other time, for you do not deserve to hear any thing\nabout it.\"\n\n\"Oh, yes, do, my dear Alton, tell, for really I am in great pain for\npoor Mrs. Dawkins, who has been standing so long with one foot upon the\nstep: don't leave her in so dangerous a situation any longer.\"----\"Well,\nthen, if I must tell--at that moment up came a servant on horseback, to\nsay her sister, Mrs. Courtenay, was on the road to her own house, in her\nway from Buxton, and would, with a whole train of children and servants,\ndine at her house to-day; and as they were coming directly, she was\nactually obliged to defer her visit to your Ladyship till to-morrow; and\nshe was so sorry, and I am sure so was I, for I was obliged to walk here\nafter all.\"\n\n\"Well, but,\" said Lord St. Aubyn, \"notwithstanding this terrible shock\nto her feelings, she might have sent the carriage with _you_.\"----\"Aye,\nso she might, to be sure; but poor dear soul, she was put in such a\nbustle she never thought of it; some people don't think----dear me, if I\nhad a carriage of my own, I should be happy to make it useful to my\nfriends, and not let them go broiling on foot two or three miles in warm\nweather or splashing through the mud in the middle of winter.\"----\"I\nbelieve you,\" said St. Aubyn; for with all her foibles, he knew Miss\nAlton was really good-natured, and willing to do a kind action.\n\n\"Well, my dear Miss Alton, if you will favour us with your company, and\ndine with us, Lady St. Aubyn will, I am sure, be happy to send you home\nin her carriage; and I promise you, if the Prince himself was to make us\na visit, that should not prevent your having it.\"\n\nEllen joined in this invitation, to which the happy Miss Alton readily\nassented; and Ellen found her, after a little while, a more tolerable\ncompanion than she expected.\n\nMiss Alton's particular passion was for being with people who lived in\nstyle; if they had a title so much the better; and as she would do any\nthing to make herself useful, and knew how to pay those little\nattentions which every body likes, she generally made herself agreeable,\nor so necessary, that she had admittance at almost all the houses of\nconsequence in the neighbourhood. The entre of St. Aubyn Castle was the\nheight of her ambition. St. Aubyn's mother, who lived much in the\ncountry, had been in the habit of receiving Miss Alton, when she was a\ngirl, on familiar terms: the old Lady was fond of needle-work, and\nAlton assisted in filling up the groundwork of carpets, rugs, &c. with\nthe most patient good humour; or was at any time ready to make up a\nwhist or quadrille table; so that in those days she was very often a\nweek or two together at the Castle, where St. Aubyn, at his vacations,\nhad been accustomed to meet her, and to divert himself with her foibles,\nthough he had always retained a degree of regard for her, a felicity\nwhich the death of the old Countess deprived her of, and she had never\nsince ceased to regret; for though her other connections were\nrespectable, they were not so high in fortune or consequence as the St.\nAubyns, and great was her joy to find herself once more an invited guest\nat the Castle.\n\nAmongst her other friends, as her narrow income by no means permitted\nher to return their civilities in kind, she yet was always well\nreceived, for there was nothing she would not do to oblige: one Lady\nwould send her in her carriage, if not well enough to go herself, to\ninquire the character of a servant; another would express a wish, in her\nhearing, for some game, or fruit, for a dinner party, and Miss Alton\nwould set out the next morning \"to try her luck,\" as she termed it, by\ncalling at some of the higher sort of houses, where she was acquainted,\nand _wishing_ she knew where to get a hare, or a pine-apple (according\nto which was wanted), \"to oblige a friend to whom she owed a great many\nfavours,\" the good natured hearer generally, if possible, was willing to\noblige \"poor Alton;\" or if she did not succeed there, she would tramp a\nmile or two farther, and at worst could fairly boast what pains she had\ntaken, even if they were not successful.\n\nIn London, if a notable friend wanted a cheap trimming, or to match a\nsilk or lace, yet did not like to go about to little shops herself,\nAlton would take a hackney coach, or walk if the weather permitted, and\nnever rest till she had obtained the thing in question.\n\nBy these and similar means she had made a great many high acquaintance,\nand _eked_ out a small income by visits, sometimes a little too long, to\neach in turn.----She had thus acquired some amusing anecdotes, and was\nfar from an unpleasing companion, especially when no male beings came in\nher way; but when with men, vanity and affectation took such full\npossession of her, that she became completely ridiculous. This Lady St.\nAubyn had an opportunity of seeing: when two or three gentlemen happened\nto call before dinner, her whole manner changed, and she became really\nabsurd: her voice was softened----her head leant on one shoulder----a\ntolerably white hand and arm displayed in every possible attitude, and\nshe behaved, in every respect, like a very silly affected girl; but when\nthey were gone, she was again tolerably conversable, and St. Aubyn,\nceasing to play upon her foibles, and turning the conversation to such\ntopics as were most likely to shew her to advantage, the afternoon and\nevening passed pleasantly enough. Nor was St. Aubyn sorry to familiarise\nEllen, by degrees, to company, or to do the honour of his table, before\nthey should be obliged to receive the neighbouring families at dinner,\nmany of whom he knew (especially two or three ladies who had unmarried\ndaughters) would be eagerly looking out for any little omission in her,\nwhile Miss Alton was so delighted with the good things before her\n(certainly being _un peu gourmande_) with the beautiful new service of\nchina, rich plate, &c. &c. that she never thought of her entertainers,\nexcept to express her pleasure in their kindness and attention: and they\nsent her home in the evening perfectly happy, and eager to tell dear\nMrs. Dawkins what a delightful day she had spent, how happy the Earl\nwas to see her, what a _sweet woman_ the Countess was, what fine china!\nwhat a dessert! what an elegant new carriage! &c. &c.\n\n\n\n\nCHAP. II.\n\n  Yet once again farewell, thou minstrel harp,\n    Yet once again forgive my feeble sway,\n  And little reck I of the censure sharp,\n    May idly cavil at an idle lay.\n  Much have I owed thy strains on life's long way,\n    Through secret woes the world has never known,\n  When on the weary night dawn'd wearier day,\n    And bitterer was the grief devour'd alone.\n\n                                                       W. SCOTT.\n\n\nThe next month was past in receiving and returning visits; and the most\npleasing among them was a sociable day passed at Rose-Hill, the seat of\nSir William Cecil. Miss Cecil promised, if Juliet, who now for some time\nhad been tolerably well, should continue so, that Ellen should see her;\nthough she very seldom admitted any company: \"But I have said so much of\nyou,\" said Laura, \"that she is quite anxious to see you; and I am\nparticularly anxious to familiarize her to you, both as it will I am\nsure give her pleasure, and facilitate our being often together.\"\nAccordingly, after dinner, when they left the gentlemen, Miss Cecil led\nLady St. Aubyn to Juliet's apartment.\n\nNever had Ellen seen so interesting a being: this fair creature, now\nabout fifteen, was a perfect model of beauty and symmetry; though so\nslightly formed, she appeared, \"like a fairy vision, or some bright\ncreature of the element:\" her cheeks were faintly tinged with a hectic\nblush; her eyes were of the most dazzling brightness; her lips like\ncoral; and her teeth of pearly whiteness; her fair hair was covered with\na fine lace cap, and her fragile form enveloped in a large shawl.\n\n\"My love,\" said Laura, \"here is Lady St. Aubyn, who is so good as to\ncome and see you.\"\n\nJuliet extended her white hand, and said in a voice of peculiar\nharmony, fixing at the same time her sparkling and penetrating eyes on\nEllen's face, as if she wished to read her heart in her countenance,\n\"Laura says she loves you already, and I am sure _I_ shall.\" The simple\nnaivete of her voice and manner went to the heart of Ellen, who could\nnot help embracing her tenderly, while she felt the tears start to her\neyes at seeing one so young and lovely in a state of health so\nprecarious.\n\nAfter a little more conversation, Ellen put her hand accidentally on a\nsmall book which lay half concealed by one of the pillows of Juliet's\ncouch, and said with that native politeness which ever prevented her\nfrom doing any thing rude or intrusive, \"May I look at the subject of\nyour studies?\" \"Yes,\" said Juliet, with an angelic smile, \"If you\nplease.\" Ellen opened the book. It was in a character totally unknown to\nher. \"Do you read Greek?\" asked the fair Juliet, with a simplicity and\nabsence of design which proved her question was serious; and this\ninterrogation, which would from most people to a young woman be\nabsolutely ridiculous, from Juliet appeared merely a natural wish to\nknow whether her new friend was as able as herself to read the book she\nheld in her hand; for strange as it may appear, it was a copy of the New\nTestament in Greek; and Juliet read it as easily as if it had been\nEnglish.\n\n\"My dear Juliet,\" said Laura, \"few females make that language their\nstudy; I conclude, therefore, Lady St. Aubyn does not know it any more\nthan myself.\" \"Oh, I wish you both did,\" said Juliet: \"if you could but\nknow the delight I feel from reading the Scripture in its original\nlanguage!--If I live till next summer I hope the Hebrew Bible will be as\nfamiliar to me as that book is now.\"\n\nIt is impossible for language to do justice to the perfect innocence and\nartlessness with which she spoke: she seemed to think her own wonderful\nattainments no more extraordinary than other girls do of being able to\nread a newspaper, or work a handkerchief: not a trace of affectation or\npedantry was visible in her manner: she had a childishness of voice and\ntone that singularly contrasted with the subjects on which she spoke;\nfor Laura, willing to let Ellen see what a wonderful creature she was,\nled her to speak of astronomy; and a celestial globe happening to be on\na table before her, led her by degrees to display her extraordinary\nknowledge in that science--of the dimensions and motions of the heavenly\nbodies, their distances from the sun and from each other, &c. all of\nwhich she explained in the clearest and most perspicuous manner, making\nsuch happy allusions to the poets who have touched on the subject, and\nillustrating it by such apt comparisons, as shewed her imagination was\nas brilliant, as the calculations she readily made proved her memory\nwas accurate.\n\nLady St. Aubyn, who had at every leisure hour since her marriage been\nengaged in studying this and other interesting subjects of useful\nknowledge, could in some degree appreciate the value and extent of this\nsweet girl's extraordinary acquirements, and was lost in admiration of\nher abilities, and the industry with which, notwithstanding her ill\nhealth, she had cultivated them.\n\nThis happened to be a day in which Juliet was unusually well, for in\ngeneral she declined all conversation, and spent most of her time in\nstudying the Scriptures, in devotional exercises, and promoting every\nplan which her health would permit her to join in for the relief of the\npoor; for her early piety and extensive charity were as remarkable as\nher other attainments were wonderful: but this day she was so well, that\nat Laura's solicitation, in which Ellen earnestly joined, she placed\nherself at a chamber organ that stood in her apartment, which she\ntouched with great taste and science; and was at last prevailed on to\naccompany it with a voice of the most angelic sweetness.\n\nShe sung only sacred music, and now delighted Ellen with \"Angels ever\nbright and fair;\" and, \"I know that my Redeemer liveth:\" and while her\npure lips poured forth these exquisite specimens of musical inspiration,\nthe soft and pious expression of her heavenly countenance, for ever\nfixed and hallowed them in the remembrance of her hearers.\n\nTo Ellen she seemed hardly a being of this world, and her young and\nenthusiastic heart was melted with the tenderest love for one so very\nfar superior to any thing she could have imagined.\n\nFrom this day the St. Aubyns and Cecils spent a great part of their time\ntogether, and the highly polished manners of Miss Cecil, her excellent\njudgment, and fine taste, were extremely advantageous to Lady St.\nAubyn. Without losing her natural grace and sweet simplicity, she\ngradually acquired more of that style which marks both the woman of\nfashion and the possessor of intellectual knowledge; even her beauty\nimproved with the encreased intelligence of her mind, and the serenity\nof her heart; for now for the first time she felt entirely happy;\nscarcely a cloud overshadowed her.\n\nSt. Aubyn was every day more tender and attentive, and every day\nexpressed himself more pleased and delighted with his choice. Those\nstarts of agitation and gloom which on their first acquaintance had\nappeared in him so frequently, were now very seldom seen. He received\nfrequent letters from Spain, which he told Ellen were from his friend\nthe Marquis of Northington, who was there in a diplomatic situation, and\nwas engaged in seeking a person, by means of his extensive connections\non the Continent, who alone could unravel some mysterious circumstances\nof the most material consequence to _him_. \"But when found,\" said St.\nAubyn, one day when he had by degrees been led to speak on this\nsubject--\"when found, if ever that should happen, I know not that he\nwill be prevailed on to disclose what I have every reason to believe he\nalone can tell. He is a villain!\"----(and St. Aubyn's frame shook with\nthe agitation of smothered rage) \"and may from motives of fear or\nrevenge add to the other injuries he has done me, by withholding that\ninformation which alone can secure _my fame_, perhaps _my life_.\"\n\nHe had never before spoken so much or so calmly on this interesting\nsubject; and seeing that Ellen listened with great anxiety, and that at\nhis last words she trembled and turned pale, he added:\n\n\"Fear not, my love: for your dear sake I will take every necessary\nprecaution; and should I find the enemy, who has long, though most\nunjustly, threatened to revenge on me an act, horrible indeed, but of\nwhich I was not the author----should I find him still determined on\nvindictive measures, I will for a time pass over to the Continent, till\nsome accommodation can be effected. At all events, my Ellen, remember\nyou have promised to _believe me innocent_. In the course of the next\nsummer, this enemy (who, alas! and that is not the least hardship in my\nwayward fate, ought by every tie to look upon me as a friend and father)\nwill be in England, and I shall perhaps be able to clear his mind from\nthose evil impressions with which an unfortunate chain of circumstances\nhave stampt it----impressions received in early youth, and which he has\never since cherished, and brooded over with the most determined\nresentment.\"\n\nAt this juncture, when St. Aubyn seemed for the first time inclined to\nopen his whole heart to his wife, and to disclose to her a story in\nwhich she was so deeply interested, they were interrupted by a servant,\nwho announced Mrs. Dawkins, and her tender friend Miss Alton, who came\narmed with a whole catalogue of sympathetic feelings and notes of\nadmiration of all kinds to entertain Lady St. Aubyn.\n\nMany were the disasters which had happened since they saw her last:\nhorses had been lame, servants impertinent, showers of rain had fallen\nat the most unlucky moments, even a dinner had been spoilt which had\ncost a whole week's preparation, by the cook's inattention in\nover-roasting the venison; in short, all the minor evils of life had set\nthemselves in array against the peace of poor Mrs. Dawkins: and even the\nsympathizing Miss Alton could hardly keep pace with lamentations\nsufficient for such a doleful list of distresses. She fought her way,\nhowever, as well as she could, and where words failed her, shrugs,\nsighs, and the whole artillery of gesticulation, were employed in their\nstead.\n\nWhat then became of poor Ellen, who could at best only sit \"with sad\ncivility and an aching head,\" amid this alternate din of complaint and\ncompassion? But Mrs. Dawkins was pre-determined to like and be pleased\nwith every thing the lovely Countess did or omitted to do, and construed\nthe silence and acquiescence with which she heard every thing into the\nkindest attention and most obliging concern for the troubles of her\nfriends.\n\nThe entrance of a sandwich tray fortunately gave some pause to this\nmelancholy duet; and the excellent hot-house fruits, rich cake, &c.\nseemed to arrive in good time to refresh both ladies after so much\nexertion. At last they took their leave, but the moment for confidence\nwas past; indeed, St. Aubyn, in no humour for trifling, had made his\nescape at one door, as they entered at the other: of course, the\nconversation was not then resumed.\n\nNot to interrupt the course of the narrative, we omitted in the proper\nplace to notice that Lord and Lady St. Aubyn had, immediately on their\narrival at the Castle, written letters of explanation to Powis and\nJoanna, and he permitted Mr. Ross to publish what he alone knew the real\nrank and title of the person Ellen had married.\n\nWe will not pretend to describe the astonishment excited by this\nintelligence amongst the inhabitants of Llanwyllan: the honest and\nunaspiring Powis declared he would much rather Ellen had married a man\nnearer her own rank in life, for he was afraid, poor dear child, she\nwould be bewildered amongst such fine people, and in such a great house:\nfor his part, even if he were able to travel so far, he should not like\nto go to such a grand place as she described the Castle to be; besides,\nhe was afraid they would be ashamed to see such a rough, ignorant fellow\nas he was among their fine company: and if Ellen was above calling him\nfather, he should wish himself in the grave.\n\nThe tears started in his eyes at the painful idea, and the good Ross\ncould hardly dissipate his apprehensions of being forsaken by his only\nchild, by reminding him of her excellent qualities and tender affection\nfor him, and of the kindness with which Lord St. Aubyn had treated him\nthrough the whole of his acquaintance.\n\nMrs. Ross was in ten times a greater bustle than ever; she could not\nrest till she had told the surprizing news to every one she met, and at\nintervals she scolded Mr. Ross heartily for not letting her into the\nsecret, as if she were not as worthy to be trusted as any body else for\nsecrecy and prudence; \"she that had been a mother to Ellen, was no\ngossip, and minded nothing but her own business!\" but when he reminded\nher that even Ellen, deeply as she was interested, was not permitted to\nknow it, she could not but acknowledge she had no great right to expect\nto be better informed.\n\nAs to Joanna, with the natural vanity of youth, she was elated beyond\nmeasure at the idea of her dear Ellen's being a _real lady_, and the\nhope of visiting her one day or other in her fine castle, and seeing all\nher beautiful things, while Mrs. Ross made no doubt Ellen had a dress\nfor every day in the week, and her caps trimmed with fine lace; then she\nlaughed at the recollection of having once \"scolded Ellen for putting on\nher best white gown when she expected Mr. Mordaunt, as we called him,\nand now I should not wonder if she wears as good in a morning!\"--\"Dear\nmother,\" said Joanna, who, from the slight view she had of what she\nfancied the world, when she went with St. Aubyn and Ellen to Carnarvon,\nimagined herself better instructed in fashionable matters--\"dear mother,\nI daresay she does not wear such gowns at all; I should not wonder if\nher maid had as good: I am sure I saw a lady's maid on a travelling\ncarriage at Carnarvon much better dressed than either of us.\" \"Well,\nbless me, what will the world come to,\" said Mrs. Ross, \"when such folks\nas those wear white gowns and flappits!\" Alas, poor Mrs. Ross! could she\nhave seen some ladies' maids!--\n\nAll these things Joanna told Ellen in a letter the longest she had ever\nwritten, and greatly was St. Aubyn diverted with the simplicity of their\nideas. The good Ross wrote to St. Aubyn, and expressed his high\nsatisfaction at the very just and honourable manner in which he had\nperformed all his engagements respecting Ellen, and requested to hear\nfrom time to time whatever might arise concerning those important\ncircumstances which the Earl had done him the honour to confide to him.\n\n\"What can we do for these very good people, my dear Ellen?\" said St.\nAubyn: \"they have no wants nor wishes beyond their present possessions.\nIf I send them any articles of luxury, or the means of encreasing their\npresent expenses, I know not that I should render them happier. I could\neasily procure a valuable living for Mr. Ross, and told him so; but he\nassured me nothing should induce him to leave his present flock, and\nthat he had not a wish to rise to a higher sphere, or for any thing in\nthe world, but a few more books; and for those I have sent an order to\nmy bookseller, requesting they may be immediately forwarded to\nCarnarvon. I shall also enclose to Ross a larger payment for my good old\nlandlady and cook, dame Grey, than I thought it prudent to make while we\nremained at Llanwyllan. Is there any thing else my Ellen can think\nof?\"--\"There are,\" answered Ellen, in a low voice, \"some very poor\npeople at Llanwyllan, that Joanna and I used to be as kind to as we\ncould. I should like, if you approve of it, to send Joanna a little\nmoney for their use.\" \"By all means, send whatever you think proper, and\nas often as you please; never consult me, but do all that your kind and\ngenerous heart prompts you to do on all occasions--think also if there\nis any thing Mrs. Ross and Joanna would be pleased to have. You must be\na better judge of their wishes than I can be.\"--He then took out his\npocketbook, and gave her notes to a large amount, telling her, with a\nsmile, that her expences were so small, he should forget he had a wife\nif she were not a little more profuse. \"Well, but Ellen,\" said St.\nAubyn, \"surely this is not all you have to ask for the friends of your\nyouth! don't make me fancy either that you are forgetful, or _think more\nthan you choose to express for some of them_.\" \"My dear Lord, what do\nyou mean?\" said Ellen, a little startled by the manner in which he\nspoke, \"Nay, don't be alarmed,\" replied St. Aubyn, with a smile, \"_I_\nwas thinking of one certainly not so much in _my_ favour as he ought to\nbe in _your's_, for he deprived me once of your society for a whole day,\nfor which, and some certain pangs and anxieties, I cannot quite forgive\nhim.\" \"I cannot guess who you mean.\" \"Is that really true?\" \"Most\nperfectly so.\" \"Certainly,\" said St. Aubyn, \"I can only mean Charles\nRoss.\" \"Oh poor Charles!\" exclaimed Ellen: \"I really had quite forgotten\nhim.\"\n\n\"Now that was excessively ungrateful,\" said St. Aubyn, laughing, \"for I\ndare engage he has not forgotten you: well, are you still enough his\nfriend to wish to do him service?\"\n\n\"Certainly,\" said Ellen: \"I shall always feel a regard for him, though\njust at that moment I was not thinking of him: but what service can I\ndo him, my Lord?\"\n\n\"If _you_ give him your interest with me, I may, perhaps, try, and most\nlikely shall succeed, in getting him promotion. Should you wish this to\nbe done?\"\n\n\"Oh, yes, indeed,\" replied Ellen, animated and sparkling with the\npleasing idea of serving her early friend, and of the joy his promotion\nwould give his parents and sister, \"nothing could give me more\npleasure.\"\n\n\"Not too much of that bright colour and sparkling eye, though, Ellen,\"\nsaid St. Aubyn, half in jest, half gravely: \"I shall be jealous.\"\n\n\"You have so much reason!\"\n\n\"Well, be cautious, I am in that point a Turk, and bear no rival _near_\nthe throne.\"\n\nEllen, half vexed, would have said something, but embracing her\ntenderly, he stopt her by saying, \"Not a word, my love, I am perfectly\nsatisfied,\" and left her a little disconcerted, and half fearing that\nshe had disturbed or displeased him.\n\nIn the familiar intercourse which now took place between Miss Cecil and\nLady St. Aubyn, the former shook off her reserve, and imparted to Ellen,\nnot indeed all the particulars of her early disappointment, but that she\nhad endured the most painful trials that the perfidy and inconsistent\nconduct of one sincerely loved could inflict; yet dignified on this, as\non every other subject, she never expatiated upon it, or said any thing\ndisrespectful of the author of her sufferings: though she never fully\nexplained the cause of her separation from her unworthy lover, it was\nunderstood, that a full conviction of his bad conduct, and that his\naddress to her had chiefly been induced by mercenary motives, had\ninduced her to discard him, and to resist all his subsequent entreaties\nto be forgiven.\n\nOne day, when Lord St. Aubyn and Sir William Cecil were engaged at a\ngreat public dinner in the neighbourhood, Ellen had the pleasure of\ndining tete-a-tete with her agreeable friend: they had spent two hours\nin Juliet's apartment, who every time they met gained more and more on\nEllen's affections, and was become excessively attached to her, when the\nsweet girl, feeling fatigued, said she would lie down for an hour, and\nthen she should be well enough to enjoy their company at tea, which she\nrequested they would take in her apartment; they went therefore to pass\nthis hour in Miss Cecil's dressing-room, who, opening a writing-desk to\nshew Ellen a drawing she had just finished, undesignedly displayed to\nthe quick eye of Lady St. Aubyn a little book, marked \"Manuscript\nPoetry.\"\n\n\"Your own,\" said Ellen, laying her hand on it playfully, \"or extracts?\"\n\"Why,\" returned Laura, \"as Lord St. Aubyn thought proper to betray a\nsecret which he learnt when we were children together, I will not deny\nthat little volume contains some insignificant attempts of my own.\"\n\n\"Oh let me see some of them, pray do,\" said Ellen: \"assure yourself I\nwill make no ill use of your confidence. I really am quite delighted\nwith this opportunity, for I have long wished to see some specimens of\nyour talents in this way.\" Thus urged, Laura allowed her to read two or\nthree of the little poems contained in the volume, and at her earnest\nrequest, permitted her afterwards to have copies of the two following\n\n\n  ELEGIAC STANZAS.\n\n  Athwart the troubled bosom of the night,\n    Low heavy clouds in awful grandeur sweep;\n  And, in the solemn darkness of their flight,\n    Serve but to wrap the world in calmer sleep;\n  Save those sad eyes, which only wake to weep;\n  And give the dreary hour to meditation deep.\n\n  Those eyes perceive, as slow the clouds divide,\n    One star, whose tremulous but brilliant ray\n  Might serve the uncertain wand'rer's steps to guide,\n    And cheer his bosom till the dawn of day;\n  Who trembling else, and lost in black dismay,\n  Wearied and wild, might rove and perish on the way.\n\n  Even such a star, so fair and so benign,\n    When o'er the soul dark clouds of sorrow lour,\n  Is Hope; whose tranquil rays serenely shine,\n    Brightening the horrors of each dreary hour;\n  Smiling when youth prepares the fancied flower,\n  And when in age it feels misfortune's blighting power.\n\n  Oh, thou bright star! still grateful shalt thou find\n    The heart so often cheer'd by thy mild ray:\n  I will not call thee faithless and unkind,\n    Nor with ingratitude thy smiles repay,\n  Because thou hast not, like the glorious day,\n  Power to dispel the dark, and drive the clouds away.\n\n  Gild but those clouds till brighter suns arise;\n    Checkering with thy fair light life's troubled stream;\n  And oft unwearied shall these wakeful eyes,\n    Watching the progress of thy doubtful beam,\n  Shine even in tears; and, closing, still shall seem\n  Sooth'd by thy gentle ray in every peaceful dream.\n\n\n  EPISTLE TO LADY DELAMORE,\n\n  ON RETURNING TO ROSE-HILL.\n\n    From those rain scenes, where fancied pleasure reigns;\n  From crowds that weary, and from mirth which pains;\n  From flattering praises, from the smiles of art,\n  Sweet to the eye but faithless to the heart;\n  From guilt which makes fair innocence its prey,\n  Sighs but to blast, and courts but to betray;\n  From these I fly, impatient to caress\n  All lovely Nature in her fairest dress.\n  Oh, sweet retirement! Oh! secure retreat\n  From all the cares and follies of the great!\n  Here lavish Nature every charm bestows,\n  In softness smiles, in vivid beauty glows!\n  Here May presents each blossom of the spring,\n  And balmy sweetness falls from Zephyr's wing.\n    Yet while I stray, in tranquil quiet blest,\n  Fond mem'ry presses at my anxious breast;\n  And as I rove 'mid scenes so justly dear,\n  Remembrance wakes the tributary fear!\n  The mental eye perceives a sister's form,\n  And even these peaceful shades no longer charm.\n  \"Yes!\" I exclaim, \"'twas here she lov'd to stray,\n  Smiling in beauty, innocently gay!\n  Oft by yon streamlet, in the echoing vale,\n  Her voice would swell upon the evening gale,\n  Charm from the care-fraught bosom half its woes,\n  And hush the wounded spirit to repose!\"\n    While these delightful hours I thus retrace,\n  And dwell on every recollected grace,\n  Thy sister's soul, my Agatha, forgets\n  That _thou_ art blest in that which _she_ regrets;\n  Forgets that pleasure crowns thy happy hours,\n  And fond affection strews thy path with flowers;\n  Anxious thy way with rose-buds to adorn,\n  And from those buds remove each lurking thorn.\n  Ah! selfish heart, lament thy loss no more,\n  Nor thus thy recollected bliss deplore;\n  Content thyself to know thy sister blest,\n  And calm the plaintive anguish of thy breast!\n  Be still serenity thy future state;\n  Far from the pomps and perils of the great;\n  Unnotic'd, quiet, shall thy peace ensure,\n  Peace, when the world forgets thee, most secure.\n  --Yet, yet, my Agatha, affection swells\n  The trembling heart where thy lov'd image dwells;\n  Still bids me look to thee for all that cheers\n  In lengthen'd life, and blesses ling'ring years:\n  My spirit, form'd a _social_ bliss to prove,\n  Dares but to hope it from thy future love.\n  Deceived by him on whom it most relied,\n  Pierced in its fondness, wounded in its pride--\n  Yet, yet, while throbbing through each shatter'd nerve,\n  Disclaims to thee the veil of low reserve;\n  Owns all its weakness, will each thought confide,\n  And what it dares to feel, disdains to hide;\n  Owns, though no more the storms of passion rise,\n  That from the thought of selfish bliss it flies,\n  Still feels whate'er had once the power to charm,\n  Faithful affection, sensitive alarm;\n  But from the pangs which once it felt relieved,\n  No more will trust where once it was deceived;\n  To thee alone will look for future joy,\n  And for thy bliss each anxious wish employ:\n  Absorbed in thee, and in thy opening views,\n  Its pains, its pleasures, nay its being lose:\n  One we will be, and one our future cares,\n  Our thoughts, our hopes, our wishes, and our prayers.\n\n                                                          LAURA.\n\nWith both these little pieces Ellen was perhaps more pleased than their\nintrinsic merit warranted; but we naturally look with a partial eye on\nthe performances of those we love. After looking over several other\npoetical attempts, and some beautiful drawings, they returned to\nJuliet's apartment, where they spent a delightful evening; for Juliet\nseemed materially mending, and Laura's spirits rose in proportion.\n\nThus, and in similar pleasures, passed the time till the beginning of\nMarch, varied indeed by the occasional visits of the neighbouring\nfamilies. One day, after a long solicitation, the St. Aubyns, Cecils,\nand some more of the most fashionable people near them, dined with Mrs.\nDawkins, where they also met her tender friend and shadow, Miss Alton,\nwho this day, for the first time in her life, was destined to offend\nthat _sweet woman_, Mrs. Dawkins; for charmed to find herself seated on\na sofa between \"her _dearest_ Lady St. Aubyn,\" and that _most\ndelightful_ man, General Morton, a veteran officer in the neighbourhood,\nat whom it was supposed Miss Alton had long _set her cap_, as the phrase\nis, she attended not to the hints, shrugs, and winks of her friend, who,\nnot keeping a regular housekeeper, and being extremely anxious for the\nplacing her first course properly, wished Miss Alton just to slip out\nand see it put on table: but vain were her wishes; and the cook, finding\nno aid-de-camp arrive, after waiting till some of the dishes were\nover-dressed, and others half cold, was obliged to act as\ncommander-in-chief, and direct the disposition of the table herself; in\nwhich, not having clearly understood her mistress's directions (for in\nfact her anxiety to have all correct made them vary every half hour),\nshe succeeded so ill, that when, after all her fretting and fuming, poor\nMrs. Dawkins was told dinner was on table, that unfortunate Lady had\nnearly fainted at perceiving, when she entered the dining-room, that\nhalf the articles intended for the second course were crowded into the\nfirst, and roasted, ragoued, boiled, fried, sweet and sour, were jumbled\ntogether, in the finest confusion imaginable!\n\n\"This is all _your_ fault,\" said Mrs. Dawkins, in a low voice, but with\nthe countenance of a fury, to poor Alton: \"you could not _stir_ to see\nit put down;\" and pushing rudely by her, she left her staring with\nsurprize, and wondering what had made the dear soul so very angry: but\nwhen she saw the blunders which were so obvious in the arrangement of\nthe table, and recollected her own negligence (for in fact she had\npromised to see it set down), she was in her turn quite shocked.\n\nInsupportable was the delay and confusion in putting down this second\ncourse; even curtailed as it was, Mrs. Dawkins's servants were not\nperfectly _au fait_ at such things, and at last Lord St. Aubyn gave a\nhint to his own man, who waited behind his chair to assist, which he did\nso effectually, that every thing was soon placed as by magic, and the\nrest of the dinner and dessert passed over tolerably well. After dinner,\nthe ladies retired to the drawing-room, and listened, with their usual\npatience, to fresh lamentations from Mrs. Dawkins, and renewed\nsympathies on the part of Miss Alton, who sought, by even increasing her\nusual portion of _tender sensibility_, to regain her wonted place in\nMrs. Dawkins's good graces; but that lady continued so haughty and\nimpracticable, that poor Alton came at last with _real_ tears, to\ncomplain to the good-natured Ellen and Laura of her hard fate, and the\nimpossibility, do all she could, of pleasing some people; and they\nreally were so sorry for her vexation, that when Lady St. Aubyn's\ncarriage was announced, she rescued her from the visible unkindness of\nMrs. Dawkins, by desiring to have the pleasure of setting her down, and\nmade her quite happy again, by asking her to meet a small party at the\nCastle the next day, which, as it was understood to be rather a select\nthing, and confined to those most intimate there, assured Miss Alton a\nrenewed importance with Mrs. Dawkins and all her friends, as she should\nhave much to tell, which they could by no other possibility know any\nthing about.\n\n\n\n\nCHAP. III.\n\n    Sweet Juliet, that with angels dost remain,\n  Accept this latest favour at my hands,\n  That living honour'd thee, and being dead,\n  With funeral praises do adorn thy tomb.\n\n                                               ROMEO AND JULIET.\n\n\nThe day was now fixed at the distance of a week for the removal of the\nSt. Aubyns to London. Ellen lamented much the impossibility of having\nLaura Cecil with her, who would have been such a support to her in a\nsituation so new; but nothing could be urged on that point, as it was\nimpossible she could leave Juliet, who appeared sometimes better\nsometimes worse, but always patient, gentle, and pious to a degree that\nwas really angelic.\n\nEllen felt sincerely grieved to leave her, and proposed that she should\nbe removed to London for better advice, but found this expedient had\nbeen before resorted to, and Doctor B----'s advice frequently renewed by\nletters since, and that it was thought the air of London did not agree\nwith her. The weather now, for the time of year, the second week in\nMarch, was remarkably mild; and the medical man in attendance on Juliet,\nwho had now been for some days tolerably free from the low fever which\ngenerally hung about her, permitted her to go out once or twice in a\ngarden chair, for the benefit of the air: the returning verdure of\nspring seemed, for a time, to revive her: but whether the exertion was\ntoo much, or some unobserved change in the atmosphere affected her\ndelicate frame, could not be known; but she was suddenly seized with one\nof those attacks of fever which had so frequently brought her to the\nbrink of the grave; and on the day before that fixed for Ellen's leaving\nNorthamptonshire, a note from Laura announced that the life of this\nadmirable young creature was despaired of.\n\n\"She is perfectly sensible,\" added the afflicted sister; \"the dear angel\nretains all her usual pious composure; she wishes to see you. Could you,\ndear Lady St. Aubyn, without being too much affected, come to her?\"\n\nEllen, bursting into tears, put the note into St. Aubyn's hand, saying,\n\"Oh, my dear Lord; let me go--pray let me go directly!\"\n\n\"Be less alarmed, be more composed, my dearest love,\" replied he, after\nglancing over the contents, \"or I cannot consent to your going. I wish\nit had not been asked.\"\n\n\"Oh, indeed, dear St. Aubyn, I am quite composed, quite easy; but I\nshall suffer much more in not seeing the dear, dear creature once again,\nthan even by witnessing this sudden and most unexpected change.\"\n\n\"Well, my love, we will go together; but do not be too much alarmed; she\nmay yet recover: Laura's fears may outrun the occasion: Juliet has often\nbeen very ill before; but we will go: they will both, I know, be pleased\nat your coming.\"\n\nHe then ordered the carriage, which was soon ready; and half an hour\nbrought them to Rose-hill. Ellen was immediately shewn to Juliet's room:\nby the bed-side sat Laura: her cheeks, lips, and whole countenance, were\nthe colour of monumental marble; not a tear fell from her eyes; not a\nsigh heaved her bosom; but the woe, the deep expressive woe which marked\nevery feature, no language could describe: she rose, and advanced a few\nsteps to meet Ellen, grasping her hand with one which the touch of death\ncould alone have rendered colder; her lips moved, but no articulate word\nbroke the mournful silence.\n\nEllen turned pale, shuddered, and looked ready to faint; Miss Cecil\nmade a sign to an attendant, who, bathed in tears, stood near her: she\nplaced a chair for Lady St. Aubyn, and brought her a few drops in some\nwater; she wept, and was relieved.\n\n\"Oh, why did I send for you!\" said Laura, in a low tone, and speaking\nwith difficulty; \"I fear it is too much.\"\n\n\"Don't be frightened, my Lady,\" said the nurse: \"Miss Juliet is a little\neasier; she is dozing.\"\n\nIn a few minutes Juliet moved and spoke, but so faintly, her voice could\nhardly be distinguished. In an instant Laura was on her knees beside\nher, and catching the imperfect sounds, replied in a voice which\nbetrayed not the anguish of her soul, \"Yes, my love, she is here--will\nyou see her?\"\n\nThen turning to Ellen, she motioned her to approach. Ellen rose, and\nwent to the bed-side; she looked on Juliet, and saw that sweet angelic\ncountenance, slightly flushed, and looking as composed as ever; and\nignorant of the appearances of disease, fancied her better, and was, in\nsome measure, comforted. Juliet faintly articulated a few words,\nexpressive of the pleasure she felt in seeing Ellen, and would have said\nmore, but the nurse, for the sake of all, interposed, and requested that\nMiss Juliet might not be allowed to speak much. With difficulty she held\nout her feeble emaciated arms to Ellen, who tenderly embraced her, and\nhalf dissolved in tears, retired to the window, whither she drew Miss\nCecil. Still the wretched Laura shed no tear; and the deep grief,\nimpressed on her fine countenance, was much more painful to the beholder\nthan the loudest expressions of sorrow could have been.\n\n  \"Give sorrow vent: the grief which does not speak\n  Whispers the o'er-fraught heart, and bids it break!\"\n\n\"For heaven's sake, my dearest Laura,\" said Ellen, \"endeavour to take\ncomfort; surely she is better--she will recover!\"\n\nLaura only shook her head; and the nurse approaching, said, \"Indeed,\nMadam, Miss Cecil will kill herself; she has not had her clothes off\nthese two nights, nor has the slightest refreshment passed her lips this\nday.\"\n\n\"Oh! talk not to me of rest or food,\" cried Laura, \"I can partake of\nneither.\"\n\nEllen most tenderly urged her to take something; but pressing her hands\nupon her heart, she replied, \"Oh no, oh no--I could not; indeed I could\nnot. Go,\" she added, \"my dear friend--go, this is no place for you;\nnothing but the request of ----; nothing but _her_ request should have\ninduced me to send for you.\"\n\n\"But now I _am_ here,\" said Ellen, \"surely you will allow me to stay; I\nmay be of use to you; of comfort to dear dear Juliet.\"\n\nIn vain she urged. Laura sacrificed all selfish considerations, and\ninsisted on her returning home, promising to send to her should Juliet\nwish to see her again; and St. Aubyn, anxious for her, now sent to\nrequest his wife would come: she therefore embraced her friend, and\nlooking once more on the departing saint, who now again lay heavily\ndozing, she lifted up her hands and eyes to heaven, and, with another\nshower of tears, left the room.\n\nSt. Aubyn was rejoiced to find her disposed to accompany him home,\nthough she complained bitterly that Laura would not let her stay.\n\n\"Laura,\" said he, \"judges as she always does, wisely, and acts kindly:\nyou could be of no real service, and your being here would be highly\nimproper; you must not think of it.\"\n\nTwo days of the greatest anxiety now passed, and at the end of that time\nthe fair and lovely Juliet breathed no more: her last moments were\nattended by consolation so powerful, and hopes so celestial, as might\nwell have taught the worldly \"how a Christian could die!\"\n\nFor many days Laura was confined to her bed, and it was feared she would\nfollow her sister to the grave; but by degrees she shook off the excess\nof her sorrow, and for her father's sake endeavoured to recover from the\ndreadful shock she had received.\n\nSir William Cecil, who had long been convinced that Juliet would not\nlive many months, was more easily consoled. The St. Aubyns of course had\ndelayed their journey to London on this event; and finding that Sir\nWilliam Cecil was disposed to make an excursion to Bath, which his gouty\nhabit indeed rendered almost necessary, they endeavoured to prevail on\nLaura to come to them at St. Aubyn Castle for a short time, and then go\nwith them to London. From this proposal, especially the latter part, she\nfor some time shrunk, and wished to be allowed to remain at Rose-hill\nalone: but that her friends would not permit: and Sir William having\narranged to go to Bath at the same time with a neighbouring family, and\nto be in the same house with them, Laura was at length prevailed on to\nremove to the Castle, and from thence, after a short stay, to accompany\nher friends to London, where they promised her an apartment exclusively\nher own, and that she should see no other till she herself wished it.\n\n\"Yet why,\" said she, \"my dearest Lady St. Aubyn, why should I burden you\nwith one so powerless to add to your comforts, or partake your\npleasures?\"\n\n\"Is not that an unkind question?\" said Ellen; \"or do you really believe\nme insensible to the gratification of soothing your mind, and supporting\nyour spirits? Whenever you will permit me, I will be your visitor in\nyour apartment; whenever my company would be irksome, I will leave you\nto yourself, provided I do not find you the worse for the indulgence.\"\n\nAll was therefore thus arranged, and Miss Cecil, Lord and Lady St. Aubyn\nin one carriage, and Miss Cecil's maid, and Ellen's talkative but\nfaithful Jane, in another, with out riders, &c. in great style left\nNorthamptonshire, and arrived the next evening at the Earl's magnificent\nhouse in Cavendish-square.--Lady St. Aubyn's first care was to select\nsuch an apartment for the mournful Laura as would make her easy, and\nfree from restraint; and having conducted her to it, she told her she\nwas entirely mistress there, and never should be interrupted unless she\nchose it.\n\nEllen, who had made several little attempts in verse since she had seen\nthose of Miss Cecil, now soothed her sorrow for the loss of the sweet\nJuliet by a few stanzas, which, when she thought her able to bear them,\nshe gave to Laura, who was gratified by this little tribute to her\nloved, lamented sister's memory.\n\n\n  ELEGIAC STANZAS.\n\n  How mourns the heart, when early fades away\n    The opening promise of a riper bloom;\n  When youth and beauty, innocently gay,\n    Sink in the silent ruin of the tomb!\n\n  Oh, thou pure spirit! which in life's fair dawn,\n    Arose superior to that childish frame,\n  (Fair tho' it was) from which thou art withdrawn,\n    To that bright Heaven from whence thy beauty came.\n\n  Sweet Juliet! happily releas'd from care,\n    Which future years perhaps had bade the prove;\n  A heart so tender, and a form so fair,\n    Ill with the perils of the world had strove!\n\n  Thy heart expanding at affection's voice,\n    How had it borne in native kindness warm,\n  To check the rapid fire of youthful choice,\n    And dread deceit beneath the loveliest form!\n\n  To thee were graces so benignly given,\n    A soul so tender, and a wit so rare;\n  A love of harmony, as if kind Heaven\n    Had bade thee for an early bliss prepare.\n\n  Long shall the heart which lov'd thy dawning grace,\n    The pensive mem'ry of each charm retain;\n  Thy winning manners studiously retrace,\n    And dwell anew on each harmonious strain.\n\n  Nor shall that heart to present scenes confine\n    Its views and wishes; but with worthier care,\n  Seek to preserve an innocence like thine,\n    And humbly hope thy happiness to share.\n\n\n\n\nCHAP. IV.\n\n  To such how fair appears each grain of sand,\n  Or humblest weed as wrought by nature's hand!\n  A shell, or stone, he can with pleasure view.--\n  ----See with what art each curious shell is made:\n  Here carved in fret-work, there with pearl inlaid!\n  What vivid th' enamel'd stones adorn,\n  Fair as the paintings of the purple morn!\n\n                                                      S. JENYNS.\n\n\nThe arrival of the St. Aubyns in London opened a wide field for\nconjecture and conversation in the fashionable world. It was known, for\nSt. Aubyn's haughty relations had not failed to publish it, that he had\nmarried a young woman far inferior to him in rank, and absolutely\nwithout fortune. It was also known that she was uncommonly beautiful;\nand great anxiety, mixed with no small share of ridicule, was excited by\nher expected _debut_; but the modest Ellen was in no haste to afford the\nstarers and sneerers so rich a treat: she merely went to a few morning\nexhibitions, attended only by her Lord, for the first fortnight of her\nstay in town; and indeed St. Aubyn hoped, notwithstanding her present\ndistance and displeasure, to induce his aunt, Lady Juliana Mordaunt, to\nchaperon Ellen to some of the public places, being fully sensible what\nan advantage it would be to her to be so supported: he therefore\nacquiesced in her wishes, till he could bring about this desirable\narrangement, and allowed his wife to spend most of her evenings at home.\n\nSeveral ladies had however called on Lady St. Aubyn, some of whom had\nleft their cards, and others she had seen. Most of these visits she had\nreturned; but one of those, who had shewn the greatest desire to see\nmore of Lady St. Aubyn--indeed, a distant relation of the Earl's, she\nhad not been yet to see.\n\nOne morning Lord St. Aubyn said he would go with her to see the museum\nof an old friend of his, who lived at Knightsbridge, who was a great\ncollector of every thing rare and curious, particularly shells,\npictures, and gems. \"He is quite a character,\" added he: \"but I will not\nanticipate your surprize: we can go there early. I told him we would go\nto-day, or to-morrow; and after we have been there, you can call on Lady\nMeredith, who gave herself a trouble so extraordinary, as actually to\nalight from her carriage and make you a personal visit.\"\n\n\"You will go with me?\"\n\n\"Pardon me, my love, that is not necessary, and you really must learn to\n_go alone_, and not depend so much on me.\"\n\n\"I hope her Ladyship may not be at home.\"\n\n\"Indeed, my love, I hope she may; for dissimilar as they are in every\nrespect, my aunt, Lady Juliana, spends a great deal of her time there.\nShe is so fond of finding fault, and differing in opinion from others,\nthat I really believe she goes to Lady Meredith's chiefly for the\npleasure of lecturing her, who is so indifferent to the opinion of any\none, that she does not think it worth while to be at the trouble of\nresenting the sharp things Lady Juliana says to her.\"\n\n\"What a strange motive for being intimate with any one.\"\n\n\"Strange enough: but when you see more of the world, you will discern\nthat affection is not the only bond of union between those who call\nthemselves friends.\"\n\n\"I think I have seen that already in Mrs. Dawkins and Miss Alton.\"\n\n\"True: convenience, the wish of finding a patient _hearer_, accident,\nthe want of a more pleasing companion, are amongst the numerous\ninducements which form what we are pleased to call friendship. Nay, I\nonce heard a good lady say she was sure a family she mentioned had\nproved themselves _real friends_ to her, for they had sent her a _large\nplumcake_[A].\"\n\n    [A] A fact.\n\nEllen laughed at this curious definition of friendship.\n\n\"Well,\" said St. Aubyn: \"but to return to Lady Meredith. I hope she may,\nby reporting well of you to Lady Juliana, induce her to become more\nfriendly towards us: you know how anxious I am to have you in her good\ngraces--not, believe me, on account of her immense fortune, but because,\nwith all her pride and stiffness, she has a warm heart and excellent\nqualities, and would be to you a most valuable friend; so pray do your\nbest to please Lady Meredith.\"\n\n\"Very well: but will you tell me the most likely way to succeed?\"\n\n\"I am afraid it will be difficult: she will think you too handsome,\nunless indeed she intends soon to have a large party.\"\n\n\"How is it possible _that_ should have any thing to do with the matter?\"\n\n\"Why, Lady Meredith's great ambition is to outshine all her competitors\nin the number and fashion of those collected at her routes; and as\nsometimes, in spite of her charms, and the lustre of her abundant\njewels, there are some obstinate animals who will be uncivil enough to\nrecollect they '_have seen them before_,' consequently become rather\nweary of them, and desert her for some newer belle. Lady Meredith may\nthink you (so new to the world, and so beautiful) a desirable\nreinforcement, and may therefore honour you with an invitation: pray\naccept it, if she does, and take great pains at your toilette to-day:\nfor my friend, Mr. Dorrington, is a great admirer of beauty, and will\nshew you his fine collection a great deal more readily if he admire\nyour's, particularly if he should fancy you like a bust he has of the\n_bona Dea_ (at least he gives it that name, though it is so mutilated,\nhe confesses he does not exactly know for what or whom it was designed),\nwhich he almost idolizes.\"\n\nEllen hastened to obey, but she wished herself at Castle St. Aubyn, for\nshe had not liked the little she had seen of Lady Meredith, and she\nshrunk from the idea of this formidable morning visit. Conquering her\nfears, however, as well as she could, and looking uncommonly beautiful,\nshe rejoined her Lord. Her milliner had just sent home a most elegant\nand expensive morning dress, bonnet, and cloak, all of the finest\nmaterials, and in that delicate modest style, which she always chose,\nand was to her peculiarly becoming. St. Aubyn thought he had never seen\nher look so well, and gave great credit to Madame de ---- for consulting\nso admirably the natural style of her beauty, as to embellish, without\noverloading it. The barouche was at the door: she had therefore only\ntime to say \"farewell\" to Laura, and stepping hastily in, half an hour\nbrought them to Mr. Dorrington's.\n\nAs the carriage stopt at the house, the figure of a fine old man with\ngrey hair caught the eye of Lady St. Aubyn: he was at the instant\nascending the steps to knock at the door, and was so meanly dressed,\nthat she supposed him a mendicant, or at least extremely poor, and her\nready hand sought her purse, intending to give relief to the infirm\nlooking old man. What then was her surprize, when, just as she stretched\nout her hand for that purpose, the old man, looking into the carriage,\nand seeing Lord St. Aubyn, advanced, and taking off his hat with the\nmost courtly air imaginable, displayed a fine commanding forehead,\nexpressive eyes, and a contour of countenance so admirable, as, once\nseen, could never be forgotten.\n\n\"Ah! my dear St. Aubyn,\" he exclaimed, \"how rejoiced I am to see you! I\nam really happy that I returned in time to receive you: as you did not\nsay positively you would come to-day, it was all a chance; but come, do\nme the favour to alight: I have just succeeded in making the finest\npurchase--a shell, a unique: you shall see it.\"\n\nBy this time St. Aubyn had alighted, and giving his hand to Ellen,\nintroduced her to this extraordinary man. Nothing could be more polished\nthan his address, nothing more elegant than the grace with which he\nreceived her, or more spirited than the little compliment he made St.\nAubyn on his happiness, and the beauty of his lady.\n\nWhoever looked at Mr. Dorrington, when his shabby old hat was removed,\nmust instantly see the man of sense and superior information: whoever\nheard him speak, heard instantly that it was the voice and enunciation\nnot only of a gentleman, but of one who had lived in the very highest\ncircles; and yet his appearance, at first, would have led any one to\nsuppose him, as Ellen did, in absolute poverty. He led the way into his\nfavourite apartment, indeed the only one he ever inhabited, except his\nbed-chamber; and into neither would he ever suffer any one to enter\nunless he was with them. No broom, nor brush of any kind, ever disturbed\nthe sacred dust of this hallowed retirement: in the grate, the\naccumulated ashes of _many months_ remained; the windows were dimmed\nwith the untouched dirt of years: and nothing but the table on which his\nslender meals were spread (for his temperance in eating and drinking\nwere as remarkable as his singular neglect of personal attire), and two\nor three chairs for the reception of occasional visitors, were ever\nwiped. In one of these he seated the astonished Ellen, who gazed around\nher at treasures, the value of which exceeded her utmost guess. A\nhandsome cabinet with glass doors contained a variety of curious gems,\nvases, and specimens of minerals: some invaluable pictures stood leaning\nagainst the walls: heaps of books in rich bindings, which Ellen\nafterwards found were either remarkable for their scarceness, or full of\nfine prints, lay scattered around.\n\n\"Now, my Lord,\" said Mr. Dorrington, \"I will shew you and Lady St. Aubyn\nmy new purchase: I said it was unique, but it is not exactly so: I have\nanother of the same sort; but these are the only two in the world: I\nthink this is a little, a very little finer than that I had before; I\nbought it at ****'s sale, and gave a monstrous price for it; but I was\ndetermined to have it: it was the only thing in his collection I\ncoveted.\"\n\nHe then displayed his new purchase, and descanted for some time on its\nvarious beauties; and seeing Ellen really admired it, pleased also with\nher beauty and sweetness, he proceeded to shew her his collection, and\neven those rare articles which never appeared but to particular\nfavourites, saying she was \"_worthy to admire them_.\" Some beautiful\nminiatures particularly pleased her, and he was delighted that she\nseemed to understand their value. He also produced some fine illuminated\nmissals, and explained every thing with so much grace and perspicuity as\nquite delighted her.\n\nTwo hours fled swiftly in examining these wonders, and even then they\nhad not seen half, but promised to visit him another day. He told Lady\nSt. Aubyn he should be at her command at any time; and then most\npolitely attending her to her carriage, he with a courteous bow took his\nleave.\n\nOn their way home, St. Aubyn told Ellen that the extraordinary man they\nhad just left had for many years led a life of dissipation, by which he\nreduced a large fortune almost to nothing; but that having once, in\nconsequence of his extravagance, been obliged to sell a collection\nstill finer than that he now had, he had determined to gratify his\npassion for _virtu_, without the risk of again ruining himself, and\ntherefore denied himself every thing but the bare necessaries of life;\nand was, consequently, enabled to purchase rare articles at any price,\nand to outbid other collectors, who had different demands on part of\ntheir incomes. He kept no man, and but one female servant; and St. Aubyn\nsaid, that when he had called on him a few days before, he found him in\na storm of rage with this poor servant-girl, for having dared, while he\nwas engaged with some company in his sitting-room, to brush out his\nbed-chamber, in the door of which he had, _par miracle_, left the\nkey.--\"And I am sure, Sir,\" said the girl, crying, \"I never touched\nnothing but that great wooden man\" (meaning a layman which always stands\nin Mr. Dorrington's room), \"that's enough to frighten a body; and he I\nonly just moved, for master never won't have nothing like other people;\nand I thought if he brought the gentlefolks in his bed-room, as he\nsometimes will, it was a shame to see such a place, and such a dirty\ntable cover; so I was only just going to make it a little tidy, and I\nnever broke nothing at all.\"\n\n\"I comforted the poor girl,\" said St. Aubyn, \"by giving her a trifle,\nand advised her by no means to provoke her master, by presuming to touch\na brush in his rooms again without order: and she promised me she would\nin future be contented with cleaning her own kitchen and passages--'And\nnever touch nothing belonging to master's rooms, nor any of them\noutlandish things, that be all full of dust, and enough to breed moths\nand all manner of flies all over the house.'----And I think,\" said he,\nlaughing, \"she appears to have kept her promise very exactly.\"\n\n\n\n\nCHAP. V.\n\n  ---- So perfumed, that\n  The winds were love-sick with it.\n  ---- She did lie\n  In her pavilion, cloth of gold.\n\n                                           ANTONY AND CLEOPATRA.\n\n\nLady St. Aubyn set down the Earl in Cavendish Square, and proceeded\nalone to the house of Lady Meredith in Portland Place. A carriage which\nappeared to be in waiting drove from the door to make way for her's, by\nwhich Ellen guessed Lady Meredith had company. To the inquiry whether\nher Ladyship were at home, she was answered in the affirmative, and\nrequested to walk up stairs. Ellen was now tolerably well accustomed to\nmagnificent houses; but there was something in the style of this\ndifferent from any thing she had yet seen: the hall was not only warmed\nby superb stoves, but bronze figures, nearly as large as life, stood in\ndifferent attitudes in every corner, and all bearing censers or urns, in\nwhich costly aromatics perpetually burnt, diffusing around a rich but\nalmost overpowering perfume. As she ascended the staircase she found\nevery possible recess filled with baskets, vases, &c. full of the most\nrare and expensive exotics, which bloomed even amidst the cold winds of\nMarch, with nearly as much luxuriance as they would have done in their\nnative climes; for every part of this mansion was kept in a regular\ndegree of heat by flues passing through the walls and beneath the floors\ncommunicating with fires, which were not visible: when, on the other\nhand, the weather became warm, the cambric sun-blinds at every window\nwere kept perpetually moistened with odoriferous waters, by two black\nservants, whose whole employment it was to attend to this branch of\nluxury; indeed, to luxury alone the whole mansion appeared to be\ndedicated. The floors were not merely covered, but carpetted with\nmaterials, whose softness and elasticity seemed produced by a mixture of\nsilk and down: the sofas, ottomans, &c. were not merely stuffed, but\nevery one had piles of cushions appertaining to it, filled with\neider-down, and covered with the richest silks or velvets. To the\npresiding goddess of this superb temple Lady St. Aubyn was presently\nintroduced. In her boudoir Lady Meredith sat, or rather lay, not on a\nchair or sofa, but on piles of cushions, covered with the finest painted\nvelvet. Her majestic, though somewhat large figure, appeared to great\nadvantage in the studied half-dress in which she now appeared; yet there\nwas something in her attitude, in the disposal of her drapery, from\nwhich the modest eye of Ellen was involuntarily averted. Her dress was\nof the finest and whitest muslin that India ever produced, and clung\naround her so closely as fully to display the perfect symmetry of her\nform: the sleeves were full, and so short, they scarcely descended below\nthe shoulder, which not the slightest veil shaded from the beholder's\ngaze, while the delicate arms thus exposed were decorated with rows of\nwhat she called undress pearls: they were of an extraordinary size and\nbeauty, and were formed into armlets and bracelets of fanciful but\nelegant fashion: two or three strings, and a large Maltese cross of the\nsame, were the only covering of her fair bosom, and a few were twisted\nloosely amongst her dark but glossy and luxuriant hair. At her feet sat\na lovely little girl about four years old, with a low hassock before\nher, on which she was displaying the contents of one of mamma's caskets\nof jewels, as well amused as the great Potemkin himself could have been\nby arranging his diamonds in different figures on black velvet; a\nfavourite entertainment of that extraordinary man.\n\nOn one side of Lady Meredith sat a gay young officer in the uniform of\nthe guards, and on the other a stiff formal looking old lady in a dress\nsomewhat old fashioned, but more remarkable for being excessively neat\nand prim: she had a sour contemptuous look, and her stays and whole\nfigure had the stiff appearance of a portrait of the last century. She\nlevelled her eye-glass at Ellen, as she followed the servant who\nannounced her into the room, and with an emphatic _humph!_ (not unlike\npoor Mrs. Ross's) let it fall again as if perfectly satisfied with one\nlook, and not feeling any wish to repeat it; yet repeat it she did,\nagain and again, and, as if the review displeased or agitated her, her\ncountenance became still more and more sour. In the meantime Lady\nMeredith half rose from her cushions, and holding out her hand,\nlanguidly said:--\n\n\"My dear Lady St. Aubyn, how good you are to come and see me! I am\ndelighted I happened to be at home. Andrew,\" (to the servant, who,\nhaving placed a chair, was retiring) \"don't give Lady St. Aubyn that\nshocking chair: bring a heap of those cushions and arrange them like\nmine: do rest on them, my dear creature; you must be fatigued to death.\"\n\n\"Excuse me,\" said Ellen, smiling with modest grace; \"I am not accustomed\nto such a luxurious seat, and prefer a chair.\"\n\n\"Do you really? Is it possible!\" exclaimed the languishing Lady, sinking\nback again as if the exertion of speaking had been too much for her.\n\"Well, I should absolutely die in twelve hours if I might not be\nindulged in this delicious mode of reposing.\"\n\n\"Nonsense!\" said the stiff old lady, in no very conciliating tone; \"how\ncan you be so ridiculous: pray how do you manage when you sit six or\neight hours at pharo, or go to the Opera--you have none of those silly\nthings there?\"\n\n\"Oh, as to pharo, dear delightful pharo, that keeps me alive, prevents\nmy feeling fatigued even when my unfortunate feet cannot command so much\nas a poor little footstool; and as to the Opera, I wonder your Ladyship\nasks, for you know very well, my box, and the cushions belonging to it,\nare stuffed with eider-down, like these,\" and she sunk still more\nindolently on her yielding supporters. \"Apropos of the Opera,\" added\nshe; \"have you obtained a box there, Lady St. Aubyn?\"\n\n\"No,\" replied Ellen: \"Lord St. Aubyn had one offered to him, but as it\nis so late in the season, and our stay in town will not be long, I\nbegged him to decline it.\"\n\nLady Meredith here exchanged a smile of contempt with the officer, which\nseemed to say \"how rustic that is!\" then half yawning she said:--\n\n\"Oh, but indeed that was very wrong: what can a woman of fashion do\nwithout a box at the Opera? I am sure, from all I have heard of the\nformer Lady St. Aubyn, for I had not the honour of knowing her, she\nwould not have lived a month in London without one.\"\n\n\"Very likely,\" said the old lady, \"but for all that _I_ think _this\nyoung person_ quite in the right, and as to the late Lady St. Aubyn, I\nam sure _she_ was no pattern for any body, and I wonder, Lady Meredith,\nyou will name her in my hearing.\"\n\n\"I beg your Ladyship's pardon,\" replied Lady Meredith; \"I forgot.\"\n\n\"Well, no matter; don't say any more.\"\n\nTo paint Ellen's surprize would be difficult: the odd epithet this\nstrange lady had applied to her, \"_this young person_,\" the allusions to\nthe late countess, of whom she never heard without an indescribable sort\nof emotion, and the suspicion she now entertained that her ungracious\nneighbour was Lady Juliana Mordaunt, all conspired to overpower her;\nand the heat of the apartment, the strong smell of perfumes from immense\nChina jars, with which the room was ornamented, completed it; in short,\nthough wholly unaccustomed to such sensations, she had nearly fainted.\nThe young officer, who had long been watching her interesting and lovely\ncountenance, saw her change colour, and said hastily:--\n\n\"The lady is ill.\"\n\n\"What's the matter, child?\" said the old lady; and rising hastily, she\nuntied her bonnet and the strings of her mantle, which, falling aside,\ndiscovered enough of her figure to render her situation obvious.\n\n\"So!\" exclaimed the old lady; but whether the interjection expressed\nsurprize, pleasure, or what other sensation, was not easy to discover.\n\"Do, Colonel Lenox, exert yourself so much as to open the door and ring\nfor a glass of water: the air of this room is enough to kill any body.\"\n\n\"Pardon me,\" said Ellen, the colour returning to her cheeks and lips,\n\"I am sorry to give so much trouble; I am much better.\"\n\n\"That's well,\" said the old lady. By this time the water was brought;\nEllen drank some, and quite recovered, begged leave to ring for her\ncarriage.\n\n\"Don't go yet, child,\" said the old lady; \"perhaps you may be ill\nagain.\"\n\n\"No: pray don't go yet,\" said Lady Meredith, who all this time had been\nholding a smelling bottle to her own nose, affecting to be too much\novercome to do any thing for the relief of her visitor. \"You have\nfrightened me enormously; stay a little to make me amends; besides, you\nstill tremble and look pale: are you subject to these faintings?\"\n\n\"Not in the least,\" said Ellen. \"I believe the heat of the room overcame\nme.\"\n\n\"No wonder,\" said the old lady; \"it is a perfect stove, and enough to\nunstring the nerves of Hercules, especially when aided by the powerful\nscent of those abominable jars.\"\n\n\"Oh, my dear sweet jars,\" cried Lady Meredith; \"now positively you shall\nnot abuse them; any thing else you may find what fault you please with,\nbut my sweet jars I cannot give up:--have you ever read Anna Seward's\npoetical recipe to make one?\"\n\n\"Not I,\" replied her friend in an angry tone, \"nor ever desire it; all\nthe poetry in the world should never induce me to fill my rooms with\nsuch nonsense.\"\n\nDuring this conversation, the little girl, who had tired herself with\nlooking at the jewels and trinkets, rose from her cushion, and said:--\n\n\"Pretty mamma, dress pretty Miranda in these,\" holding up some fine\nemeralds.\n\n\"No indeed, child: go to Colonel Lenox, and ask him to adorn you; I\ncannot take so much trouble.\"\n\n\"No, Miranda won't; Miranda go to pretty, sweet, beautiful lady;\" and\nshe went to Ellen, who, admiring the lovely little creature, kissed her,\nand indulged her by putting the shining ornaments round her little fair\nneck and arms, and twisting some in the ringlets of her glossy hair.\n\n\"Now I beautiful,\" said the child, looking at herself. \"Is not Miranda\npretty now, mamma?\"\n\n\"Yes, my love, beautiful as an angel: come and kiss me, my darling.\"\n\nThe child, climbing up the load of cushions, laid her sweet little face\nclose to her mother's and kissed her.\n\n\"Is not she a beauty and a love?\" said the injudicious mother to the\nColonel, clasping the little creature to her bosom, with an air more\ntheatrical than tender. He whispered something, in return to which she\nreplied with affected indignation, \"Oh, you flattering wretch, _that_\nshe is, and a thousand times handsomer; but she will never know what[B]\nher mother was, for before she is old enough to distinguish, I shall\neither be dead or hideous, and then she will hate me.\" She heaved a deep\nsigh, and looked distressed at the idea, which the child perceiving,\nfondly twined her little arms round her mother's neck, and answered:--\n\n\"No, dear mamma, Miranda always love you, you so beautiful.\"\n\n    [B] It is said that the once lovely Lady C----, when on her\n        death-bed, lamented to a friend sitting by her, that her\n        little boy, then in the room, _would never know what a\n        beautiful creature his mother was_. \"She feels the\n        ruling passion strong in death!\"\n\n\"See,\" said the old lady, \"the effect of your lessons; you teach her to\nlove nothing but beauty, and if you were to lose your good looks, she\nwould of course cease to care any thing about you.\"\n\n\"Yes, that is exactly what I dread.\"\n\n\"Then why do you not endeavour to prevent it, by giving her more\nreasonable notions? If she is led to suppose beauty and fine dress the\nonly claims to affection, if she is never taught that virtue and an\naffectionate heart can alone ensure unfading esteem, she will grow up a\nmere frivolous automaton, and probably throw herself away on the first\ncoxcomb with a handsome face and red coat she meets with.\"\n\nThe Colonel coloured, laughed, and bowed.\n\n\"Nay,\" said the old lady, \"if you choose to apply the character to\nyourself, with all my heart, settle it as you please; but, I suppose,\nall red coats are not mere coxcombs.\"\n\nLady Meredith and the Colonel laughed, but did not appear entirely\npleased even with this half apology.\n\n\"Well, but,\" said Lady Meredith, \"what, Ma'am, would you have me do with\nMiranda? Can I prevent the child from observing that beauty is\nuniversally admired?\"\n\n\"That,\" said Colonel Lenox, with a bow, \"would indeed be impossible\nwhile with _you_.\"\n\nThe old lady shrugged up her shoulders, with a sour contemptuous frown,\nand said:--\"Then put her into a better school.\"\n\n\"A school!\" replied Lady Meredith, half screaming; \"what, would you have\nme send the dear creature from me? No, my only darling, thou shalt never\nleave me.\"\n\n\"Pshaw!\" exclaimed the old lady, with even encreasing sourness; \"well,\nif fashion absolutely demands this _extraordinary_ degree of tenderness,\nfor very good mothers _have_ sent their children to school before now,\nat least, do get the child a rational and sensible governess, and let\nher employ herself in something better than admiring your jewels, or\neven your beauty, all the morning.--Ah! I wish,\" said she, turning\nabruptly to Ellen, \"I wish she had such an instructress as _your Miss\nCecil_.\"\n\nEllen's surprise at this sudden address from one with whom not even the\nceremony of introduction had passed, yet who seemed to know her and all\nher concerns so well, almost deprived her of the power to reply; she\nrallied her spirits, however, and said, that any mother might think half\nher fortune well bestowed, could it purchase such a preceptress: \"But,\"\nadded she, \"such excellent qualities as Miss Cecil possesses, are rarely\nto be met with in any rank of life: my experience of character has,\nindeed, been very limited, but Lord St. Aubyn says, for elegance of\nmanners, sweetness of temper, and strength of mind, her equal will\nhardly ever be found.\"\n\nThe blended modesty and spirit with which she spoke appeared to please\nthe old lady, who, with an approving nod, again took up her eye-glass,\nand viewed Lady St. Aubyn from head to foot, though she saw that the\nsteadfast gaze embarrassed and covered her with blushes.\n\nLady Meredith said something to the old lady in so low a tone, that the\nword \"introduce\" was alone audible, to which she replied with some\ntartness: \"No, I can introduce myself.\"\n\nEllen now once more rose to depart, and Lady Meredith detained her\nanother minute, to mention a large party she intended having in about\nthree weeks, for which she said she should send Lady St. Aubyn a ticket;\nand requested her to tell St. Aubyn he might come also, \"For I hear,\"\nshe said, \"you always are seen together.\"\n\n\"So much the better,\" muttered the old lady, who seemed, however, to be\nspeaking aside, so no one took any notice of her. She rose when Ellen\nleft the room, and returned her graceful courtesy with a not ungracious\nbend, and bade her good morning with an air more conciliating than she\nhad shewn on her entrance.\n\nOn relating the particulars of this visit to her Lord, Lady St. Aubyn\nfound there was no doubt the old lady she had seen was Lady Juliana\nMordaunt: he made her repeat the conversation that had passed, and when\nshe told him that the old lady had made use of the disrespectful term,\n\"_this young person_,\" in speaking of her, he coloured excessively, and\nexecrating his aunt's pride and impertinence, told his wife she ought to\nhave quitted the room immediately. He smiled when Ellen mentioned Lady\nJuliana's attention and kindness on her fainting, and said, \"That is so\nlike her: her warm heart thaws the ice of her manners when she sees any\none ill or distrest.\"\n\nWhen Ellen repeated the mention which had been made in the course of\nconversation of the late Lady St. Aubyn, he changed colour, and said,\n\"Well, Ellen, were you not surprized? You did not, I believe, know--you\nnever heard I had been married before.\"\n\n\"Pardon me, my Lord, I was previously acquainted with that\ncircumstance.\"\n\n\"You knew it!--from whom? Where did you hear it?\"\n\n\"From Miss Cecil, from Miss Alton, accidentally.\"\n\n\"And were they not astonished you had not heard it before?\"\n\n\"I had heard it before from Mrs. Bayfield, the day after we went to\nCastle St. Aubyn.\"\n\n\"From Mrs. Bayfield--she told you of it?--She told you--What, Ellen, did\nshe tell you more?\"\n\n\"Nothing, my Lord, but that your lady was young and beautiful, and died\nabroad.\"\n\n\"And why did you never mention the subject before? Why this reserve, my\nlove?\"\n\n\"Because I thought as you never told me of it yourself, you would rather\nthe subject were not mentioned.\"\n\n\"Dear creature!\" said St. Aubyn, sighing. \"I have always had reason to\nadmire the excellence of your judgment and the delicacy of your\nsentiments. Believe me, Ellen, I withhold from you only those things\nwhich I think will give you pain to know. Our acquaintance commenced\nunder such singular circumstances, that I had hardly opportunity to tell\nyou this before we were married, and in fact, that name, that\nrecollection is so hateful to me, is connected with so many painful\nideas, that I cannot bear to recall, to dwell upon it! Why that tear, my\nlove--are you dissatisfied with me?\"\n\n\"No, dearest St. Aubyn: whatever you do, appears to me wisest and best\nto be done--but I was pitying--I was thinking----\"\n\n\"Whom were you pitying?--Of what was my Ellen thinking?\"\n\n\"Pitying a woman, who, having once possessed your love, lost it so\nentirely, as to render her very name unpleasant to you. Thinking--ah,\nheaven!--thinking--should such ever be _my_ lot!\"\n\nShe paused, struggling with a sudden gush of tears, and sobs which\nalmost choaked her.\n\n\"Impossible, impossible!\" exclaimed St. Aubyn, clasping her to his\nbosom: \"you will never deserve it, never bring disgrace and dishonour on\nmy name, and blast with misery the most acute, the best years of my\nlife!--Agitate not yourself, my best love, with these frightful ideas.\nAh, had the hapless Rosolia been like thee!--but oh! how different were\nher thoughts and actions!----No more of this, compose yourself, my love,\nand tell me what more passed with this strange proud woman.\"\n\nAfter a few moments, Ellen recovered enough to repeat the remainder of\nthe conversation, with the result of which he appeared very well\npleased, and prophesied from the latter part of it they should soon be\non good terms with Lady Juliana Mordaunt, an event for which he appeared\nso anxious, that Ellen could not fail to wish it also; and, indeed, that\nlady's good sense and just sentiments had made a very favourable\nimpression on her mind, though her manners were so sour and repulsive.\n\nThis day Miss Cecil dined with her amiable friends, as they had no other\ncompany; indeed, except by a few gentlemen, their dinner hour had\ngenerally passed uninterrupted, Ellen not being yet sufficiently\nacquainted with any ladies to mix with them in dinner parties. The\nreport of St. Aubyn's male friends had, however, been so favourable\ntowards her, as to incline Lady Meredith to wish a more intimate\nacquaintance, and to attract so much youth, beauty, and grace to her\nevening parties, while Lady Juliana was pleased to hear that she\npossessed qualities in her eyes far superior, namely, modesty, talents,\nand a demeanor towards her husband equally delicate and affectionate.\n\nAfter dinner, St. Aubyn having some engagement, left the fair friends\nalone, and they enjoyed a long and confidential conversation.\n\nFrom Laura, Lady St. Aubyn learnt that Lady Juliana was well known to\nher, and that in spite of her austere and forbidden manners, and the\npleasure she undoubtedly took in contradicting almost every thing she\nheard, she was yet a woman of good sense, and would most certainly,\ncould her esteem be once engaged, prove to Ellen a steady and valuable\nfriend: \"Especially,\" added Laura, \"should any thing happen to Lord St.\nAubyn, for she is his only near relation to whom he could confide the\nfuture interests, either of his wife or child; and young and beautiful\nas you are, my dear Ellen, no doubt St. Aubyn thinks such an additional\nsupport would be highly desirable for you.\" Seeing she was deeply\naffected, for Ellen now believed she could discern the cause of St.\nAubyn's anxiety for her being on good terms with his aunt, and connected\nit with the painful circumstances he had told her were hanging over him,\nLaura now added, with a pensive smile, \"Nay, my dear friend, do not be\ndistressed. I have of late thought so much of mortality, I was not\nsensible how much you would be pained by the suggestion; but certainly,\nSt. Aubyn will not leave you a moment the sooner for my hinting the\npossibility of such an event.\"\n\nEllen endeavoured to shake off the painful ideas which forced themselves\nupon her, and asked Miss Cecil if she had known much of the former\nCountess. \"Not very much,\" said Laura: \"she was very handsome, but the\ncharacter of her beauty was so different from yours, that I have often\nwondered how St. Aubyn came to _choose_ two so different; though,\nindeed, I believe I should hardly say choose, for Lady Rosolia de\nMontfort was not so much his choice as that of his relations--at least,\nI believe he would never have thought of her as a wife if they had not.\"\n\n\"Who was she? Do tell me a little about her: I am quite a stranger to\nall particulars.\"\n\n\"I know little more than I have told you, except that she was the only\ndaughter of the late Earl de Montfort, a distant relation of Lord St.\nAubyn's. Lord de Montfort, during the life of his elder brother, went to\nSpain in a diplomatic situation, and there married the daughter of the\nDuke de Castel Nuovo: this marriage with an English protestant, was, for\na long time, opposed by the lady's relations: but, at length, moved by\nfear and compassion for her, whose attachment threw her into a lingering\ndisease, which threatened her existence, they consented on one\ncondition, namely, that the sons of the marriage should be educated\nRoman Catholics, and on the death of their father, be placed with their\nmaternal grandfather, while they permitted the daughters to be brought\nup in the Protestant religion, hoping, perhaps, that the influence of a\nmother over females might ultimately bring them also over to her faith:\nbut the Countess died young: one son and one daughter were her only\nchildren, the boy some years younger than his sister: they both remained\nwith their father (who soon after his marriage became Earl de Montfort),\nsometimes in Spain, sometimes in England, till the marriage of Lady\nRosolia with Lord St. Aubyn, though she was frequently his mother's\nguest, both in London and at St. Aubyn Castle, where the young Edmund\nalso often spent some time: he was a very fine and amiable boy, and\nexcessively attached to his sister.\n\nWhen Lord de Montfort died, the son was claimed by his maternal\ngrandfather, and Lord and Lady St. Aubyn went to Spain with him, where\nshe died: report spoke unfavourably of her conduct during her abode on\nthe Continent; indeed, in England, the gaiety of her manners, especially\nafter the death of Lord St. Aubyn's mother, approached more nearly to\nthe habits of foreign ladies than those of England. It was said, that\nwhile abroad, Lord St. Aubyn was involved in many unpleasant\ncircumstances by her behaviour: certain it is, that on his return, he\nappeared overwhelmed with melancholy, which was the more extraordinary,\nas it was well known they had not lived on very affectionate terms even\nbefore they had quitted this country.\"\n\n\"And what became of her brother: where is the young Lord de Montfort?\"\nasked Ellen. \"He has remained ever since in Spain,\" replied Laura; \"but\nas he will very soon be of age, he must then, I suppose, return to\nEngland to take possession of his estates, of which Lord St. Aubyn is\nthe guardian.\"\n\n\"Oh,\" thought Ellen, \"is it to his return St. Aubyn looks with so much\napprehension and dismay? What! O! what is the strange mystery in which\nthis story seems to be involved?\"\n\n\n\n\nCHAP. VI.\n\n  \"Within 'twas brilliant all, and light,\n  A thronging scene of figures bright:\n  It glowed on Ellen's dazzled sight,\n  As when the setting sun has given\n  Ten thousand hues to summer's even;\n  And from their tissue fancy frames,\n  AErial knights and fairy dames.\"\n\n                                               LADY OF THE LAKE.\n\n\nThe next morning, Ellen, who felt a little fatigued from the various\ncircumstances of the day before, some of which had considerably agitated\nher spirits, declined going out; and after breakfast retired to her own\ndressing-room; Laura, at the same time, going to her's, having letters\nto write to her father and some other friends.\n\nLady St. Aubyn was soon surrounded by her favourite books, some maps, a\ndrawing she was finishing, and all those resources with which she now\nknew so well how to fill up her time. In one corner stood an elegant\nharp, on which Ellen had been taking lessons, and had made a\nconsiderable proficiency; in another sat her faithful Jane busy at her\nneedle, at which she was very expert; and Ellen detesting to see any one\nidle, kept her generally employed either in fine work, or making linen\nfor the poor, to seek out, and relieve whom, was one branch of Jane's\nbusiness. A simple, though graceful taste, regulated the ornaments and\nfurniture of this favourite retirement; no velvet cushions, no\noverwhelming perfumes, were met with here; all was elegant, but all was\nmodest, and generally useful: a small bookcase, a porte-feuille, a\nnetting box, shewed that its inhabitant loved to be employed.\n\nBy a cheerful fire this fair inhabitant was now seated: the modesty of\nher demeanor, the delicacy of her dress, were such as suited one, who,\nthough young, and even girlish, was a wife, and likely to be a mother;\nthe tout-ensemble, in short, was a perfect contrast to the figure,\ndress, and apartment of the luxurious Lady Meredith. A complete silence\nprevailed (for Jane had learned when her lady chose, which as now was\nsometimes the case, to have her in her apartment, to be quiet), and had\nlasted at least half an hour, when a step was heard in the anti-room;\nand a footman knocking at the door, Jane opened it, and the servant\nrequested her to tell her lady that----A voice behind interrupted him,\nby saying, \"You need not trouble yourself, Sir; I know my way, and shall\nannounce myself.\" Ellen rose, and looked surprised, for visitors were\nnever shewn to this room: still more was she amazed when she saw the\nsharp countenance and stiff figure of the old lady she now supposed to\nbe Lady Juliana Mordaunt, who, pushing by the man, gave him one of her\nexpress nods, and said, \"You may go, Sir.\"--She then advanced, and\nseeing Jane, who rose and stared at this extraordinary visitant, she\nsaid, with another nod to Ellen, \"So, you make your maid work at her\nneedle: I am glad of it; but send her away now, for I want to talk to\nyou.\" Ellen seeing that Jane hesitated to leave her with this stranger,\nwhom the poor girl began to believe was deranged, told her to go to her\nown room, and she, gathering up her work, very readily obeyed; though\nshe went to the housekeeper and told her she thought they had better\nboth go and stay in the anti-room, for she really believed a mad-woman\nwas gone into her Lady's dressing-room. \"Nonsense!\" said the\nhousekeeper: \"I saw the lady go up: it is my Lord's aunt, Lady Juliana.\"\nThis intelligence quieted Jane, who really was under some fears for\nEllen, to whom she was become tenderly attached.\n\nIn the meantime, Lady Juliana seeing that Ellen continued standing,\nsaid--\"Sit down, child, and don't be frightened.\" Ellen gladly obeyed,\nfor she could not help feeling a little agitated by Lady Juliana's\nstrange mode of visiting.\n\nThe old lady looked round the room, and after a moment's pause,\nsaid--\"Why, you are an unfashionable young woman, I see; work, books,\nmaps, and the furniture remaining nearly as it was seven years ago!\nWhat, has nobody told you, child, the whole house ought to be new\nfurnished?\"\n\n\"Indeed, Ma'am, if they had, I should have paid no attention to them,\"\nsaid Ellen. \"I must, indeed, be a strange ungrateful creature, if the\nmagnificent furniture of this house was not more than equal to my\nwishes.\"\n\n\"So much the better, I am glad of it,\" returned Lady Juliana.--\"Do you\nknow me?\" she added, turning in her usual abrupt manner to Ellen.\n\n\"I believe--I think I can guess.\"\n\n\"Oh, I suppose you told St. Aubyn you had met with a cross,\ndisagreeable old woman at Lady Meredith's, and he told you it must have\nbeen his aunt, Lady Juliana Mordaunt.\"\n\n\"Indeed, Madam,\" said Ellen, blushing a little at a statement so near\nthe truth.\n\n\"Nay, don't tell lies, child,\" bluntly replied the old lady. \"I hate\nflattery; besides, your countenance won't let you. I know what I am,\nwhich is more than every body can say. And do you generally spend your\nmornings in this manner?\"\n\n\"Generally, unless my Lord wishes me to go any where with him.\"\n\n\"And what do you do in the evening?\"\n\n\"Lord St. Aubyn, Miss Cecil, and myself, sit together: we net or work,\nwhile he reads to us, unless Miss Cecil is sufficiently in spirits to\ngive us some music.\"\n\n\"And have you no idea, child, how ridiculous the fashionable people\nthink all this?\"\n\n\"I am sorry for it.\"\n\n\"But will you persist in the same plan?\" Ellen smiled.\n\n\"And do you mean to go on in this way all the time you are in town?\"\n\n\"Not exactly perhaps. I am to see a little more of the public places;\nbut my Lord wished me to wait till----\"\n\n\"Till what? You may as well tell me, for I see you have an old-fashioned\nway of speaking your thoughts.\"\n\n\"It is true, your Ladyship sees in me one so little accustomed to the\nhabits of the great world, that I have not yet learned to dissemble:\nwill you permit me to say, and not be displeased, that Lord St. Aubyn\nanxiously wished to procure a chaperon, whose sanction should be\nunexceptionable--in short, Lady Juliana Mordaunt.\"\n\n\"I believe you are a little flatterer after all,\" said Lady Juliana,\nrelaxing into a smile. \"With all your talk of sincerity, I hardly\nbelieve St. Aubyn thought of me at all; and how, if he did, he could\nfancy I should ever get the better of the shock he gave my pride, call\nit prejudice if you will, by marrying _you_--for I love plain-dealing,\nchild. I don't know but it is all over now--I like you; and if you will\ncontinue as modest and unaffected as you are now, keep your neck and\narms covered, and bring your Lord an heir, that these de Montforts may\nnot succeed to his title, I will love you, and do all I can to assist\nand support you.\"\n\nSeeing that Ellen blushed at the last hint, she added,--\"Nay, you need\nnot blush, though I like to see you can: for I promise you, it was\nobserving the probability of such an event that did more to reconcile me\nto you than all your beauty and merit could have done; so take care of\nyourself, and don't disappoint me; and now, my dear, kiss me, and call\nme _aunt_ whenever you please.\"\n\nEllen modestly and gracefully bent to receive the old Lady's embrace,\nand at that instant St. Aubyn opened the dressing-room door, and found\nthe two people he loved best in the world in each other's arms, with\ntears of tenderness on the cheeks of both.\n\n\"What do I see!\" he exclaimed.--\"Is it possible!\"\n\n\"Yes,\" said Lady Juliana, \"it is very possible you see a foolish old\nwoman, who loves you too well not to love one so dear to you, and so\nworthy of being loved.\"\n\nSt. Aubyn respectfully and affectionately kissed the hand she gave him,\nand clasping Ellen in his arms, exclaimed, \"My dearest Ellen, how happy\nhas all this made me!\"\n\n\"Come, don't hurry her spirits with your raptures,\" said Lady Juliana.\n\"She is a good girl, and we shall be very happy together, I dare say.\nBut I find, Sir, you have been waiting for me, of all people, to\nchaperon your Lady about to all the fine places: I have had enough of\nthem, and at my time of life I do not know any business I have at\noperas, balls, and plays: however, to oblige you and _my niece_, I will\ngo wherever you wish me. I do not think she is one who will tire me to\ndeath: I shall dine with you to-day, and if you choose to let one of\nyour people go to Drury-lane, and inquire if there are places, we may\nhear the oratorio to-night.\"\n\nCharmed with this speech, for St. Aubyn knew his aunt well enough to be\nsure if she had not been thoroughly pleased with Ellen, she would\nneither have called her niece, nor have staid to dine with them, he most\nreadily accepted the kind offer.\n\nThey dined rather earlier than usual, that they might be in time for the\nopening of the oratorio, which Ellen was anxious to hear. Laura Cecil,\nin compliment to Lady Juliana, dined with them, and was quite delighted\nto see the affection, and even respect, with which she treated Lady St.\nAubyn: for Lady Juliana was not a person to do things by halves; and\nhaving once conquered her own prejudices, was determined to give her\nniece all the consequence in her power with every other person, and\nwould have been extremely angry with any one, who had dared to treat her\nwith half the contempt she herself had done the day before. Once a\nfriend, she was a friend for life, unless the object of her affections\nproved really undeserving, and then she hated with as much warmth as she\nhad loved.\n\nMiss Cecil could not be persuaded to go with them to the theatre; and\nindeed Ellen was afterwards glad of it, for many of the songs were those\nwhich the sainted Juliet used to sing with so much sweetness and\nexpression: and exquisitely as they were now performed, yet Ellen still\nfelt something wanting. The soul that used to animate the eyes of\nJuliet, while she sung, was not there. The lips that had breathed those\nsacred strains, were so pure, so hallowed, that all the wonders of voice\nand science, now lavished for her entertainment, could not compensate to\nEllen's mind for the pang she felt in recollecting that those eyes,\nthose lips, were closed for ever.\n\n    \"Mute was the music of her tuneful breath,\n  And quenched the radiance of her sparkling eyes.\"\n\nAfter this evening, Ellen's engagements became more frequent; but she\nwas never seen in public, except with Lady Juliana, and seldom without\nher Lord. In vain did fashion dictate, or ridicule assail: the sly\nglance, the pointed sarcasm, alike were vain: she knew herself safe, her\nreputation secure, with protectors so respectable; yet there was nothing\nobtrusive or formal in St. Aubyn's attention to his lovely wife: he was\nneither inseparable from her side, or incapable of attention to any\nother lady, or expecting Ellen never to speak to any other gentleman.\nBut it was obvious, without being intrusive, that each was the first\nobject of the other, and that their mutual honour and happiness were the\nmost interesting care of both.\n\nHence no bold and disgusting flattery assailed the ears of Ellen; no\nforward flirting woman dared dispute with her the heart of St. Aubyn; so\npure, so spotless was her character, that, raised as she had suddenly\nbeen to a rank which might easily excite the envy of those who thought\nthey had a better claim to it, not even the bold license of the age we\nlive in had dared to breathe one syllable against her.\n\nThus passed the time till the latter end of April, which was the period\nfixed for Lady Meredith's famous fete, about which all the great world\nwas going mad. The persons who were invited were expected to wear\nmasquerade dresses, and the house appeared in masquerade, as well as\nthe company. The whole had been new furnished in a fanciful style, and\nat an enormous expence, for this one evening; and her Ladyship's own\ndress was literally covered with jewels: she wore the habits and\nornaments of an eastern beauty, and her attire was exactly copied from\nthat Lady M. W. Montague describes for the fair Fatima, only, if\npossible, still more rich and splendid; and, if possible, still more\ncalculated to display as well as to adorn the figure. No words can do\njustice to the magnificence and splendour of the whole entertainment:\nthe Bow-street officers at the door, and Mr. G---- and his men serving\nices and other refreshments in a room fitted up to represent a casino at\nNaples, with a panorama view of its beautiful bay, &c. gave it all the\ncharacteristics of a modern fete; and the number of gay dresses, shining\ndecorations, lights, and music, made the whole appear to Ellen more like\na palace in a fairy tale than any thing \"which the earth owns.\" She\nwore a black domino, but with a very fine set of diamonds, which Lady\nJuliana had given her the night before: amongst them was a sort of\ncoronet, or chaplet, set to represent sprigs of jessamine and small vine\nleaves, in commemoration of that which St. Aubyn had woven of those\nsimple materials the day he discovered to her his real rank; for Lady\nJuliana had heard the whole story, and was much pleased with that little\nincident.\n\nTheir party consisted of Lord and Lady St. Aubyn, Lady Juliana, and Sir\nEdward Leicester, a particular friend of St. Aubyn's, a very amiable\nyoung man, who appeared much charmed with Laura Cecil, and paid her\ngreat attention, whenever he had an opportunity of being with her. They\nspent a very agreeable evening: it concluded with a splendid supper, at\nwhich all the company appeared unmasked, and the super-eminence of Lady\nSt. Aubyn's beauty was allowed by all.\n\nA few nights after this, Lord and Lady St. Aubyn, Lady Juliana, Lady\nMeredith, and her favourite beau, Colonel Lenox, went to the Opera: the\nentertainment for the evening happened to be the beautiful opera of\nArtaserse. Ellen, lost in delight at the superb stage decorations, the\nexquisite beauty of the music, and the interest of the story, which, by\nthe help of the action, and having read it in English, she understood\nvery well, was scarcely sensible of any thing around her, till the scene\nin which Arbace is accused of the murder of the king. Turning then to\nspeak to St. Aubyn, who sat behind her, she saw him pale, agitated, and\ntrembling: \"What is the matter?\" asked she, in a voice of alarm; but\npressing his hand on her arm, he said, in a low voice, \"Be silent--do\nnot notice me.\"\n\nAt that moment the voice of the singer, who performed Arbace, in the\nmost pathetic tone, breathed out, \"Sono Innocente,\" to which Artaserse\nreplies:\n\n  Ma l'apparenza O Arbace\n  T'accusa ti condanna!\n\nA stifled sigh, almost amounting to a groan, from St. Aubyn, met the ear\nof Ellen. Recovering himself a little, he whispered--\"Remember, Ellen,\n_and I too am innocent_!\"\n\nIn spite of the precaution with which he spoke, Lady Meredith turned,\nand asked him if he were unwell.\n\n\"I have a violent head-ache,\" he replied, forcing himself to appear more\ncomposed.\n\n\"You look pale, indeed, my Lord,\" returned Lady Meredith: \"and Lady St.\nAubyn seems quite overcome with this pathetic scene.\"\n\nShe spoke of the opera, but a crimson flush spread over St. Aubyn's\nface, and complaining of the intolerable heat, he rose, and went out of\nthe box.\n\n\"Bless me!\" said Lady Juliana: \"what is the matter?\"\n\n\"Only Lord St. Aubyn complains of the head-ache,\" said Lady Meredith.\n\n\"Oh, I know what it is,\" answered Lady Juliana: \"my nephew hates to be\ndisturbed when he is attending to music; and I suppose you, Lady\nMeredith, have been talking to him, as you always do at the Opera.\"\n\nLady Meredith only laughed; and St. Aubyn returning soon after, nothing\nmore passed. When the opera was over, and St. Aubyn and Ellen were alone\nin the carriage, he still appeared so restless and agitated, that Ellen\ncould not resist addressing to him a few words, indicative of curiosity,\nif not of alarm. For a time he evaded her tender inquiries; but, at\nlength, grasping her hands with an action expressive of the utmost\nemotion, he again repeated his former words: \"Remember, Ellen, oh,\nremember that I too am innocent!\"\n\n\"I know it, I am sure of it,\" she returned: \"but why thus confide by\nhalves? Why torture yourself and me by these mysterious hints?\"\n\n\"Ah, why indeed!\" said he: \"I ought to have more command of myself: but\nthat scene--that fatal instrument of a horrid deed!--Appearances how\nfalse, yet how convincing!\"\n\n\"To me,\" she replied, \"appearances are not and never shall be any thing,\nwhen opposed to your single assertion, to my confidence in your\nintegrity.\"\n\n\"A thousand thousand thanks,\" he replied, \"for the sweet assurance!\nSoon, too soon, perhaps, you will be tried!\"\n\n\"Demanding so much reliance, so much implicit _confidence_ from his\nwife, under such _mysterious_ conduct, was St. Aubyn willing, if called\nupon, to grant an equal share to her?\"\n\n\n\n\nCHAP. VII.\n\n  Think'st thou I'll make a life of jealousy,\n  To follow still the changes of the moon\n  With fresh surmises?--No; to be once in doubt\n  Is to be resolv'd----\n    I'll see before I doubt; what I doubt prove.\n\n                                                        OTHELLO.\n\n\nAfter the scene at the Opera, which effectually destroyed her pleasure\nthere, Lady St. Aubyn felt for some days not at all disposed to enter\ninto the gay parties which were offered for her amusement: a gloom hung\nover her, and she had a weight on her spirits, which in some degree\naffected her health. Some one says, \"A belief in _presentiment_ is the\nfavourite superstition of feeling minds;\" and Ellen was certainly not\nentirely free from it. Lady Juliana and Miss Cecil perceived the effect\nwithout knowing the cause; and supposing it to be merely a temporary\nindisposition, persuaded her to remain quietly at home for a day or two;\nbut finding the nervous sort of depression under which she laboured was\nencreased by indulgence, they imagined a moderate share of amusement\nmight remove it; and prevailed on her to take places at Covent-Garden,\nto see Mrs. Jordan in a favourite comedy.\n\nLaura did not yet shew herself in public; Ellen therefore went to the\nplay with only St. Aubyn and Lady Juliana. They were joined there by two\nor three gentlemen, and amongst them Sir Edward Leicester, who, between\nthe acts, made so many inquiries for Miss Cecil, and spoke so highly of\nLady St. Aubyn's \"charming friend,\" as convinced her he took a deep\ninterest in all that concerned Laura. This gave real pleasure to Ellen,\nwho thought so well of Sir Edward, as to wish he might succeed in\nrendering the prepossession mutual. They were all extremely well pleased\nwith the play. Who, indeed, that ever saw Mrs. Jordan act was\notherwise? And Lady Juliana was rejoiced to see Ellen quite as cheerful\nas usual. They did not choose to stay the farce, and finding at the end\nof the play the carriage was in waiting, left the box. Lady Juliana\nbeing rather timid, and not very alert in getting into a carriage, St.\nAubyn gave her his arm, and requested Sir Edward would take care of Lady\nSt. Aubyn.\n\nAs they were crossing the lobby, a gentleman accidentally trod on\nEllen's train, and entangled it in his spur, by which she was detained\nhalf a minute before it could be disengaged. He begged her pardon, and\npassed on. St. Aubyn and his aunt not perceiving the circumstance, had\nadvanced some steps before the Countess and Sir Edward. At that moment\ntwo or three young men pushed rather rudely by them; and Sir Edward\nextending his hand, said, \"Take care, gentlemen, you incommode the\nlady.\"\n\nOne of them turned round, and looking in Ellen's face, exclaimed:\n\n\"By heaven 'tis she! 'tis Ellen Powis!\"\n\nLady St. Aubyn starting at the name, cast her eyes upon him, and\ninstantly recognized Charles Ross: but before she could speak to him, as\nshe was preparing to do in a friendly manner, he stamped violently, and\nwith a countenance where the utmost rage was expressed, and a dreadful\noath, exclaimed:\n\n\"Is this the villain that has undone thee?--But where, then, is that\naccursed Mordaunt? Ah, Ellen! abandoned, miserable girl, art thou, then,\nso lost already?\"\n\nPale, gasping for breath at this shocking language, Ellen clung more\nclosely to the arm of Sir Edward, and faintly articulated, \"For God's\nsake let me pass!\"\n\n\"What do you mean, Sir?\" said Sir Edward, fiercely: \"Are you\nintoxicated, or mad? How dare you insult this lady!\"\n\n\"And how dare you, Sir,\" answered Charles, approaching in a menacing\nattitude, \"after seducing her from her friends, and from those who loved\nher, to look me in the face?\"\n\n\"Madman!\" replied Sir Edward, pushing him aside with one hand, while\nwith the other he supported the now almost fainting Ellen. \"Gentlemen, I\nrequest you will secure him till I place this lady in her carriage, and\nthen I am ready to give him any explanation he may wish for.\"\n\nSome of the gentlemen, who by this time surrounded them, knowing\nCharles, said to him: \"Come away, Ross; you are very wrong: at any rate,\nthis quarrel shall go no farther.\"\n\nAt this moment St. Aubyn, having placed his aunt in the carriage,\nwondering at Ellen's delay, returned to seek her; and astonished at\nwhat he beheld, exclaimed:\n\n\"For heaven's sake, what is the matter? My love, what makes you look so\npale? Has any one dared to insult you?\"\n\n\"Oh! you are there, Sir, are you,\" said Charles: \"I know you: I saw you\nonce, and then foretold what has happened: you are the man who must give\nme satisfaction.\"\n\n\"Pshaw! he is mad, quite mad,\" cried Sir Edward; \"pay no attention to\nhim; he knows not what he talks of.\"\n\nThe by-standers began to be of the same opinion; and, indeed, his\nrageful countenance, and the violence of his gesticulations, with the\napparent inconsistency of his words, rendered the idea extremely\nprobable; they therefore forcibly held him, and said: \"Pass on,\ngentlemen, and take care of the lady: we will prevent him from following\nyou;\" while Ross's friends, supposing either that the wine they knew he\nhad drank had affected him, or that some sudden frenzy had seized him,\nwere amongst the foremost to secure him, especially as a gentleman who\nnow came up said the gentleman and lady were the Earl and Countess of\nSt. Aubyn: but Charles was too outrageous to hear that or any thing\nelse, and called after them aloud, stamping with fury, and swearing\nterribly:\n\n\"Mean, detestable cowards, come back. I am not mad. Give up that\nwretched girl: let me take her to her father--to mine, who loved her.\nMordaunt, vile, hateful Mordaunt! to you I call--Come back, I say!\"\n\nSt. Aubyn turned, and but that Ellen hung half-fainting on him, he would\nhave obeyed the summons; for he knew that name was addressed to him, and\neasily guessed who the supposed madman was, and how the mistake which\ncaused his insults might have arisen; but Sir Edward said, \"You shall\nnot go back, St. Aubyn, he is mad; or if not, it belongs to me to\nchastise him.\"\n\n\"Is it not Charles Ross?\" said St. Aubyn to Ellen.\n\n\"Yes,\" she faintly replied; \"but do not go back; he is certainly out of\nhis senses.\"\n\nBy this time they had reached the carriage, and putting her into it, he\nshut the door; and saying, \"Wait a moment, be not alarmed, I must speak\nto him,\" he ran back again, Sir Edward following.\n\nRoss having, as soon as they were out of sight, disengaged himself from\nthe by-standers, was hastening with frantic violence to overtake them:\nwhen he saw the two gentlemen, he advanced and said:\n\n\"You have thought proper, then, to come back; but what have you done\nwith that unfortunate girl?\"\n\n\"For the sake of your father, Mr. Ross,\" said St. Aubyn, \"for now I\nknow you, I will be patient and tell you.\"\n\n\"What can you tell me more than I already know?\" cried Ross,\ninterrupting him with angry vehemence. \"Can you deny that you have\nseduced her whom I loved better than my own soul? Did you not bring her\nwith you to London? I know it all, Sir: the woman where you lodged found\nyou out. She saw how you had deceived my gentle, innocent Ellen.\"\n\n\"What words are these!\" exclaimed St. Aubyn, haughtily. \"Whence arises\nso vile an error?\"\n\n\"Villain!\" exclaimed Charles, with wild impetuosity, \"deny not your\ncrimes, but give me the satisfaction of a gentleman.\"\n\n\"You do not act like one,\" said St. Aubyn: \"but here is my card; I am\nalways to be found, and will give you whatever satisfaction you may\nrequire.\"\n\nHe threw a card with his address to Charles, who hastily gave St. Aubyn\none of his.\n\n\"It shall not be,\" said Sir Edward. \"I was the first insulted: this\naffair is mine.\"\n\n\"Settle it as you please,\" said Charles: \"come one or both, I am ready.\"\n\n\"Very well,\" said St. Aubyn; \"to-morrow we shall be at your service.\nCome, Sir Edward; Ellen will be terrified to death.\" They hastened on;\nand Ross rudely pushing aside those around him, left the theatre.\n\nSt. Aubyn and Sir Edward now went as quickly as possible, where they\nfound the Countess, half-fainting, in the arms of Lady Juliana.\n\n\"For God's sake,\" said the latter, as they opened the door, \"what is the\nmatter? What have you been doing? Could you find no time or place to\nquarrel in but in the presence of this poor girl?\"\n\n\"For heaven's sake, Madam,\" said St. Aubyn, after having ordered the\nservants to drive on, \"do not talk in that manner. Am I so regardless\nof this dear creature's comfort, or so prone to quarrel, that I should\nseek it at such a time as this?\"\n\nHe then made Ellen lean on him, and soothed her with the most\naffectionate and tender expressions.\n\n\"Oh,\" said she, reviving; \"is he gone? Dear St. Aubyn, tell me, are you\nsafe, has he hurt you?\"\n\n\"No--no, my love; be composed, all is over; he is gone away satisfied.\"\n\n\"Satisfied!\" replied she; \"what could he mean? Do you think he is mad,\nor is it the effect of wine, or some mistake?\"\n\n\"I know not,\" said St. Aubyn, hastily; \"but be at rest--he is gone--we\nshall hear no more of him.\"\n\n\"Oh, are you sure--are you quite sure? Dear Lady Juliana, tell me: may I\ndepend upon it? You said something about a duel.\"\n\n\"I talked like a fool, then, if I did,\" replied Lady Juliana; \"but I do\nnot remember any thing of it.\"\n\n\"A duel--ridiculous!\" said St. Aubyn, pretending to laugh. \"I assure\nyou, Ellen, all is over; pray be composed; there is nothing to fear.\"\n\nLady Juliana knew better, but terrified for Ellen, she affected to\nbelieve what St. Aubyn said, and between them, they contrived completely\nto deceive the Countess, who, ignorant of the usages of the world, and\nnot knowing all that had passed, was easily misled. She composed her\nmind, therefore, in the hope that all was well, though she still\ntrembled, and was so much fluttered, that Lady Juliana, after going home\nwith her, waited till she had seen her in bed; and desiring she might be\nkept perfectly quiet, she returned to the drawing-room, and endeavoured\nto learn from St. Aubyn and Leicester what had happened, and what was\nlikely to be the result: but she vainly chid or interrogated either:\nboth persisted in the story that Ross had apologized, and all was over.\n\nRather better satisfied, though not fully convinced, Lady Juliana soon\nafter left them, determined however to keep a little watch upon the\nactions of her nephew, with whose temper she was too well acquainted to\nsuppose such a business would be passed over without farther notice.\n\nSt. Aubyn gave Ellen such assurances that nothing more would arise from\nthis affair, that, tired out with the agitation she had undergone, she\nsoon fell into a profound sleep, and awakened in the morning perfectly\nrefreshed and composed. At St. Aubyn's request, however, she remained\nlater than usual in bed. Laura Cecil sat by her side, and gave her her\nbreakfast, after which she appeared so entirely well, that no objection\nwas made to her rising.\n\nIn the meantime St. Aubyn had received, at his breakfast-table, the\nfollowing note:--\n\n     My Lord,\n\n     I find by the card you gave me last night, that the name of\n     _Mordaunt_ was only assumed to conceal the blackest designs and\n     most detestable perfidy.\n\n     If you do not mean to plead your privilege, I demand a meeting\n     with you on Wimbolton Common to-morrow morning at seven\n     o'clock, when I hope to wash out my wrongs, and those of the\n     injured Ellen, in the blood of a villain.\n\n     I shall bring pistols and a friend.\n\n                                                   CHARLES ROSS.\n\n     _Eight o'Clock, Wednesday morning._\n\nTo this St. Aubyn returned the following answer:--\n\n     Sir,\n\n     I shall be at the place appointed at the time you mention. Sir\n     Edward Leicester will be with me.\n\n                                                      ST. AUBYN.\n\nAfter dispatching this laconic reply, the Earl went to Ellen's\ndressing-room. Laura had just left her; Jane only was with her: at the\nmoment he entered, Ellen was reading a note, which, when she saw him,\nshe hastily folded together, and put within the bosom of her morning\ndress: she seemed a little agitated, and the tears stood in her eyes,\nbut hastening to meet him, she said:--\n\n\"My dear St. Aubyn, they told me you were gone out.\"\n\n\"No, my love,\" said St. Aubyn, a little surprized at the hasty manner in\nwhich she spoke; \"but I am going out soon.\"\n\n\"Shall you take the barouche or the chariot?\"\n\n\"Neither; I shall walk to Sir Edward Leicester's: but why; are _you_\ngoing out?\"\n\n\"Yes--by and bye; I think a little air will do me good.\"\n\n\"Had you not better keep quiet? You know my aunt particularly requested\nyou would do so; she will be here soon: do not go till you have seen\nher, nor then unless she advises it.\"\n\n\"But I assure you, my Lord, I am perfectly well, and I am sure a little\nair will be of service.\"\n\n\"Well, do as you please,\" said St. Aubyn, a little surprized at her\nadhering so determinately to her idea of going out; for, in general,\nhalf a word from him guided her; \"but you will not go alone?\"\n\n\"Oh--no, Laura will go with me.\"\n\n\"Very well, my love; don't fatigue yourself. Where are you going?\"\n\n\"I don't know exactly: I want to do some shopping.\"\n\nSt. Aubyn then wished her good-morning, and repeating his request that\nshe would take care of herself, left her.\n\nThe real fact was this--Jane, who was Ellen's almoner, and brought to\nher knowledge many cases of distress, of which she would otherwise have\nbeen ignorant, had the night before, while her lady was at the play,\nreceived a petition from an officer's widow, who stated herself to be\nliving in a small lodging in ---- Street; that she had several children,\nof whom the youngest was an infant not a month old, born under\ncircumstances of the most acute distress, a few months after its father\nhad fallen in the field of battle; the eldest, a girl of sixteen, in a\ndeep decline: these circumstances, she said, prevented her from waiting\nherself on Lady St. Aubyn, of whose goodness she had heard much from an\nold blind lady, her neighbour, whom, in fact, Ellen had supported for\nsome time past, and whom she had visited two or three times with Jane\nonly.\n\nEllen, warm-hearted and benevolent, was extremely anxious to see this\nunfortunate family: Jane had given her the letter just before St. Aubyn\ncame into her room, and fearing if she declared her purpose he would\noppose it, lest her health should be injured by the emotion she must\nnecessarily feel from the sight of this unhappy mother and her children,\nshe concealed the letter, and did not exactly tell him why she wished so\nmuch to go out, though aware that she must appear unusually\npertinacious; but she had set her heart with all the fervor of youth on\nher object: above all, she desired to see the poor little infant, for\nEllen, always fond of children, had, since she knew herself likely to\nbecome a mother, felt a peculiar interest in young children, and\nardently wished to see and provide for one who had so many claims to\nthe compassion of a tender heart; and having really some purchases to\nmake, she gave without consideration _that_ as her only motive for going\nout. Never before had she departed for an instant from the singular\nsincerity of her character, and the perfect confidence which she reposed\nin her husband; dearly did she soon repent of having done so now.\n\nOn asking Laura to go with her, she unexpectedly declined it, having a\nbad head-ache, and tried to persuade Ellen not to go herself, but to\nsend Jane, and go some other time: but Ellen was so unusually fixed on\nher point, and her imagination was so impressed with the idea of the\n_poor little infant_, that, for a wonder, she was not to be prevailed\non; and fearing, lest Lady Juliana should come and prevent her, she\nordered the carriage directly, and set out.\n\nShe drove first to ---- Street, where she found the distrest family in\nall the poverty and affliction which had been described to her--the\nunfortunate mother, still weak, and scarcely able to support herself,\nobliged to act as nurse, not only to the infant, but to her eldest\ndaughter, who, pale and languishing, seemed ready every moment to\nbreathe her last, while two or three other children were playing in the\nroom, distracting by their unconscious noise the poor invalids.\n\nThe tender and compassionate Ellen felt her heart opprest at this\nmelancholy sight, and hastened as much as possible to relieve it: she\nheld herself the baby in her arms, while she sent Jane to seek a nurse\nfor the poor girl, and to the woman of the house where they lodged, to\nwhom she spoke herself; and requested she would take charge of the other\nchildren, till the mother was more able to do so. She gave the widow an\nample supply of money to procure every thing necessary for her herself\nand family, and after promising to send a physician to attend the poor\ngirl, and kissing the baby, she departed, followed by thanks and\nblessings, \"not loud but deep,\" and went to see the poor old blind lady,\nwho, always delighted to hear her sweet voice and kind expressions,\ndetained her as long as she could.\n\nReturning home, rejoicing in the good she had done, feeling herself\nanimated by the purest pleasure, and quite well in health, Ellen\nsuddenly recollected that she was close by the street where Mrs. Birtley\nlived, with whom she had lodged the first time she was in London; and\nshe thought she would just stop at the door, and ask for the book she\nhad left there, for which Jane had, as she said, always forgotten to\ncall: it was that very volume of Gray which Mordaunt had given her, and\nas his first gift she was really anxious to recover it. Meaning merely\nto stop at the door, and send Jane in for it, she pulled the check, and\nordered the coachman to drive down that street, and stop at No. 6, and\ntold Jane for what purpose she was going.\n\n\"Oh, my Lady,\" said the talkative girl, \"I shall be rejoiced that Mrs.\nBirtley should see you in all your grandeur: she will be surprized after\nall she had the impertinence to say.\"\n\n\"Indeed,\" said Ellen, \"I never thought of that: she will wonder to see\nme under such a different appearance, and perhaps say something in the\nhearing of the servants. I will not go.\"\n\n\"Oh, my Lady,\" answered Jane, \"she need not know who you are: only ask\nfor the book, and come away directly: she will not know a bit the more\nwhat your Ladyship's real name is; and I suppose she is not enough\namongst the grand people to know the livery or carriage.\"\n\n\"True,\" said Ellen: \"well, you shall go in and ask for the book, but do\nnot explain any thing to her.\"\n\n\"Oh, no, indeed, my Lady,\" said Jane; \"so far from it, I shall enjoy\nseeing her puzzle----\"\n\nWhile they spoke, the carriage stopped at the door of Mrs. Birtley.\nEllen, who half repented having come, sat back in the carriage, and told\nJane to go in and ask for the book, and not to say she was there, for\nshe would not alight: but notwithstanding Ellen's caution, Mrs. Birtley,\nhaving been drawn to the window by seeing such an elegant equipage stop\nat her door, caught a glimpse of her as the footman opened the door of\nthe chariot for Jane to alight, came to the side of the carriage, and\nwith civility asked her if she would not walk in. Ellen, feeling more\nand more the absurdity of which she had been guilty in coming to the\ndoor of a woman who she knew entertained of her a doubtful opinion, and\nto whom she could not explain herself, coldly declined the offer; but\nthe coachman said he feared the horses would not turn very well, as the\nstreet was rather narrow, and that it would be better if her Ladyship\npleased to alight for a moment, lest she should be alarmed.\n\nMrs. Birtley stared at the \"_Ladyship_\" as much as she had done at the\n_coronetted carriage_ and fine horses; for she was not quite so ignorant\nof _grand people_, as Jane, in the plenitude of her own newly-acquired\nknowledge, had supposed her.\n\nEllen, vexed at her own folly in coming thither, was now obliged to get\nout of the carriage; and several people passing by, staring first at the\ncarriage, and then at Ellen, she thought it would be better to go for an\ninstant into the house. Mrs. Birtley shewed her into the parlour, and\nrequesting she would be seated, added, \"My lodger is gone out, and will\nnot, I suppose, be back till dinner-time: he is generally out all the\nmorning. I believe he knows something of you, Ma'am.\"\n\n\"Of me!\" repeated Ellen, surprized.\n\n\"Yes, Ma'am: for when he came here about a week ago, he saw, by\naccident, that book Mrs. Jane has in her hand; and some writing there\nwas in it seemed to put him into a great passion. He made me tell him\nhow I came by the book, and asked me a thousand questions about you:\nwhat was the name of the gentleman you came with, if you were young and\nhandsome, and I don't know what; and I believe what I told him put him\ninto a great rage, for he stampt and swore like a madman.\"\n\nEllen, vexed and astonished, sorry she had come there, and feeling a\ncertain dread of she hardly knew what stealing over her, now turned\nextremely pale; and Jane exclaimed, \"Oh, my Lady will faint: get some\nwater!\"\n\n\"Your _Lady_! Why she is Mrs. Mordaunt, is not she, _or calls herself\nso_?\" asked Mrs. Birtley with some contempt.\n\n\"Don't stand there asking questions,\" said the impatient Jane: \"but\nfetch some water. Lord, I wish we were at home: if my Lady should be\nill, how Lady Juliana will scold, and my Lord.\"\n\n\"Grant me patience,\" said Mrs. Birtley, as she left the room to fetch\nsome drops and water: \"the girl makes me mad with her Lords and Ladies.\nPoor fool, I suppose they have imposed upon her too finely.\"\n\nNot one minute had she been gone, when Ellen finding herself better, and\nnot meaning to wait Mrs. Birtley's return, and farther questions, had\nrisen, and by Jane's help almost reached the door to go to the carriage,\nwhich through the window she saw drawing up, when that door opened, and\nCharles Ross entered the room: amazed beyond the power of words to\ndescribe, he saw her standing--saw Ellen in his apartment! And\nforgetting every thing but that he had once dearly loved her, he rushed\ntowards, and would have caught her in his arms, but she evaded his\ngrasp; and catching hold of Jane (who, frightened, gave a sudden\nscream), said, \"He here! Oh, how I am terrified!\"\n\n\"Terrified, Ellen!\" he wildly repeated: \"_once_ you were not terrified\nby my appearance.\"\n\n\"No, Sir,\" she replied, with as much spirit as she could assume: \"for\nonce I should have expected friendship and protection, not insult.\"\n\n\"Ah, wretched girl!\" he exclaimed: \"once you deserved and wished for my\nfriendship and protection; but now, that fine gaudy carriage, this\nelegant dress, the jewels, in which I saw you last night, all tell a\ndreadful tale--all speak of your shame, of your ruin.\"\n\n\"Of my shame! of my ruin! what, oh, what do you mean?\"\n\n\"Aye, what indeed!\" said the enraged Jane: \"let my Lady pass,\nimpertinent fellow, and don't stand there talking in that insolent\nmanner. Do, my Lady, let me call the footmen. I wish my Lord was here:\nhe would soon teach you better manners.\"\n\n\"Cease, Jane,\" said Ellen, shaking like a leaf: \"cease this shocking\naltercation. Of your insulting language, Mr. Ross, I know not the\nmeaning: it is well for you Lord St. Aubyn does not hear you thus\naddress his wife.\"\n\n\"His wife! his wife! Is it possible? Have I wronged both him and you?\nStay, Ellen, a moment, for heaven's sake--for St. Aubyn's--for my\nfather's: you know not the mischief one word of explanation may\nprevent.\"\n\nShe stopped, she turned: he seized her hands to detain her. Oh,\nunfortunate Ellen!\n\nAt that moment St. Aubyn himself entered the room. He rushed impetuously\nforward, exclaiming, \"Dissembling woman! Was it for this you left your\nhome--to meet this villain--to come to his very lodging in search of\nhim?\"\n\n\"Oh, no! oh, no!\" sobbed Ellen, as she sunk at his feet in a swoon so\ndeep, so death-like, that it seemed as if her life had left her.\n\n\"Oh, you have killed my Lady!\" cried Jane: \"my dear Lady! Oh, my Lord,\nwe came here for a book, and not----\"\n\n\"Peace, peace!\" sternly interrupted St. Aubyn: \"I will not hear a word.\nIs she dead?\"\n\n\"Oh, Lord, I hope not! How can your Lordship talk so shockingly? Oh,\nMrs. Birtley, for God's sake help my Lady--call assistance!\"\n\nBetween them they raised her: for Charles, confounded, shocked, and half\ndistracted, dared not, and St. Aubyn, gloomy, cold, and stern, would not\nassist her. At length returning life mantled on her cheek, and her first\nincoherent words were, \"St. Aubyn, dear St. Aubyn, save me!\"\n\nSt. Aubyn, somewhat calmer, and fearing he might have been too rash,\nstruggled with the jealous pangs which rent his heart, and approaching\nher, said, \"How is it, Ellen--are you better?\"\n\n\"Yes, better, my love; but sick, oh, sick at heart!\"\n\n\"Compose yourself; all is well.\"\n\nA little revived, she looked up, but was too languid to discern the\nexpression of his countenance, which contradicted the kindness of his\nwords; for St. Aubyn felt there was much, very much to be explained,\nbefore she could be to him again the Ellen she had been--if, indeed, the\nperfect confidence he once felt in her could ever be restored; yet\nfearing quite to destroy her, he constrained himself. Mrs. Birtley, now\nconvinced how unjust had been her suspicions, and Jane, eagerly\nendeavoured to explain how Lady St. Aubyn came to be there; but\nmotioning with an air of proud dignity to them to be silent, he said,\n\"Enough, I am satisfied!\" But his gloomy looks contradicted his words,\nand turning to Ross, he said, in a low voice, \"You and I, Sir, shall\nmeet again.\" Then, with Jane's assistance, he raised Ellen, and lifting\nher into the carriage, and putting Jane in, followed himself.\n\n\"Home!\" fiercely exclaimed St. Aubyn, and home they went; but oh, to a\nhome how different from that of the day before!\n\n\n\n\nCHAP. VIII.\n\n  \"Good friend, go to him; for by this light of Heaven\n  I know not how I lost him. Here I kneel:--\n  If e'er my will did trespass 'gainst his love,\n  Either in discourse or thought, or actual deed;\n  Or that mine eyes, mine ears, or any sense,\n  Delighted them in any other form--\n  Comfort, forswear me!--unkindness may do much;\n  And his unkindness may defeat my life,\n  But never taint my love.\"\n\n                                                        OTHELLO.\n\n\nSilent and gloomy was the ride homewards. St. Aubyn, bridling with\ndifficulty the jealous rage which consumed him, sat leaning against one\nside of the carriage, veiling his eyes with his hand, that they might\nnot for an instant fall on Ellen, who, hardly supporting herself with\nJane's help, shed no tears, though grief and vexation heaved her bosom\nwith sighs, which almost burst it; for now her recollection was\nrestored, the dreadful words in which St. Aubyn first addressed her rung\nin her ears, and swelled her heart with anguish.\n\nAt length they reached Cavendish-Square, and were met in the hall by\nLady Juliana, whose pride, at first, wounded by Ellen's being from home\nwhen she arrived, had, at length, given way to feelings of alarm at her\nlong absence; but when she saw her lifted from the carriage, pale,\ntrembling, and half-dead, terrified and astonished, she vainly demanded\nan explanation alternately from St. Aubyn and the frightened Jane; her\nnephew passing her hastily, and in silence, went into his study, and\ninstantly shut and fastened the door. There he meant to consider with\nhimself what part it became him to take, and how to elucidate this\nextraordinary event.\n\nEllen, throwing herself into Lady Juliana's arms, exclaimed, \"Oh! my\ndearest madam, let me die at once, for my Lord is angry with me!\"\n\n\"Die!\" cried Lady Juliana, struggling with a thousand terrors;\n\"Nonsense! for what? Do you suppose no man was ever angry with his wife\nbefore? You are so unused to it, it seems strange to you, but you may\nassure yourself few wives would think it so extraordinary.\"\n\nBy this time they had reached Ellen's dressing-room, where, having\nplaced her on a sofa, and given her some restoratives, Lady Juliana\nsaid, \"But what is all this about--what offence have you committed?\"\n\n\"Oh! madam, I know not; but it is too true, St. Aubyn has said such\nwords to me, such words as I never thought to hear from him!\"\n\n\"What is the meaning of all this?\" said Lady Juliana, turning to Jane.\n\"Speak, girl, if you have not quite lost your senses, or do not wish\nthat I should lose mine, and tell me where your lady has been, and what\nhas happened.\"\n\nJane, now, as well as the confusion she was in would let her, repeated\nthe adventures of the morning to Lady Juliana, the visit to the\nofficer's widow, and the old blind lady; and lastly, why they went to\nMrs. Birtley's: \"And it was I,\" she said, \"that persuaded her Ladyship\nto go to that disagreeable Mrs. Birtley's--out of pride, I own it--it\nwas out of pride, that she might see what a grand place I had got, and\nthat _my_ lady was not the sort of person that cross old woman fancied\nshe was; and her Ladyship would not even have alighted or gone into her\ntrumpery parlour, if the horses had not been so frightful, and the\ncoachman said, says he, \"my Lady had better alight, for the horses--\"\n\n\"Grant me patience!\" said Lady Juliana: \"this girl's tongue is enough to\ndistract me! Well, and when you were in her trumpery parlour, as you\ncall it, what happened then? Was Lord St. Aubyn angry that you went\nthere?\"\n\n\"Oh! no, my Lady, not for that; but the instant after we went in, and\nwhile Mrs. Birtley was chattering about the book, and about her lodger\n(and to be sure there never was such another chattering woman in the\nworld, and looking at my lady from head to foot, so saucy-like, I was\nquite in a passion with her), I saw my lady turn pale, and thinking she\nwas going to faint, I made Mrs. Birtley go for some water, for I knew\nwell enough how your Ladyship would scold if _my_ Lady was to be ill,\nand so I told Mrs. Birtley.\"\n\n\"Will this tale ever have an end?\" cried the impatient Lady Juliana.\n\n\"Well, my Lady, and so just as Mrs. Birtley was gone for the water, and\nwe were got up to go away, in came a young man: I believe, for my part,\nhe was quite mad, not indeed that I am any particular judge of mad\npeople, for I remember the first day your Ladyship came here I\nthought--but I believe I had better not tell _that_;--however, this\nyoung man _was_ mad for certain, for the moment he saw my Lady, he ran\nto her, and seemed as if he was going to catch her in his arms. I\nscreamed, and when her Ladyship said she was terrified, he quite raved,\nand called her names, and said something about her shame, and her being\nruined, and her jewels, last night, and I don't know what.\"\n\n\"And who, for Heaven's sake, was this man?\" asked the astonished Lady\nJuliana.\n\n\"Oh, it was Ross! Charles Ross!\" sobbed Ellen; \"and St. Aubyn came in\nwhile he was speaking to me, and said I came there to meet him, to his\nvery lodgings; and then I fainted quite away.\"\n\n\"So, so, so!\" repeated Lady Juliana; \"a pretty piece of work! I see what\nthis mistake will end in! But stay; surely it is not too late: I will go\nto St. Aubyn.\"\n\n\"Yes, go to him, Madam, for Heaven's sake go to him, and explain it to\nhim. Assure him I could not have an idea that Charles Ross lodged at\nMrs. Birtley's. Oh! how cruel to be obliged to make this explanation:\ncan St. Aubyn really think so ill of me? Yet, surely, surely he will be\nundeceived--this is only a momentary start of passion!\"\n\nLady Juliana shook her head, for she knew St. Aubyn's temper; and how\nhardly he would endure to hear even her on such a subject; yet, if he\nwould but condescend to hear what the servants, who attended the\nCountess in this unfortunate excursion, what this Mrs. Birtley would\nsay, their stories would doubtless confirm that of Ellen; for of the\ntruth of that story Lady Juliana had not the smallest doubt; but she\nknew how St. Aubyn's pride would revolt, and his delicacy be hurt, by\nthe necessity of interrogating such people on the conduct of his wife.\n\nShe felt herself indeed angry with Ellen for the childish impatience\nwhich had taken her out in the morning, after the fright of the night\nbefore had rendered repose so desirable, and for going to Mrs.\nBirtley's at all; but she could easily forgive a folly apparently of so\nlittle importance, since it was quite impossible for Ellen to have\nforeseen the chain of circumstances which followed, and involved her in\nso much distress.\n\nHow St. Aubyn happened to go to the same place, no one could guess; it\nappeared, indeed, extremely unlikely that he should have done so; but,\nas singular coincidences no less singular do sometimes occur, though\ntheir rarity makes us call them improbable, unless they arise within our\nown immediate knowledge.\n\nThe real truth was this: St. Aubyn, recollecting that Charles Ross had\nsaid the night before, \"_the woman where you lodged found you out_,\" had\ndetermined to ascertain, from this woman herself, what she had told\nRoss, and how she had dared to speak of him and Ellen in such terms; and\nto explain who her Mr. and Mrs. Mordaunt really were, that no farther\nslander, even in Mrs. Birtley's narrow circle, might attach to the\npurity of Lady St. Aubyn's character, had walked thither from Sir Edward\nLeicester's, with whom he had sat some time, arranging the particulars\nof their intended meeting with Charles Ross the next morning; there, to\nhis utter astonishment, he found Lady St. Aubyn's carriage in waiting;\nand inquiring of the servants where she was, was answered, in that\nhouse, meaning Mrs. Birtley's.\n\n\"And Miss Cecil?\"\n\n\"No, my Lord; Miss Cecil did not come out with my Lady, only Mrs. Jane.\"\n\nSt. Aubyn recollected Ellen's apparent agitation in the morning; the\nletter he had found her reading, and which she so hastily concealed; her\nhaving said Laura would go with her; yet she had come with only her\nmaid, a young ignorant girl, come to the very house where he believed\nRoss was residing; that Ross, of whom, though almost unknown to\nhimself, some secret jealousy had always lurked in his heart.\n\nAll these circumstances rose at once to his memory; and, without waiting\nto knock or ring, the door standing open, he rushed hastily into the\nparlour, where the first object that struck his sight was his wife, his\nbeloved, his adored Ellen, while her hand was held by the man on earth\nhe most detested, the man who but the night before had insulted her and\noutraged him! What could he think? Was it wonderful that the fury which\nswelled his heart broke into words of reproach and anger? Was it not\nrather wonderful he could so far command himself, so far reflect, as to\nreturn with her apparently calm, and that he did not at once cast from\nhim a woman who must have appeared so ungrateful and insincere?\n\nLady Juliana having with the aid of Miss Cecil and Jane put Ellen to\nbed, would have retired to seek her nephew, leaving Laura shocked,\nastonished, and grieved, remaining with her friend; but seeing the flush\nof fever on her cheek, and an unusual brilliancy in her eyes, they sent\nwithout delay to the family physician, who, after asking a few\nquestions, and learning the Countess had been alarmed, and was then\nunder the influence of terror for her lord, who, Laura whispered to him,\nthey feared was meditating a duel with a gentleman who had insulted Lady\nSt. Aubyn, the doctor shook his head, and said if her mind were not\nquieted immediately, he would not be answerable for the consequences:\nshe had, he said, every symptom of an alarming fever, and that if she\nwere not soothed, and kept quiet, the worst event might be expected both\nto herself and the unborn babe.\n\nAlarmed beyond measure, Lady Juliana now ran to seek St. Aubyn. With\nsome difficulty she prevailed on him to grant her admittance, and with\nstill greater, to hear what she had to say. She repeated the whole story\nJane had told her: he shook his head, was silent, but not convinced. She\nsaw his incredulity, and with some hesitation proposed to interrogate\nthe men servants who went out with their lady as to the real cause of\nher alighting at Mrs. Birtley's. He started indignantly from the idea;\nbut Lady Juliana assuring him she could ask in such a way as should give\nthem no suspicion why they were questioned, he at last consented, and\nringing the bell, she ordered the coachman to be sent to her.\n\n\"John,\" said she, \"your lady has been frightened at something or other\nthis morning during her absence from home. Were the horses restive?\"\n\n\"No, my Lady: the horses went as quiet as lambs to ---- Street, where we\nstopped while my Lady went into a house, I believe to see a poor family,\nas her Ladyship does sometimes; and then we went to the poor old blind\nlady's, that Mrs. Jane says her Lady maintains; and after that we went\nto another house, where my Lady said she would not alight, and told Mrs.\nJane to make haste and get the book, for she would not stop an instant;\nbut I was afraid to turn the carriage with her Ladyship in it, the\nstreet being very narrow just there, and a dray standing at the house\nopposite, for fear the horses should prance a little, which my Lady is\nalways afraid of; and so I begged her just to alight a minute while I\nturned, which she seemed not to like to do, but the old lady of the\nhouse coming out and persuading her, she said she would get out for a\nminute, and the people staring at her as she stood on the pavement, she\nwent into the house, and I believe something or somebody frightened her,\nfor as I drew up to the door, which was not directly, for the horses\nwere a little unruly, I saw a young man go into the parlour where my\nLady was waiting, and a minute after, I heard Mrs. Jane scream; and I\nwas going in, and so was James, but just as I was getting off my box,\nand Richard was standing at the head of the horses, my Lord came up, and\nafterwards I found my Lady had fainted away.\"\n\n\"Then your Lady had only been there a short time?\"\n\n\"Not above ten minutes I am sure, Madam, and as Mrs. Jane screamed when\nthe gentleman went into the parlour, I think he must have frightened\nher.\"\n\n\"Very well, John: I was afraid it was the horses, and if so, Lady St.\nAubyn should never have gone with them again.\"\n\n\"Oh, no, my Lady, the horses are quiet enough, poor things, only that\nnarrow street made me think my Lady had better alight.\"\n\nThe man then retired, and Lady Juliana said:--\"Well, St. Aubyn, are you\nnow satisfied?\"\n\n\"Not quite; all this might have been contrivance and art.\"\n\n\"How is it possible you can think so! Did you ever see the slightest\ntrace of either in Ellen?\"\n\n\"Yes, to-day. Why did she tell me Laura was going with her? Why conceal\nwhere she was going?\"\n\n\"Laura lamented just now not having gone out with Ellen, as she\nrequested on account of a bad head-ache: as to Ellen's not telling you\nwhere she was going, that arose from a fear lest you should prevent,\nwhat, with the natural impatience of youth, she had set her heart upon.\nBut if you still doubt, let us inquire of this woman, this\nMrs.----what's her name?--the mistress of the house where you lodged:\nshe can tell what Lady St. Aubyn's errand was there, and why she\nalighted.\"\n\n\"Good God! Madam,\" said St. Aubyn, peevishly, \"would you have me go\nabout collecting evidences whether I ought to believe my wife\nblameless, or the most deceitful of women?\"\n\n\"Yes I would,\" replied Lady Juliana, warmly, \"if you can suspect her; if\nsuch modesty, such guileless sincerity, and purity of words and manners\nas I never before saw in woman, have no power to convince you: if you\ncan set against them all this one unlucky accident, for I am sure it is\nno more, you ought to do every thing, seek every body who can give you\ninformation. Good God! to what purpose is it, as to this world, that a\nwoman should lead the purest and most unspotted life, if one equivocal\nappearance can drive all confidence, all reliance, from the heart which\nought to know her best!\"\n\nTouched by this generous warmth, St. Aubyn began to feel convinced he\nhad gone too far: he knew how penetrating Lady Juliana was, how much she\nhad been prejudiced against Ellen, and how cautiously she would have\nobserved, ere she had given to her an affection and confidence so\ntender: he called to mind many \"a proof of recollected love,\" of native\nmodesty, of the strictest principles in his wife, and began deeply to\nrepent his jealous rashness; but suddenly recollecting the note he had\nseen in her hands, and the haste with which she had concealed it, he\nhastily said:--\"But the letter! What letter was that I found her\nreading?\"\n\n\"What letter?\" asked Lady Juliana.\n\n\"One I found her reading this morning, just before she went out; she\nseemed agitated, and had tears in her eyes, and as I entered, she put it\ninto the fold of her morning dress.\"\n\n\"And there,\" said Lady Juliana, eagerly, \"I found it, when we undressed\nher just now: I have not opened it; here it is.\" She drew it from her\npocket. St. Aubyn recollected it to be the same, and opened it with\ntrembling hands. It was, as has been stated, from the officer's widow\nto Jane, entreating her good offices with her lady, and describing her\nown distress, agreeing exactly with what Ellen and her maid had told\nLady Juliana, and she had repeated to St. Aubyn. Such a corroboration of\nher story he could resist no longer; but shocked, alarmed, and ashamed,\nhe hastily said:\n\n\"I have injured her! Oh! can she ever forgive me!\"\n\n\"It's well,\" said Lady Juliana with some asperity, for his jealous\nobstinacy had vexed her--\"it's well if you have not killed her and your\nchild too. God defend me from such rash, headstrong people, that can\nmake no distinction between a _Rosolia_ and an _Ellen_: poor girl, she\nhas paid dear I am afraid for her dream of happiness, and being \"perched\nup in a glittering greatness, wearing a golden sorrow!\"\n\n\"For God's sake, Madam, no more reproaches,\" said St. Aubyn, angrily:\n\"she has not suffered alone; but let me go to her; let me implore her\nto forgive me. Ah! can I ever forgive myself!\"\n\n\"Indeed, nephew, I shall do no such thing, unless you will promise me\nthere shall be no fighting with that mad Ross, who I wish had been a\nthousand miles off before he had come here to drive us all as mad as\nhimself.\"\n\n\"We will talk of that, hereafter: perhaps he will apologize; at any\nrate, let us go now to Ellen, and try if I can sooth her spirits, and\ncalm her wounded mind.\"\n\nBut Ellen by the time he reached her was in no condition to hear him:\ndelirium had seized her, and the scene at the Opera dwelling on her\nmind, on which it had made a powerful impression, connected, though\nwildly, with the late untoward events, she exclaimed just as he entered\nthe room, \"Remember, St. Aubyn, remember Arbace--_and I too am\ninnocent_?\" then in low tones she imitated the recitative which had\ntaken such hold on her imagination; and sung in a sweet and plaintive\nvoice \"Sono Innocente!\" St. Aubyn, combining these words with all the\ninteresting ideas connected with them, with the generous assurances\nEllen had so often given him, that no appearances should ever shake her\nfaith in _his_ integrity and honour, assurances which he had so ill\nrepaid, was overwhelmed with grief and remorse: he put aside the\ncurtain, and kneeling by the bed-side, said in the tenderest accents:\n\n\"Ellen, my love, my injured Ellen, will you not hear, will you not\nforgive me?\"\n\n\"So you are come at last,\" said she, turning her head quickly towards\nhim: \"go to your son, my good friend, and tell him he has cruelly\ninsulted me; that I am St. Aubyn's _wife_, not the wretch he calls me:\nwhy, you know, Mr. Ross, you married us, and my father and Joanna were\npresent: then what does Charles mean by talking of my _shame_ and\n_ruin_?\"\n\n\"Oh, Heavens! she raves,\" exclaimed St. Aubyn; \"my cruelty has\ndestroyed her!\"\n\n\"Take away the bloody sword,\" screamed Ellen. \"I tell you Arbace did\n_not_ murder him; no, nor yet St. Aubyn: nothing shall ever make me\nbelieve St. Aubyn guilty:--I promised him;--he says he is innocent;\nenough, my love, enough, Ellen will _never doubt you_!\" and again she\nbreathed in plaintive cadences the pathetic \"Sono Innocente.\"\n\n\"She will die! she will die!\" wildly exclaimed St. Aubyn, starting up:\n\"run for more help! fetch all the physicians in London. Oh! have I lived\nto this!\"\n\n\"You will kill her indeed,\" said Laura, \"if you are not quiet: leave her\nto us. Doctor B---- will again be here in a few minutes: he says if she\ncan but be quiet, can but be made to understand, all is well; she will\nrecover; but indeed, my Lord, you must leave her now.\"\n\n\"No, Laura, I will not go; I will sit here without speaking; but should\nshe recover her senses, if only for a minute, it will I know comfort\nher to see me here.\"\n\nThis Laura could readily believe, and therefore made no further\nobjection; but Doctor B---- arriving soon after, comforted them all with\nthe assurance, that though the Countess's fever at present ran high, he\nhad great hopes that perfect quietude, and the medicines he had ordered,\nwould, in all probability, do much for her, especially, aided as they\nwere by youth and an excellent constitution, and that he saw no\nimmediate danger. He strictly enjoined, however, that her chamber might\nbe kept as still as possible, and that at most only two persons should\nremain there: he entreated St. Aubyn and Lady Juliana to retire, and\nhaving prevailed on them to do so, he told Miss Cecil he wished her to\nbe as much as possible one of Lady St. Aubyn's attendants.\n\n\"As to Lady Juliana,\" said he, \"she is so very anxious and restless;\nshe will only disturb our fair patient: you, my dear Miss Cecil, I\nperceive have that happy self-possession, joined with gentleness and\nactivity, which alone can make a good nurse; your voice too is\nparticularly calculated to sooth and persuade a sick person:--you may\nsmile, but believe me, few know how many qualifications are requisite to\nform a good superintendent of a sick bed, and amongst them I have always\nfound a soft but distinct articulation one of the most considerable.\nThink only how a nervous patient is what is emphatically called\n_worried_ by a droning, discontented voice, or alarmed by too loud a\ntone, or sudden question. I assure you I have often seen weak persons\nthrown into a fever by these apparently trifling causes; let me,\ntherefore, beg Miss Cecil will take upon herself the task of replying to\nany questions the Countess may ask, but in as few words as possible: the\nmoment reason returns, sooth her mind by every assurance that the\ndanger she so much feared is over. I shall see Lord St. Aubyn before I\nquit the house, and place before him the evil to be dreaded, should he\npursue this unfortunate business any farther.\"\n\n\n\n\nCHAP. IX.\n\n  Doubt shall for ever quit my strengthen'd heart,\n  And anxious jealousy's corroding smart:\n  Nor other inmate shall inhabit there,\n  But soft belief, young joy, and pleasing care.\n\n                                         PRIOR'S HENRY AND EMMA.\n\n\nThe medicines ordered by her skilful physician had so salutary an\neffect, that towards midnight Ellen fell into a quiet sleep, from which\nevery thing favourable might be expected. Lady Juliana was therefore\nprevailed on to retire to bed, Miss Cecil, Jane, and the housekeeper,\nsitting up with Lady St. Aubyn, the two latter in the anti-chamber. But\nLady Juliana was far from being satisfied, notwithstanding the\nassurances of St. Aubyn that all was at an end between him and Ross: she\nknew him too well to believe he would pass over insults so marked; and\nher watchfulness had convinced her no apology from Ross, in writing or\notherwise, had been received. Sir Edward Leicester, too, had called once\nor twice in the course of the day; and though she had tormented him and\nher nephew, by resolutely remaining in the room in defiance of the hints\nSt. Aubyn gave of wishing to be alone with his friend, yet she overheard\na few words, that more and more convinced her a duel was intended. She\nleft orders, therefore, to be called by day-break; and unable to prevail\non St. Aubyn to go to bed, wearied and exhausted by emotions, which, at\nher time of life, she could ill support, she at length left him to\nhimself.\n\nDetermined as he was to meet Ross in the morning, and avoiding\nreflections, which, though he felt how decisive they were against the\npractice of duelling, he yet thought came too late. St. Aubyn's frame\nwas shaken by various sensations. Recollection of the past, and terror\nfor the future, hung heavily upon him; yet not for himself he feared:\nbut should any thing amiss happen to him, what would become of Ellen--of\nEllen, whom he should leave upon a bed of sickness, which, then he felt\nconvinced, would be to her the bed of death!\n\n\"And was it for this,\" he exclaimed, as he paced his study, \"for this I\ndrew her from her native shades, where, happy and contented, but for me\nshe might have blossomed still. Oh! little, my Ellen, hast thou had\ncause to rejoice in that elevation which doubtless many have envied\nthee. Too often have I been to thee the mysterious cause of sorrow and\nanxiety. Perhaps I shall have been also the cause of thine untimely\nend.\"\n\nThe idea so dreadfully shook him, he dared no longer think, lest it\nshould quite unman him; but determined to look upon her once more, he\ntook the taper, which burnt beside him, and, with light steps, passed to\nher apartment. In the anti-room he found the housekeeper and Jane both\nsleeping in their chairs: all was profoundly still, and he began to fear\nEllen was left without a wakeful guard; but at the sound of his\nfootsteps, almost noiseless as they were, and the approaching light, for\nthe bed-room door was open for air, Laura Cecil stole to meet him: she\nmotioned to him to be silent, and advancing a few steps into the\nanti-room, said, in the lowest whisper, \"For heaven's sake, Lord St.\nAubyn, why this--why are you not retired to rest?\"\n\n\"Ah, Laura! dear, kind Laura,\" he exclaimed, grasping her hand, \"how\ncould I rest, while that injured, perhaps that murdered angel lies\nsuffering thus, and through my fault, through my accursed, headlong\njealousy!\"\n\n\"Deeply, indeed,\" said Laura, \"do I lament that appearances should have\nthus misled you, my Lord, and am indeed astonished at it: had you but\nwaited one hour, ere you so harshly condemned, from me you might have\nlearned her perfect innocence: she pressed me to go with her this\nmorning, which my having a bad head-ache prevented: she told me where\nshe was going, shewed me the letter she had received, detailed her kind\nplans for relieving the poor widow, and mentioned not having explained\nher intentions to you, lest you should prevent her going; and she wished\nso much, she said, to see the _poor little infant_; certainly she did\nnot mention any intention of going to that fatal house where you found\nher, and which, I am assured, she never thought of till passing the top\nof the street she recollected the book she so much valued, and which I\none day heard her tell Jane to call for; but all this is now unavailing:\nlet me beg you to retire: should the murmur of our voices disturb her, I\nshall indeed greatly lament it.\"\n\n\"Oh, let me look upon her--once more let me see her! Will she die? Is it\npossible she may recover?\"\n\n\"It is very possible, almost certain, from her sleeping so quietly, if\nyou do not disturb her: but think, if she should awake and see you, at\nthis strange hour, with those distracted looks!\"\n\n\"Yet I must see her _now_--yes, Laura, I must venture all; for how do I\nknow if I shall ever see her more!\"\n\n\"For heaven's sake, what do you mean? Surely, surely you do not think\nof--you are not meditating----\"\n\n\"No matter what,\" said he hastily; \"I must see her _now_.\"\n\nLaura shrunk back astonished and dismayed; but feeling that he would not\nbe contradicted, she again, with light steps, approached the bed; where,\nin a profound sleep, the effect of opiates, lay Ellen, \"fair lily, and\nwhiter than her sheets;\" and but that in the stillness of night her\nquick short breathings were distinctly heard, it could hardly have been\nknown she lived.\n\nLaura then beckoned St. Aubyn to approach, which he did with trembling\nsteps, and shaded by the curtain, gazed wistfully upon her. Overcome by\nthe touching spectacle of youth, beauty, and innocence, in a few hours\nalmost destroyed by his rash jealousy, the tears now ran down his manly\ncheeks; and hardly could he restrain the groans which heaved his bosom,\nwhile Laura's eyes streamed at the affecting sight before her. At that\nmoment Ellen moved a little, and they both retreated, that if she opened\nher eyes she might not see them; but she still slept; and only murmuring\n\"dear St. Aubyn,\" and a few inarticulate words, she was again silent.\n\nAgain St. Aubyn asked Laura if it were possible she could recover, and\nshe assured him that Ellen already looked better than she had done an\nhour before; and at last, after he had knelt and imprinted a soft kiss\non one of her hands, which lay on the counterpane, and lifted up his\nheart to heaven, in silent prayer for her recovery, he was prevailed on\nto quit the room.\n\nThe rest of the night St. Aubyn spent in settling some papers, and\nadding a few lines to his will, all of which he locked into a drawer,\nand sealing up the key, directed it to Lady Juliana.\n\nAt day-break his valet, according to order, came to him. To this\nconfidential servant St. Aubyn explained the cause of his going from\nhome so early, and left the pacquet for Lady Juliana in his care, to be\ndelivered to her, should he not return in safety. He then sent to\ninquire of Jane for her lady, and had the happiness of hearing a\nfavourable account of her. St. Aubyn then set off, attended only by one\nservant, to the house of Sir Edward Leicester, whose carriage was at the\ndoor, and they instantly proceeded to Wimbledon, where, on the spot\nmarked in Charles Ross's letter, they alighted; and telling the coachman\nto draw off, and wait at a place they pointed out to him, the two\nfriends walked up and down some time, expecting Ross.\n\nIn about ten minutes they saw him approaching, but alone: St. Aubyn just\ntouched his hat, and said, \"Mr. Ross, where is your friend?\"\n\n\"My Lord,\" said Ross, in a firm tone, \"I am here, not to fight, not to\ndouble the injuries you have already received from me, but to make every\nconcession you can desire. I have brought no friend with me; I trust my\nhonour and my life implicitly in your hands. Are you prepared to hear my\nexplanation?--if not, I am ready to stand your fire.\"\n\n\"I know not, Sir,\" said St. Aubyn, haughtily, \"what has caused this\nsudden alteration in your sentiments: this meeting was at your own\nrequest; and the insults you bestowed on Lady St. Aubyn yesterday make\nme as desirous of it now as you were when you appointed it.\"\n\n\"Yet, my Lord,\" said Sir Edward, \"hear Mr. Ross: if this affair can be\naccommodated without bloodshed, I think myself called upon to insist it\nshall be so.\"\n\nSt. Aubyn bowed with a lofty air to Ross, and said:--\n\n\"Well, Sir, your explanation if you please.\"\n\nRoss now entered into a long detail of the circumstances which had\nmisled him, stated his fears of St. Aubyn under the name of Mordaunt,\nwhen he first saw him at Llanwyllan; that no letters from thence had\nreached him on the station where he had remained for the last half year,\ntill, about a month before his ship had come home, and he had been\nordered to London to receive a promotion as unexpected as it was\nwelcome; that he happened to lodge at Mrs. Birtley's, and by chance,\nfinding the volume of Gray Lady St. Aubyn had left there, he recognized\nthe initials \"C. F. M. to E. P.\" in the first page, which the words\n\"Dear Llanwyllan,\" written in another, confirmed. The answer Mrs.\nBirtley made to his impatient questions had convinced him who the Mr.\nand Mrs. Mordaunt she spoke of were: this woman had given him also such\naccounts as led him to believe they were not married, and hence his mad\ninsulting conduct at the theatre had arisen. He next repeated so\naccurately every word that had passed between him and Ellen, and\ndescribed their mutual astonishment at meeting so unexpectedly in such a\nnatural manner, that had St. Aubyn doubted before, he could have done so\nno longer.\n\n\"Yet,\" said Ross, \"convinced as I now was how wrong I had been, I could\nnot prevail on myself to apologize to one whom I confess I hated, for he\nhad robbed me of the only woman I ever loved; yet she had never, even in\nthe happy hours of our youth, given me the slightest hope of ever\nobtaining more than the affection of a sister from her, and even that\nseemed at times more the effect of habit than choice; for rough and\nunpolished, my manners repulsed, and choleric and hasty my temper,\nalarmed the gentle Ellen; yet I still flattered myself, time, and the\nretired situation in which she lived preventing her extraordinary beauty\nfrom being known, might have done much for me; but from the moment Mr.\nMordaunt was known to her, I easily perceived that hope was at an end;\nand now I had only to desire that I might fall by the hand of the man\nwho had raised her to that greatness. I could have done no more than\nwish for her; I therefore determined to keep my engagement for this\nmorning. But yesterday it came to my knowledge that the promotion\nintended for me had been granted to the solicitations of Lord St. Aubyn.\nStruck, ashamed at the base ingratitude of my conduct, I resolved at\nlength to make every explanation, every concession. I have done so, and\nnow, my Lord, it rests with you to accept this apology: if you refuse\nit, I am ready to stand your fire, for never will I lift my hand in a\ncause so unjust, and against a man, who, without my knowledge, had so\ngenerously befriended me.\"\n\n\"I told you before, Mr. Ross,\" said St. Aubyn, \"that for your excellent\nfather's sake I would overlook that in you which in another man I would\ninstantly have resented. I am not of a vindictive spirit, and the\npractice of duelling, though I have in some measure been forced to\ncountenance it, is against my principles. You are at liberty, Sir, to\nretire; I am satisfied.\"\n\n\"I dare not, my Lord,\" said Ross, \"attempt to offer any thanks for the\nkindness you intended me in my professional career; still less can I\nconsent to profit by it: I have not deserved it at your hands, and\ndeclining the promotion offered to me, I shall return to my ship, and\nleave England as soon as possible, and I hope for ever.\"\n\nSt. Aubyn's generous spirit was moved by this renunciation.\n\n\"That promotion, Mr. Ross,\" he replied, \"was sought for you at the\nrequest of Lady St. Aubyn, who had not forgotten the friend of her\nchildhood, and in hopes of gratifying your most worthy father, from\nwhom, as well as from your mother and sister, both my wife and myself\nhave experienced much kindness and friendship: I must therefore request\nyou will not renounce it.\n\n\"At this moment Lady St. Aubyn is extremely ill, in consequence of the\nalarming scene to which your mistake and my rashness gave rise: should\nthis illness prove fatal,\" (and his lips quivered with emotion as he\nspoke), \"never more must you and I meet again! Should she recover, as I\nhope and trust she will, I am so perfectly satisfied with the\nexplanations I have received, that I shall not be sorry to see your\nearly acquaintance renewed: for the present we part as friends.\"\n\nThen bowing, he took Sir Edward's arm, and hastened to his carriage,\nleaving Ross overwhelmed with shame and remorse for the treatment he\nhad given to a man so generous.\n\nOn reaching Cavendish Square he found Lady Juliana in the utmost alarm;\nfor missing him when she arose, and hearing at how early an hour he had\nleft the house, she had immediately suspected his errand abroad: she had\nsent to Sir Edward Leicester's, and learned from the servants that their\nmaster and Lord St. Aubyn had gone out together. Still more and more\nalarmed, Lady Juliana paced from room to room in dreadful agitation, not\nknowing whither to send or what to do. Soon after eight o'clock, Laura\nsent a note by Jane to Lady Juliana, saying Lady St. Aubyn was awake,\nthat the delirium had totally subsided, but had left her so extremely\nweak and low she could hardly speak to be heard, but was anxious to see\nher and Lord St. Aubyn, whose affectionate inquiries she had heard of\nwith much delight, and was prepared to see him with composure, and\nwithout recurring to the past. To trust herself near Ellen, agitated as\nshe was, Lady Juliana knew was impossible; she therefore ordered Jane to\nsay, that having sat up almost the whole night, neither the Earl nor\nherself was up, but in an hour or two they would be with her; then\nassuring the girl that the unfortunate misunderstanding of the day\nbefore was perfectly explained, she charged her not to drop a hint of it\namongst the servants, which Jane readily promised, and faithfully\nperformed.\n\nSoon after this, Doctor B. called, and to him Lady Juliana communicated\nher fears on St. Aubyn's account: he entreated she would not go near the\nCountess till her spirits were quieter, and by no means to let any ill\ntidings reach her, should such arrive: then visiting the sick room, he\nrejoiced to find his young and lovely patient out of danger, though\nextremely weak. The excellence of her constitution, assisted by his\nskill, had triumphed over the disease, and if no new alarm occurred, he\ndoubted not her perfect recovery: leaving strict and repeated orders\nthat no one should be admitted at all likely to hurry her spirits, he\nleft her, and as he passed down the staircase, was rejoiced to see St.\nAubyn enter safe and well. The Earl hastened to him with the most eager\ninquiries for his patient, and listened to his favourable accounts with\nthankful joy.\n\n\"As to Lady Juliana, my good Lord,\" said the physician, \"she is scarcely\nin her senses; you have frightened her almost to death: come, let me\nhave the pleasure of leading you to her, and telling her at the same\ntime how much better our fair patient is, after which I would advise you\nboth to take some repose, for your countenance tells me you have not had\nmuch rest last night, and I promise you, you must not go to Lady St.\nAubyn with those pale and haggard looks.\"\n\nThe joy of Lady Juliana at seeing St. Aubyn return safe and unhurt was\nextreme, and was still increased when he owned to her candidly where he\nhad been, and the satisfactory explanation he had received from Ross,\nwhich so completely put an end to this untoward affair for ever.\n\nIn the afternoon, St. Aubyn, promising to be as composed as possible,\nwas permitted to see Ellen for a few minutes. Both forbore to speak of\nwhat had passed, for both felt they could not endure to recur to it; but\nthe warmth and unaffected tenderness of his manner assured her that all\nsuspicion had been effaced from his mind; while the affectionate\nsoftness of her's proved to St. Aubyn that his unkindness was forgiven.\n\nIn a very few days Ellen was pronounced convalescent, though her\nremaining weakness, and Lady Juliana's precautions, confined her to her\ndressing-room: there, by slow degrees, she learned from her\naffectionate Laura all the circumstances which had led to Charles Ross's\nmistake, and that of St. Aubyn, nor could she help acknowledging that\nappearances had been in both instances against her: relieved however by\nhaving all her anxieties removed, and by a full though affecting\nexplanation with St. Aubyn, who gave her the tenderest assurances that\nevery jealous disposition was for ever removed from his mind, she now\nrapidly recovered: but as the weather was now becoming very warm, and\nshe had had no great reason to delight in London, she earnestly\nrequested to be allowed to return to Castle St. Aubyn; and the advice of\nher medical attendants coinciding with her wishes, the request was\neasily granted.\n\nBefore she left London, however, she, with her Lord, paid another visit\nto the officer's widow and her interesting family, and so arranged for\nthem as to ensure them a neat residence a little way out of town, and\nthe certain means of comfortable subsistence for the present; for it was\nher intention, with St. Aubyn's permission, to form a school, and other\nuseful institutions, in the neighbourhood of the Castle, in which she\nhoped to render the widow a service, as well as gratify herself, by\nplacing her at the head of the village seminary. She also visited Mr.\nDorrington again, and spent a delightful hour amongst his treasures;\nthen leaving her P. P. C. for Lady Meredith, and some other slight\nacquaintances, she joyfully left London on her way to Northamptonshire,\naccompanied by the Earl (more tenderly attached than ever), Lady\nJuliana, and Miss Cecil, Sir Edward Leicester promising to pay them a\nvisit very soon.\n\nDelighted indeed was Ellen once more to breathe the pure air of the\ncountry; and as they passed the little inn where they had stopped on\ntheir former journey from town, and caught a distant glimpse of the\nfarm-house where he had told her his real name and rank, she tenderly\npressed St. Aubyn's hand, and with a soft tear on her cheek, reminded\nhim of the circumstance.\n\n\"Ah, my Ellen,\" he said, \"much have we both suffered since that\ninteresting moment, but never more, through fault of mine, shall you\nshed another tear, save such as now glitter in your eyes--tears of\ntenderness and affection.\"\n\n\n\n\nCHAP. X.\n\n  She feels it--'tis her son! with rapture wild,\n  Bath'd in warm tears, from soft sensations prest.\n  She clasps him to her cheek, her lip, her breast,\n  And looks with eye unsated on her child.\n  He knows her, sure!--Sure, answering rapture his,\n  Leave her at least the visionary bliss!\n  Lo! his clear eye to her's responsive speaks,\n  And lo! his little mouth, that wistful seeks\n  Warm from her lip to suck the sweet o'erflowing kiss.\n  She hears the silent call--how quickly hears\n  A mother's heart.\n\n                                               SOTHEBY'S OBERON.\n\n\nArrived at the Castle, Ellen once more began to breathe; her colour and\nappetite returned, and she speedily recovered her strength, and thought\nshe had never been so happy: her Lord's renewed, and even encreased\naffection, Lady Juliana's sincere attachment, and the pleasing society\nof Laura Cecil, who remained her guest (Sir William being in Scotland\nwith Lord and Lady Delamore), left her scarcely any thing to wish.\n\nThis little party received a very agreeable addition about a week after,\nby the arrival of Sir Edward Leicester, whose continued attentions to\nMiss Cecil seemed not ill received by her.\n\nSoon after their return to Castle St. Aubyn, letters from Mr. Ross and\nJoanna arrived, filled with thanks and rejoicings for the promotion of\nCharles. They said not a word, nor seemed to know any thing of the late\ntransactions; and Lord and Lady St. Aubyn were glad he had not revealed\nthem. It appeared, that through St. Aubyn's interest, he had been made\nLieutenant, and honoured with the command of a small frigate, and was\ngone to cruize in the Mediterranean. At this latter circumstance Ellen\nwas not sorry; for she could not wish, after what had passed, to see\nCharles Ross again at present. Every thing, therefore, seemed now smooth\nbefore her; and though sometimes her thoughts would wander to the\nformer mysterious expressions of St. Aubyn, and recollecting that the\ntime he appointed for their elucidation was arrived, yet as she heard no\nmore of it, and he seemed to have lost those fits of gloom, which even\nfrom the commencement of their acquaintance had been obvious in him, she\nhoped all was passed over, and determined by no ill-timed curiosity to\nrevive painful ideas in his mind. But she yet fully knew not St. Aubyn,\nexcept when thrown off his guard by any sudden emotion: his command over\nhis spirits and features was wonderful; and no one who saw him composed,\ncheerful, and even gay, could have suspected what at times passed in his\nmind, nor to what unpleasant scenes he now looked forward. Not even Lady\nJuliana knew what reason he had to think of the future with\napprehension, though with much of what had formerly befallen him she\ncertainly was acquainted.\n\nThe families round the Castle paid every polite attention to Lady St.\nAubyn on her return: many, who had been absent when she was there\nbefore, now visited her; and though for the present she declined\nentering into large parties, every one seemed rejoiced to see her once\nmore amongst them. Not the least delighted was Miss Alton, who with\nunfading charms, and exhaustless professions of regard, came eagerly to\ngreet the charming Countess's return, to rejoice in her perfect\nrecovery, and to assure her how much she had suffered at hearing she was\nill in London.\n\n\"And oh! my dear Lady St. Aubyn,\" said she, \"think how shocked I was to\nhear some rude wretch had annoyed you at the theatre, and that your\nexcellent lord had like to have fought a duel about it. Oh! how thankful\nI am that these frightful scenes did not more materially injure your\nvaluable health, and that you are returned to us, if possible, more\nbeautiful than ever.\"\n\n\"And who, my dear Miss Alton,\" said Laura, who alone retained composure\nenough to answer her (for this familiar recurrence to scenes so painful\nhad greatly disturbed Lady St. Aubyn and Lady Juliana), \"who told you\nall this wonderful story?\"\n\n\"Oh, it was a cousin of mine, who happened to be coming out of the\nplayhouse just as it happened, and wrote me word of it; and that the\ngentlemen had exchanged cards: so you see I had pretty good authority.\"\n\n\"Yes,\" replied Lady Juliana, with her usual asperity, \"and no doubt made\npretty good use of it. Pray, Ma'am, did you think it necessary to send a\nman and horse round the neighbourhood with this amusing piece of\nintelligence; or were you contented with your own personal exertions?\"\n\n\"Dear Lady Juliana, I am sure I thought no harm; I only just mentioned\nit----\"\n\n\"To every one who would hear you, no doubt. If, at least, you had spared\nus the recital, it would have been quite as delicate, and more\nconsistent with your _tender feelings_ for Lady St. Aubyn.\"\n\nPoor Miss Alton, quite shocked to find she had given such offence to the\nold lady, of whom she stood in great awe, vainly attempted to rally her\nspirits, and soon after took her leave, earnestly wishing Lady Juliana\nhad staid in London; for she foresaw the entre of the Castle would not\nbe so easily granted to her now as it had been when only the\nkind-hearted Countess presided; and trembling, lest, if she were not\nmore cautious in future, she should not be admitted to see the little\nstranger when it arrived, and take cake and caudle in Lady St. Aubyn's\napartment.\n\n\"See,\" said Lady Juliana, drawing herself up, \"see, my dear, the\nconsequence of admitting such low, uneducated people to any degree of\nintimacy! This gossipping woman would not have ventured to hint at what\nhad passed, had you kept her at a proper distance: but the easy\nimpudence of such people in these degenerate times astonishes me. In the\ndays of the Countess of St. Aubyn, my mother, _she_ would scarcely have\nspoken to such a sort of person as this Miss--what do you call her?\" For\nwhen Lady Juliana felt proud or indignant, she had a great knack of\nforgetting any name which had not a title tacked to it; though no one\nremembered more accurately those which had.\n\n\"Ah!\" thought Ellen, \"how with pride so overbearing could I ever have\nhoped to be myself exempted from this general censure of such sort of\npersons! How fortunate I may think myself, to have overcome a prejudice\nof such long standing.\"\n\nIn the society of a few agreeable neighbours, and the ever-pleasing\nconversation of Laura, the time passed serenely till the end of August:\nyet there were moments when gloom seemed again to steal over the\nfeatures of St. Aubyn. His foreign letters arrived more frequently, but\nappeared to give him no satisfaction. With Ellen he studiously avoided\nall conversation on the subject of his anxiety: for he dreaded, in her\npresent state, the least alarm, and delayed by every means in his power\nthe apparently fast approaching crisis of his fate, till her safety\nshould have been secured.\n\nAt length, after some hours of uneasy watching, and the most painful\nanxiety, Lady Juliana announced to him the birth of a _son_, who,\nnotwithstanding all the alarms his mother had undergone in London,\nseemed likely as well as herself to do well. Lady Juliana was in\nraptures at this event, to which she had so long looked forward with\nimpatience. Nothing that money could procure was wanting to decorate\neither the infant or the chamber where he lay, which, as well as that of\nthe Countess, had been entirely new furnished in the most superb and\ncommodious manner at her expence, Lady Juliana having insisted on paying\nfor every thing prepared, even to the elegant cradle lined with quilted\nwhite satin; and not even Lady Meredith had softer cushions than those\non which the infant heir reposed.\n\nSt. Aubyn, charmed with the lovely little creature, and to see its\nmother safe, appeared as if he had no wish ungratified, and left no\ntender attention unpaid which might ensure his Ellen's health and\ncomfort. As she approached towards convalescence, Laura Cecil was her\nconstant and most delightful companion, and well knew how to cheer and\nadorn the hours which were necessarily given to the quietude of her own\napartments. The infant was rather delicate though healthy; but safe in\nits mother's fostering cares it strengthened every day, without those\ncares----\n\n  Ah! what avails the cradle's damask roof,\n  The eider bolster, or embroidered woof,\n  Oft hears the gilded couch unpitied plains,\n  And many a tear, the tassel'd cushion stains!\n  No voice so sweet attunes his cares to rest,\n  So soft no pillow as his mother's breast!\n    Thus charm'd to sweet repose, when twilight hours\n    Shed their soft influence on celestial bowers,\n  The cherub, Innocence, with smile divine,\n  Shuts his white wings, and sleeps on beauty's shrine.\n\n                                                         DARWIN.\n\nIncessantly anxious about the babe, Lady St. Aubyn could not soon permit\nit to be removed from her apartments, it lay therefore with its nurse in\na smaller room within that where Lady St. Aubyn slept.\n\nIt was about six weeks after this event, so interesting to all parties,\nhad taken place, and Ellen had for some time been returned to the\nsociety of her own family, that one day, just as they had finished\ndinner, St. Aubyn was told two gentlemen in a chaise and four had just\narrived, and requested to speak to him immediately. He changed colour,\nbut conquering his purturbation, desired they might be shewn into his\nstudy, and he would go to them. \"Who are they?\" said Lady Juliana. \"I\ndid not know, nephew, you expected any company.\" \"Perhaps,\" said St.\nAubyn, evading her questions, \"they may not remain here an hour, perhaps\ntill to-morrow morning.\" He hastily left the room, and Ellen was\nconvinced these strangers were the persons at whom St. Aubyn had often\nhinted as connected with the mystery which hung around him: she\ntrembled, and felt dismayed, but endeavoured to be as composed as\npossible. In a few minutes after St. Aubyn had left the room, Mr.\nMordaunt was sent for; and as he had been some time an invalid, St.\nAubyn desired a carriage might be dispatched to bring him to the Castle.\nEllen passing soon after up stairs to the nursery, crossed him in the\nhall, followed by his assistant with a quantity of papers and\nparchments: they bowed, and went into the study. \"Oh, I know now,\" said\nLady Juliana, who was with her, \"who St. Aubyn has with him: it is I\nsuppose Lord De Montfort, and his guardian and tutor, Mr. O'Brien, a\nCatholic priest, who has the entire management of the young man, and\nwill I suppose now have the entire direction of his estates, which have\ntill now been under the care of my nephew, who was appointed by his\nfather's will the young Earls guardian, as far as related to his English\nproperty, till he should be twenty-four, though his Catholic relations\nhave had the care of his person. Rejoiced shall I be when St. Aubyn has\nfinally concluded all his concerns with that family. Heaven knows they\nhave given him trouble enough already! and this young man I know hates\nhim. I don't suppose he will stay an hour after the accounts are\nsettled, indeed he would not have come at all, only Mordaunt having all\nthe affairs in his hands, and being too unwell to go from home, it was I\nconclude necessary: this I know, if these people stay here to-night, I\nshall remain in my own room.\"\n\nEllen carefully and anxiously attended to all she said, yet this\ndiscourse gave her no clue by which to unravel the mysterious speeches\nof St. Aubyn. After spending an hour in the nursery, both ladies\nreturned to the drawing-room, and sent a servant to know if coffee\nshould be carried into the study, or if Lord St. Aubyn and his guests\nwould join the ladies. Orders were given for tea and coffee in the\nstudy; and Lady Juliana could not restrain her curiosity enough to\nrefrain asking who was with Lord St. Aubyn: from the servant she\nlearned that the party consisted of his Lordship, Mr. Mordaunt, his\nclerk, and two strange gentlemen, one elderly, the other young, and\napparently in ill health. This confirmed her surmises, and soon after\ntea, not wishing to see Lord De Montfort, should he make his appearance,\nshe retired to her own room, leaving Ellen and Laura together, with a\nstrict injunction to the former not to be kept up too late.\n\nEllen's anxiety made her somewhat silent; and Laura, never very\ntalkative, easily fell into her present humour, so that for some time\nvery little conversation passed between them. Laura was netting, and\nEllen attempting a drawing; but her hand was unsteady, and her attention\ndivided, therefore finding she should not succeed, she threw down her\npencil, and listened in silence to a loud equinoxial wind, which howled\naround, and shook with \"murmur not unlike the dash of ocean on his\nsounding shores\" the ancient trees which grew near the mansion. A\nchilling sensation insensibly stole upon her, and at length, to break\nthe melancholy silence of the apartment, rather than that she wished to\nspeak, she said, \"'Tis a rough night, and cold.\"\n\n\"Yes,\" said Laura; and they both drew nearer the fire.\n\n\"Do you know Lord De Montfort?\" asked Ellen.\n\n\"I have seen him when a boy,\" replied Laura, \"and think I should know\nhim again, though six or seven years make a great alteration at his\nage.\"\n\n\"Was he handsome?\"\n\n\"Yes, but not so much so as his sister.\"\n\n\"Is he like her?\"\n\n\"A little, but of a darker complexion: her's was a clear lively brown;\ndark hazle eyes, full of spirit, and indeed at times of scorn, a Grecian\nnose, full lips, the upper one curled a little, which gave a haughty air\nto her countenance; Edmund was thinner, paler, and his eyes had a\nsofter look.\"\n\n\"Edmund is his name?\"\n\n\"He has a long list of names, according to the Spanish custom; but his\nsister always called him Edmund, which was his father's.\"\n\n\"I wonder whether we shall see him?\"\n\n\"Of course,--I suppose so,\" said Laura, with some surprize: \"it is too\nlate for him to quit the Castle to-night, and he will without doubt pay\nhis compliments to you before he departs.\"\n\n\"I think,\" replied Ellen, \"from what Lady Juliana said just now, that\nSt. Aubyn and Lord De Montfort are not on very good terms, that made me\ndoubt whether he would stay the night.\"\n\n\"It may be so,\" said Laura, \"yet unless they are decidedly at enmity,\nthe young man cannot avoid seeing you.\"\n\nSoon after the supper tray was brought into the room, and on its being\nannounced to the gentlemen, St. Aubyn came to the library, accompanied\nby Mr. Mordaunt and Mr. O'Brien, the latter of whom he introduced to the\nladies. St. Aubyn looked pale, and his manners had lost some of its\nusual composure. O'Brien was a grave, respectable old man, of Irish\nextraction, but bred in a convent abroad, and speaking English but\nimperfectly.\n\n\"I will return to the study,\" said St. Aubyn, \"and see once more if I\ncan persuade Lord De Montfort to take some refreshment. You remember De\nMontfort, Miss Cecil?--He is my other guest, but he pleads fatigue, and\ndisinclination to see any one, and will not be prevailed on to take even\na glass of wine. I will once more endeavour to induce him to join you.\"\n\n\"Indeed, my Lord,\" said Ellen, \"I hope he will: if he be fatigued, he\nmust the more need refreshment.\"\n\n\"My love,\" said St. Aubyn, \"will you have the goodness to order beds to\nbe prepared for Lord De Montfort and Mr. O'Brien. They remain here this\nnight.\"\n\nHe then left the room, and Ellen ringing the bell, desired Mrs. Bayfield\nmight be sent to her dressing-room, whither a few minutes after she went\nherself to give orders respecting the beds. As she passed the study\ndoor, which was not quite close, she distinctly heard St. Aubyn say:--\n\n\"For Heaven's sake, De Montfort, be persuaded; do not wrong me so\ncruelly! Why condemn me on mere appearances?\"\n\nEllen passed hastily on, and heard St. Aubyn close the door with some\nviolence, warned perhaps by the light she carried that some one might\noverhear him.\n\nIn her dressing-room she met Mrs. Bayfield, and was instantly struck\nwith her pale countenance and agitated appearance.\n\n\"My good Bayfield,\" said Ellen, \"I sent for you to request you would see\nchambers prepared for the strange gentlemen; but you look ill, pray go\nto bed: Jane shall go with the housemaids and see that all is right.\"\n\n\"I am not ill, my Lady,\" said Mrs. Bayfield; \"but a glimpse I caught of\nLord De Montfort just now, and the tone of his voice, reminded me of so\nmany painful events--\"\n\nShe paused, sighed, and the tears ran down her cheeks as she added:\n\n\"I wish he had not come here; I wish he was gone back to Spain; I cannot\nbear to see him.\"\n\n\"His likeness to your late lady affects you perhaps, my good friend?\"\nsaid Ellen.\n\n\"Oh, no, Madam; it is not that; he is like her to be sure; but it is not\n_that_. I feel so uneasy when I see him.--He does not love my Lord; and\nyet he used to love him. But forgive me, Madam; I forget myself: will\nyour Ladyship please to give your orders now?\"\n\n\"I will leave all to your care, my good Bayfield. I suppose the\ngentlemen will like to be near each other: the two chambers at the end\nof the gallery where I sleep (those next to that your Lord sleeps in at\npresent, I mean) will suit them best, I think: see that they have good\nfires, for it is cold to-night: the wind is really alarming.\"\n\n\"Your Ladyship had better take another shawl round your shoulders: the\nstaircase is cold.\"\n\nEllen thanked her careful old friend, and returned to the company.\n\n\n                            END OF VOL. II.\n\n                B. CLARKE, Printer, Well Street, London.\n\n\n\n\n\nEnd of the Project Gutenberg EBook of Mystery and Confidence, Vol. 2, by\nElizabeth Pinchard\n\n*** "}, "github": {"text": "var videoState={\n\n    \n    create: function(){\n    var video;\n    var sprite;\n    \n      video = game.add.video('storyvideo');\n       video.play(false);\n       sprite = video.addToWorld(game.world.centerX, game.world.centerY, 0.5, 0.5, 2, 2);\n//pause\n        var picLabel= game.add.image(game.width/2, game.height-30, 'skip');\n        picLabel.anchor.setTo(-1,1);\n         picLabel.inputEnabled = true;\n         picLabel.events.onInputDown.add(this.start, this);\n\n//skip video\n// var picLabel= game.add.image(game.width/2, game.height-30, 'skip');\n//         picLabel.anchor.setTo(-2,1);\n//          picLabel.inputEnabled = true;\n//          picLabel.events.onInputDown.add(this.startgame, this);\n\n\n\n\n\n\n       // game.time.events.add(Phaser.Timer.SECOND * 10, this.fadeState, this);\n\n       // game.stage.backgroundColor= '#ffffff';\n\n        game.physics.startSystem(Phaser.Physics. ARCADE);\n        game.renderer.renderSession.roundPixels=true;\n        \n    },\n         \n         // fadeState: function(){\n         //   game.state.start('play');\n\n         // },\n    start: function(){\n game.paused = (game.paused) ? false : true;\n         game.state.start('play');\n            \n        },\n        //  startgame: function(){\n        //     game.state.start('play');\n            \n        // },\n\n};", "meta": {"content_hash": "1c932c7359417cc3e05f3380eabb7fac", "timestamp": "", "source": "github", "line_count": 51, "max_line_length": 89, "avg_line_length": 25.41176470588235, "alnum_prop": 0.5601851851851852, "repo_name": "nickchulani99/ITE-445", "id": "d9d5cb9bb5e54f95b73df6a87d4bcecebdc40318", "size": "1296", "binary": false, "copies": "1", "ref": "refs/heads/gh-pages", "path": "final/alien copy 4/js/video.js", "mode": "33188", "license": "mit", "language": [{"name": "HTML", "bytes": "16832"}, {"name": "JavaScript", "bytes": "451272"}]}}, "stackexchange": {"text": "Q: How to modify non-configurable, non-writable properties in Javascript? I'm writing a simple EventEmitter is ES5.\nThe objective is to ensure that all properties on EventEmitter instances are\nnon-writable and non-configurable.\"\nAfter 6 hours of racking my brain I still can't figure out how to, increase the listenerCount, for example if the configurable descriptor is set to false.\nHere's an example of what I have:\nvar eventEmitter = function(){\n  var listeners = listeners || 0;\n  var events = events || {};\n\n  Object.defineProperties(this, {\n   listeners: {\n    value : 0,\n    configurable: false,\n    writable: false\n  },\n  events: {\n    value: {},\n    configurable : false,\n    writable: false\n    }\n  });\n  return this;\n};\n\n\neventEmmitter.prototype.on = function(ev, cb) {\n  if (typeof ev !== 'string') throw new TypeError(\"Event should be type string\", \"index.js\", 6);\n  if (typeof cb !== 'function' || cb === null || cb === undefined) throw new TypeError(\"callback should be type function\", \"index.js\", 7);\n\n  if (this.events[ev]){\n    this.events[ev].push(cb);\n  } else {\n    this.events[ev] = [cb];\n  }\n\n  this.listeners ++;\n  return this;\n};\n\n\nA: I would recommend the use of an IIFE (immediatly invoked function expression):\nvar coolObj=(function(){\nvar public={};\nvar nonpublic={};\nnonpublic.a=0;\npublic.getA=function(){nonpublic.a++;return nonpublic.a;};\n\nreturn public;\n})();\n\nNow you can do:\ncoolObj.getA();//1\ncoolObj.getA();//2\ncoolObj.a;//undefined\ncoolObj.nonpublic;//undefined\ncoolObj.nonpublic.a;//undefined\n\nI know this is not the answer youve expected, but i think its the easiest way of doing sth like that.\n\nA: You can use a proxy which requires a key in order to define properties:\n\n\nfunction createObject() {\r\n  var key = {configurable: true};\r\n  return [new Proxy({}, {\r\n    defineProperty(target, prop, desc) {\r\n      if (desc.value === key) {\r\n        return Reflect.defineProperty(target, prop, key);\r\n      }\r\n    }\r\n  }), key];\r\n}\r\nfunction func() {\r\n  var [obj, key] = createObject();\r\n  key.value = 0;\r\n  Reflect.defineProperty(obj, \"value\", {value: key});\r\n  key.value = function() {\r\n    key.value = obj.value + 1;\r\n    Reflect.defineProperty(obj, \"value\", {value: key});\r\n  };\r\n  Reflect.defineProperty(obj, \"increase\", {value: key});\r\n  return obj;\r\n}\r\nvar obj = func();\r\nconsole.log(obj.value); // 0\r\ntry { obj.value = 123; } catch(err) {}\r\ntry { Object.defineProperty(obj, \"value\", {value: 123}); } catch(err) {}\r\nconsole.log(obj.value); // 0\r\nobj.increase();\r\nconsole.log(obj.value); // 1\n\n\n", "meta": {"language": "en", "url": "https://stackoverflow.com/questions/41069927", "timestamp": "2023-03-29", "source": "stackexchange", "question_score": "2"}}, "wikipedia": {"text": "Луе́рр () — колишній муніципалітет у Франції, у регіоні Пеї-де-ла-Луар, департамент Мен і Луара. Населення —  осіб (2011).\n\nМуніципалітет був розташований на відстані близько 270 км на південний захід від Парижа, 95 км на схід від Нанта, 27 км на південний схід від Анже.\n\nІсторія \n\n1 січня 2016 року Луерр, Амбію-Шато i Нуаян-ла-Плен було об'єднано в новий муніципалітет Тюффален.\n\nДемографія \n\nРозподіл населення за віком та статтю (2006):\n\nЕкономіка \n\nУ 2010 році в муніципалітеті числилось 182 оподатковані домогосподарства, у яких проживали 464,0 особи, медіана доходів виносила  євро на одного особоспоживача\n\nГалерея зображень\n\nПосилання \n\n [ Розташування муніципалітету Луерр на мапі Франції та сусідні муніципалітети]\n\nДив. також \n Список муніципалітетів департаменту Мен і Луара\n\nПримітки \n\nКолишні муніципалітети департаменту Мен і Луара", "meta": {"title": "Луерр", "url": "https://uk.wikipedia.org/wiki/%D0%9B%D1%83%D0%B5%D1%80%D1%80", "language": "uk", "timestamp": "20230320"}}, "cc_2019-30": {"pred_label": "__label__wiki", "pred_label_prob": 0.9617859721183777, "wiki_prob": 0.9617859721183777, "text": "Authorities: Ex-officer threatened to kill chief\nBy - Associated Press - Saturday, September 6, 2014\nABERDEEN, N.J. (AP) - Authorities say a former Aberdeen Township police officer stalked and threatened to kill the town’s current police chief.\nBut they wouldn’t say why 66-year-old Christian Witzig allegedly took those actions.\nThe Asbury Park Press (https://on.app.com/1rRqyEv) reports Witzig, who lives in Keansburg, was arrested this week. His bail was set at $100,000 cash and it wasn’t known Saturday if he has retained an attorney.\nCiting court documents, the newspaper said Witzig made the threat before going to Aberdeen police headquarters to confront chief John Powers- despite being previously told not to contact him.\nThe documents also state that Witzig repeatedly made alarming and threatening statements toward Powers and his family on five occasions\nPowers told the newspaper that he couldn’t comment and referred all questions to the Monmouth County Prosecutor’s Office.\nInformation from: Asbury Park (N.J.) Press, https://www.app.com", "source": "cc/2019-30/en_head_0000.json.gz/line380250"}}